[
  {
    "id": 1,
    "job": {
      "title": "Full Stack Engineer",
      "company": "Grand Software Solutions",
      "location": "Greater Toronto Area, Canada (Hybrid)",
      "job_id": "4342342640",
      "url": "https://www.linkedin.com/jobs/view/4342342640/?alternateChannel=search&eBP=CwEAAAGa8Qms6mmKXOmCgEAX8srhhtNhSaoi1WTn1b5ZDVwJaOOxZwsVOSuW-XUtqSlVTwudUkZhIFqUOUmfM8ArZyXHvWKeghQuZ5dVyC38YI_6URtE4mTPJG4toG9TzL9EjPhXBuwCCtM9dcKfPR5vED-mYLOaM8oFOsPgEI2tZqAyliOBZztLS7Tv19LmITMaXPQMW1Vf-h_8ubDpzD4PkRnJmgwtWVO1FYaReKLICnJDnyKSd2QFdxHJ3aTLrrsjAXzt50SOFh1NniyXRsdpYhuDTX_mfdsBaMc-lgkrDrn3QbYmK4pbzN4WQmTBWhQNB7GRgSF81q3Awoj0TVHs-rGmMGpyDJ0Ki1pUWv2aQuVBUyGkLllHQYUEk94DQFjejAUDsNnYzPAurijpV2DC7KX4q8W4voLL9ZWxjYjIxU5DyzjJjCdU1NigKyfU9ho1tZtr5W7IfKHy6UjYNO_0&refId=3u56gcKVGXqVE2RWHye9Tg%3D%3D&trackingId=Mq785cnwDQXsUFYz8DvAuQ%3D%3D",
      "description": "About the job\n\nFull Stack Engineer\n\nLocation: Toronto, Ontario, Canada\n\nWork Mode: Hybrid (3-4 days onsite)\n\n\n\n\nResponsibilities:\n\nDesign and develop robust, scalable, and efficient software solutions using industry best practices and cutting-edge technologies.\nDevelop our software framework on the front or the back end.\nCollaborate with stakeholders to understand and translate business requirements into technical specifications and actionable plans.\nArchitect and implement software systems that adhere to industry standards and regulatory requirements.\nConduct code reviews, provide technical guidance, and mentor junior team members to foster a culture of continuous learning and improvement.\nWork with cutting-edge fintech products and platforms.\nParticipate in testing, release cycle, and QA processes relating to client deployments.\nCollaborate with internal and external stakeholders to troubleshoot issues, implement solutions, and successfully deliver software projects within established timelines and budgets.\nStay abreast of emerging technologies, trends, and advancements in the financial services industry to drive innovation and maintain our competitive edge.\n\n\n\n\nRequirements:\n\nBachelor’s Degree in Computer Science, Information Systems or Software Engineering, or a related field\n4 years of experience delivering technology projects with financial institutions or enterprise firms\nExcellent communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams and communicate technical concepts to non-technical stakeholders\nStrong analytical and problem-solving skills, with the ability to think critically and strategically about complex technical challenges\nExperience writing commercial or open-source software\nProficiency in Java and experience in building Java-based Web applications\nExperience in developing user interfaces with Web technologies, such as HTML5, CSS3, TypeScript/JavaScript, JavaScript frameworks like React, Angular, and/or Vue\nKnowledge of current market technical trends, including Cloud, Cognitive, Digital, Microservices / APIs\nExperience with REST APIs and equivalents such as gRPC.\nExperience with the middle/backend tech stack: Java, Python, as well as common knowledge of databases such as MongoDB, Oracle, MySQL\nFamiliarity or experience with new and emerging supporting technologies such as Docker, Kubernetes, Kafka, ELK Stack, AWS, Azure, Google Cloud and/or other Cloud Technologies\nFamiliarity or experience with mobile technologies such as React Native, Flutter, and Ionic will be desirable.\n\n\n\n\nPreferred, but not required:\n\nKnowledge of build tools like Maven or Gradle.\nBasic understanding of DevOps practices and CI/CD pipelines.\nExposure to Cloud platforms (AWS, Azure) is a plus.\nFamiliarity with testing frameworks such as JUnit or TestNG.",
      "easy_apply": true,
      "posted_date": "44 minutes ago",
      "scraped_at": "2025-12-05T20:22:26.136241-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Strong full-stack development experience with relevant technologies like TypeScript, React, Node.js, and databases (MongoDB, PostgreSQL).",
        "Experience with cloud platforms (AWS, Azure) and containerization (Docker).",
        "Demonstrated ability to improve performance, reduce load times, and increase test coverage.",
        "Experience with REST APIs and CI/CD pipelines (GitHub Actions, Azure DevOps).",
        "Experience with Agile/Scrum development methodologies.",
        "Experience with AI integration using cloud APIs (Google Cloud, OpenAI, Azure OpenAI)."
      ],
      "gaps": [
        "Lack of explicitly stated 4 years of experience delivering technology projects with financial institutions or enterprise firms (needs to be better conveyed or potentially lacking).",
        "Limited explicit mention of Java experience (although Java is listed under Skills, it needs to be emphasized in experience).",
        "No explicit mention of Angular or Vue.js experience (although React is mentioned).",
        "No explicit mention of Oracle or MySQL experience.",
        "Limited or no mention of Kafka and ELK Stack, JUnit or TestNG."
      ],
      "suggestions": [
        "Quantify experience in the financial industry or enterprise firms, if applicable.",
        "Highlight any Java experience in project descriptions or experience sections.",
        "While React is strong, acknowledge experience with other frameworks like Angular or Vue.js, even if limited.",
        "Add specific examples of experience with REST APIs and their design principles.",
        "Elaborate on experience with DevOps practices and CI/CD pipelines, highlighting specific tools and workflows used.",
        "Mention any experience with Kafka, ELK Stack, JUnit or TestNG",
        "Tailor the summary to explicitly call out experience relevant to the financial services industry.",
        "Reorder skills to highlight Java."
      ],
      "summary": "The resume presents a strong candidate with solid full-stack development skills and experience with many of the technologies listed in the job description. The candidate demonstrates a results-oriented approach with quantifiable achievements. The primary gaps are the specific requirement of 4 years of experience in the financial industry, a stronger emphasis on Java experience and some missing technologies. Tailoring the resume to address these gaps will significantly improve the match score."
    },
    "job_category": "sde"
  },
  {
    "id": 2,
    "job": {
      "title": "Frontend Developer",
      "company": "Tata Consultancy Services",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325879306",
      "url": "https://www.linkedin.com/jobs/view/4325879306/?alternateChannel=search&eBP=CwEAAAGa8Qms6mCfDsivOerk8h-hBEeR0Zm0948lA6S1f-H8kAxh0emj5tuvJ9Q_seT7-rG00qNjAHjXFgoMO863oG5gfEStRuoIdxb-uZ6yKrzjVE34z3HkIuemcJl5QvTwLTTcbrXuRZQvRXlB2obNn4KBSt5r-dkVNqDZrDKBTJDTlWST0lZijW0DQJLP6IhfW-Mg8xfjvlFm-lxERvSKCz8yR8FcVmDJFyuILxeC8cmTLjuxxw9KmowsAnHsJ3NzZZZKcjdLRIdTcYAcNwzG5gfTG742uxGLZWvl1j_CayLt92bMpfKBwakI_0OhYgiOOCfDQ4bbGKHdVNHI-GKBUQWk8i3m_eCmEGKC03aESj22Hy5UEKSZWOrrwxlUSwL-njBirHV-bald4qLafI0EYEVB_azsLvQzHTP6XKQYRSwDsMp-dxghnxjaW0Hi1W5lPie6jAGi_SEkNOxwnEEnoBuPeOMDlw7pMo5YXU0_zA2CcStFfwf7iZKpfjSHu1OWIg&refId=3u56gcKVGXqVE2RWHye9Tg%3D%3D&trackingId=aiFOoshLPTuAtGbiANqGGw%3D%3D",
      "description": "About the job\n\nInclusion without Exception:\n\n\n\n\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people stories across our workforce and implemented through equitable workplace policies and processes.\n\n\n\n\nAbout TCS:\n\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $ 30 billion in the fiscal year ended March 31, 2025 [BS1] and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\n\n\n\n\nSkills and Responsibilities:\n\n \n\n •Front-End Developer (with AI Integration Expertise) Role Overview\n\n •The Front-End Developer with AI knowledge is responsible for building modern, responsive, and user-friendly interfaces while understanding how AI-driven features influence user experience.\n\n •This role requires strong front-end development expertise and conceptual awareness of AI technologies to collaborate effectively with AI teams.\n\n \n\n •Key Responsibilities Develop and maintain responsive web applications using modern frameworks.\n\n •Implement UIUX best practices for applications that may include AI-driven features.\n\n •Collaborate with designers and AI engineers to ensure seamless user experience.\n\n •Understand AI concepts to anticipate how AI outputs (text, recommendations, images) impact UI design.\n\n •Optimize front-end performance and accessibility.\n\n •Participate in code reviews and maintain high coding standards.\n\n •Required Skill Sets Technical Skills Proficiency in HTML5, CSS3, JavaScript, and TypeScript.\n\n •Expertise in frameworks like React, Angular, or Vue.js.\n\n •Familiarity with RESTful APIs and asynchronous data handling.\n\n •Basic understanding of AI concepts (e.g., what LLMs are, how AI features work).\n\n •Knowledge of state management (Redux, Zu stand) and performance optimization.\n\n •Exposure to responsive design and cross-browser compatibility.AI Knowledge (Conceptual)Awareness of how AI-generated content affects UIUX.\n\n •Understanding of ethical AI principles and user trust considerations.\n\n •Familiarity with common AI use cases (chatbots, recommendation systems, personalization).\n\n •Soft Skills Strong problem-solving and debugging skills.\n\n •Excellent communication and collaboration abilities.\n\n •Attention to detail and user-centric mindset.\n\n •Preferred Qualifications bachelor’s degree in computer science, Software Engineering, or related field.\n\n •Good of front-end development experience.\n\n •Interest in AI-driven applications and emerging technologies.\n\n\n\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodations during the recruitment and selection process, please inform Human Resources.\n\n\n\n\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
      "easy_apply": true,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-05T20:22:30.276025-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Strong proficiency in HTML5, CSS3, JavaScript, and TypeScript.",
        "Expertise in React framework.",
        "Familiarity with RESTful APIs and asynchronous data handling.",
        "Experience with UI/UX best practices demonstrated through project descriptions.",
        "Understanding of state management (Redux equivalents) and performance optimization.",
        "Exposure to responsive design and cross-browser compatibility.",
        "Demonstrated experience with AI integration (Google Cloud, Gemini, OpenAI).",
        "Experience with CI/CD pipelines (GitHub Actions, Azure DevOps).",
        "Strong problem-solving and debugging skills illustrated by project accomplishments.",
        "Experience with Agile/Scrum methodologies.",
        "Experience using cloud platforms like AWS and Azure."
      ],
      "gaps": [
        "No specific mention of Angular or Vue.js, although React expertise is highlighted.",
        "The depth of understanding of ethical AI principles and user trust considerations isn't explicitly detailed.",
        "No work experience, only co-op."
      ],
      "suggestions": [
        "Explicitly state experience with or knowledge of ethical AI principles if applicable.",
        "Quantify soft skills like communication and collaboration with specific examples from previous roles.",
        "While React expertise is great, briefly mentioning familiarity with Angular or Vue.js (even if limited) could be beneficial if true.",
        "Elaborate on the types of AI-driven features implemented in previous projects."
      ],
      "summary": "The resume is a strong match for the Front-End Developer with AI Integration Expertise role. Roger Xu possesses the required technical skills (HTML, CSS, JavaScript, TypeScript, React, REST APIs) and demonstrates experience with AI integration, UI/UX best practices, and performance optimization. The resume showcases relevant project experience and a good understanding of AI concepts. While some gaps exist (e.g., specific ethical AI knowledge and mentioning other frameworks like Angular or Vue.js), the strengths significantly outweigh the weaknesses, making the candidate a potentially excellent fit."
    },
    "job_category": "sde"
  },
  {
    "id": 3,
    "job": {
      "title": "DevOps/Cloud Engineer",
      "company": "Achievers",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4342295125",
      "url": "https://www.linkedin.com/jobs/view/4342295125/?alternateChannel=search&eBP=CwEAAAGa8Qms6oJ0UPNz0Fmkbjlp9Fs8OJLerYbf4MfLS5LupJ064mIQRYiesh9tUcMVNqstGBx-mlRD1zyKZd3UPKAvqiwvQF9j7Uwhp_LV9C0_89wk797F7-iVRbhqMpxmXDEkq9ju5AE6ZLsFFOrud-wJyC_fRTWEGKjDxAPEW7rmm6ArXoNDe5ewAmlkQ7AsEq2BWiTPkGDbuFKRWlf1t9awjELClrjB0KymFhf6ev3WC6K7eXZDmrpNTbyrTdhXgw240Nwf3XFILERvlNtvzBXFgpHK2eTolvxzKRBvOOcftphGsCjpQQF8Nzu8vncr02l9EdHzZOzBaqevJrZnM9lFfLhDly_84mvyWfj7jEmxxX9UakM4Cd4oUjuyVVTx2f0nUHn_KrJqEVHdkMgnTtaxEuqbG4ZR_jOUw_UFsfegpdepIXnSFwfvV5xZAbb7T4YtnE1dRbYi2P_ISSD9NCwiCzzmHRNoax2m7nSgabNy0zxrx-oUrdf8FqfE&refId=3u56gcKVGXqVE2RWHye9Tg%3D%3D&trackingId=TXTDuW%2B010uEFNceOrTAng%3D%3D",
      "description": "About the job\n\nAbout Achievers\n\nAchievers offers more than just a thank you program. Our employee recognition and rewards software inspires employees to recognize everyone, every day, everywhere. With 4.3 million global users, we empower employees across 190 countries. Visit us at achievers.com to learn more and check out our platform in action. Join our team of A-players who bring passion to our purpose and believe that meaningful change creates extraordinary outcomes — together, we’ll inspire recognition everywhere and achieve results that matter.\n\n Our commitment to you: \n\nAt Achievers, we hire you for you because we value the unique perspective and individuality that each person brings to our team. We are committed to creating an inclusive, diverse, and equitable workplace where you belong, and your contributions are celebrated. Together, we achieve more by combining our unique strengths, fostering collaboration, and inspiring each other to reach new heights.\n\nThe opportunity: \n\nWe’re looking for a DevOps Engineer who loves building, testing, and automating systems that make life easier for everyone. You’ll get to work with modern tools, experiment with new ideas, and help shape the future of our microservices platform. If you enjoy solving problems, trying new things, and bringing fresh thinking to the table, we’d love to meet you.\n\nHow you’ll shape our cloud infrastructure:\n\n\nWork cross-functionally with Engineering and Product teams to implement the technical and business requirements of the automation platform. \nWrite robust automation pipelines to enable faster development and delivery to our customers. \nDevelop and optimize CI/CD pipelines to ensure efficient software delivery processes. \nContinuously monitor, analyze, and improve pipeline performance for enhanced efficiency. \nBe ready to troubleshoot and resolve problems. Strive to improve how we operate, and to automate as much as possible. Document processes, standards, and best practices for pipeline optimization and testing.\nInnovate by participating in hackathons or creating your own repos to push initiatives important to you and your team. \n\n\nExperience we feel will set you up for success:\n\n\nBachelor`s degree in Computer Science or related field. Master`s degree is a great bonus. \nAdvanced/professional verbal and written English language skills.\nYou are curious and inquisitive about everything DevOps. You take a creative and resourceful approach to problem solving and you are motivated to learn new emerging technologies. \nAdvanced programming skills, in particular with Python and Bash. Experience with Golang is advantageous.\nPrior professional GitHub Actions experience, especially with complex pipelines and pipeline optimizations. \nAdvanced experience with Docker and Kubernetes.\nGood knowledge of IaC tools such as Terraform. \nHands-on experience working with Cloud technologies such as GCP or AWS.\nPrior experience with Argo CD is not required but advantageous\n\n\nWhy you’ll love working at Achievers: \n\n✨ We are passionate about disruptive technology that’s rooted in science, research and data.\n\n✨ We understand the value of employee success in the workplace and have been recognized in numerous publications for our contributions to HR, for technical excellence, and for our outstanding workplace culture!\n\n✨ We foster an environment of connection, security, and community. You’ll feel at home, without reservation.\n\n✨ We believe in moving quickly, failing fast, and adapting to change.\n\n✨ We enjoy coming to work every day because we believe in our product and love our culture.\n\n✨ We’re committed to achieving excellence in everything we do.\n\nBenefits & Perks for permanent full time employees:\n\n💰 Competitive Pay\n\n👶🏼 Parental Leave Top-up\n\n🩺 Health Benefits and Life Insurance Coverage Upon Your First Day\n\n🙌🏼 RRSP Matching\n\n🏖️ Flexible Vacation\n\n🤝🏽 Employee and Family Assistance Program\n\n👩‍💻 Full access to the LinkedIn Learning Library\n\n🎓 Internal Mentorship Program\n\n👏🏼 Employee-Led Employee Resource Groups\n\n🇨🇦 A beautiful office space located in Liberty Village, Toronto\n\n✨ Participation in our Points-based Employee Recognition Program\n\n📈 Opportunities for professional development and career growth\n\nOur work environment:\n\nAchievers is a hybrid-first company located at 99 Atlantic Ave in Liberty Village, Toronto. Our hybrid work experience is designed to cultivate an engaging employee experience, where pioneering research intersects with cutting-edge technology. We strongly believe that collocating teams increases the chance to innovate together, foster passive learning, create spontaneous connections, and promote better communication.\n\nAchievers does not offer employment to prospects without first ensuring that qualified candidates speak directly with the hiring manager and a member of our HR team. All qualification will be done face-to-face, whether that is in person or over Zoom. Achievers does not send out offers of employment without meeting candidates and does not offer employment via text. If you are requested for any personal information via text and/or without having met a member of our hiring team in person, please disregard.\n\nOur employees are a diverse and inclusive team of passionate, hardworking individuals. Achievers is an equal opportunity employer, committed to creating an environment where our employees can do the best work of their lives. We encourage all qualified candidates from all backgrounds and experiences to apply to join our A-Player family. \n\n Achievers is committed to ensuring an inclusive and accessible recruitment process for all candidates. If you require any accommodations for your interview, such as assistive technology, wheelchair accessibility, or alternative formats of materials, please let us know. We are happy to make necessary arrangements to support your needs. \n\nAt Achievers, we may use artificial intelligence (AI) tools to support parts of our hiring process, such as reviewing applications or analyzing resumes. These tools help our recruitment team but never replace decisions made by real people. We believe in a human-first approach to hiring, where your experience, personality, and potential are recognized by people, not algorithms, and where final hiring decisions are made by humans. If you would like more information about how your data is processed, please contact us.",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-05T20:22:34.146339-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Extensive experience with cloud platforms (AWS, Azure) aligns well with the job's focus on cloud infrastructure.",
        "Strong CI/CD experience (GitHub Actions, Azure DevOps) is a key requirement.",
        "Proficiency in Docker and containerization.",
        "Experience with scripting languages like Bash and Python.",
        "Experience with Agile methodologies",
        "Hands-on experience with monitoring and testing tools",
        "Experience improving pipeline performance"
      ],
      "gaps": [
        "No mention of Kubernetes, although experience with Docker is present.",
        "Limited or no mention of IaC tools like Terraform. However, the resume mentions some experience in AWS/Azure, which may involve some familiarity.",
        "No mention of GCP."
      ],
      "suggestions": [
        "Quantify the impact of improvements made to CI/CD pipelines by specifying metrics beyond deployment time, such as error rates or build success rates.",
        "Highlight any experience with Kubernetes, even if it's in personal projects.",
        "Showcase knowledge of IaC tools, even if it's through cloud platform experience.",
        "Tailor the summary to emphasize DevOps-related achievements and skills.",
        "If the projects have public repos, linking them could further enhance the application."
      ],
      "summary": "The resume is a strong match for the DevOps Engineer position. The candidate possesses relevant experience in CI/CD, cloud platforms, scripting, and automation. The resume would benefit from highlighting Kubernetes experience and emphasizing DevOps-specific achievements and familiarity with Infrastructure as Code (IaC) tools like Terraform. Mentioning experience with GCP if available, even in personal projects, would also strengthen the application. Overall, the candidate's skills and experience align well with the job requirements."
    },
    "job_category": "sde"
  },
  {
    "id": 4,
    "job": {
      "title": "Associate Automation Developer",
      "company": "Scotiabank",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325768952",
      "url": "https://www.linkedin.com/jobs/view/4325768952/?alternateChannel=search&eBP=CwEAAAGa8Qms6p7IN_A_YVXm7ocsCBzwTV5IkQMyRG2K5CxeEAdgy87bud6J2JAq8i2_m802_4-V2DBuzBS8DTj7BatM11mvie48gFIgkIaGK1Uh2-iqPFwwZwDBOz03Kbd9EewpiC9P-9i6m9q_zAW0VTZAMI47Zh7fzZ0fWQ3wbvttDy_GHk1YlmN5YDfuKAA8Ux1xxZol5GVN1i9A4c3Uu20yMYKVyB4c5otOh7avv4pUCd4TtHPB77NjzE1s_Qe3BWlFzWBXX03WGlvhrxtti6X56kLwiTipX8ye699HeEy0wyuxoUrtxJ62_1aveovFOTK1acoGDonMXFXRamck3im_AcByhhHCaH7F3idCYqfUWJp4WEYr4O5BijgeyyI-CNDufsAUUxgujOTa7EHJM8rhAG89DTRZTu4pqYu2rdT1jLJdvykJqacw_BdFRwRvb2uROKI6ixcYbYcKqDAaGrfrgVoqPboO6JGb1wgphqVHlK0gaAqa-lr8qC9Y97ur5ary&refId=3u56gcKVGXqVE2RWHye9Tg%3D%3D&trackingId=DJus%2FrpCIvRW0%2BiLuByS2A%3D%3D",
      "description": "About the job\n\nRequisition ID: 243642\n\nJoin a purpose driven winning team, committed to results, in an inclusive and high-performing culture.\n\nThe Role \n\nThe Process Automation team is a dynamic team focused on adding value to the bank by solving business problems through innovative solutions, leveraging modern tools, fostering a collaborative and creative environment, operating with efficiency, and executing with speed and quality\n\nAs an Associate Automation Developer, you support the development, testing, and maintenance of automation workflows using approved tools and frameworks as well as assist with simple development tasks such as making minor code adjustments under supervision and ensuring functionality through thorough testing and validation. This role involves close collaboration with business analysts and developers to translate process requirements into automation logic, as well as documenting technical steps and user instructions. The Associate Automation Developer will also participate in troubleshooting existing solutions and contribute to continuous improvement by staying informed on automation best practices.\n\nIs this role right for you? In this role you will:\n\n\nContribute to the design, development, and testing of automation workflows by leveraging approved tools and frameworks, ensuring solutions align with business requirements and technical standards.\nPerform code modifications and enhancements under the guidance of senior developers, adhering to structured development practices and established coding conventions.\nExecute and support basic development tasks, validating outputs through rigorous testing and quality assurance to ensure reliability and accuracy of automation solutions.\nCollaborate cross-functionally with business analysts, developers, and stakeholders to gather and interpret process requirements, translating them into effective and scalable automation logic.\nCreate and maintain comprehensive technical documentation, including configuration details, development steps, and user-facing instructions to support knowledge sharing and solution sustainability.\nAssist in the ongoing maintenance and troubleshooting of existing automation solutions, identifying and resolving issues to minimize downtime and enhance performance.\nStay informed on emerging automation trends and best practices, actively contributing to team knowledge and continuous improvement initiatives aimed at optimizing development processes and solution quality.\n\n\nSkills\n\nDo you have the skills that will enable you to succeed in this role? We’d love to work with you if you have: \n\n\nBachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\nInternship or academic project experience in software development is a plus.\nFamiliarity with one or more programming languages such as Python, Java, JavaScript, or C#.\nStrong knowledge of the .NET Framework and Microsoft Technology stack is an asset\nUnderstanding of basic software development principles and version control systems (e.g., Git).\nDemonstrates a high level of emotional intelligence (self-awareness, self-regulation, empathy, motivation, and social skills)\nHas an appetite to continuously evolve and improve, to tackle difficult problems and seek/give constant feedback\nFlexible and open, able to work in a highly collaborative and changing environment with the ability to move forward without having all of the answers\nConsistently seeks to understand, meet and deliver on customers’ expectations\nAn acute attention to detail while demonstrating the ability to thrive in high pressure/deadline\n\n\nWhat’s in it for you?\n\n\nA rewarding career path with diverse opportunities for professional development\nAn organization committed to making a difference in our communities – for you and our customers.\nA competitive rewards program includes annual bonus, flexible vacation, personal and sick days, and comprehensive benefits that start on your first day. \nDiversity, Equity, Inclusion & Allyship - We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employees to learn, grow & participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability & veterans.\nAccessibility and Workplace Accommodations - We value the unique skills and experiences every individual brings to the Bank and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements. \n\n\nLocation(s): Canada : Ontario : Toronto\n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. If you require technical assistance, please click here. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
      "easy_apply": false,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-05T20:22:51.778084-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Proficient in multiple programming languages including JavaScript, TypeScript, Python, and Java, as requested in the job description.",
        "Extensive experience with full-stack development, including frontend technologies like React and Next.js, and backend technologies like Node.js, Express, and databases such as MongoDB and PostgreSQL.",
        "Hands-on experience with cloud platforms (AWS and Azure) and DevOps practices, aligning with the automation-focused nature of the role.",
        "Experience with CI/CD pipelines, containerization (Docker), and testing frameworks (Jest, React Testing Library, Playwright), demonstrating a strong understanding of software development lifecycle.",
        "Experience in automating processes with tools like Azure Runbooks and Microsoft Graph API which is beneficial for an Automation Developer role.",
        "Demonstrated ability to improve efficiency and reduce deployment times, crucial for an automation role."
      ],
      "gaps": [
        "The job description mentions the .NET Framework and the Microsoft Technology stack as an asset; the resume does not explicitly emphasize these skills, although it mentions C# and Azure OpenAI Service.",
        "The job description values emotional intelligence and collaboration; while the resume mentions contributing to Agile ceremonies, it could better highlight specific examples demonstrating these soft skills.",
        "While the candidate has experience with AI, the job description doesn't emphasize AI skills, so this is not a major gap, but more closely aligning projects to Automation is preferred.",
        "The role is 'Associate Automation Developer', the resume doesn't have direct automation experience."
      ],
      "suggestions": [
        "Highlight experience with the .NET Framework and Microsoft Technology stack if applicable, or consider acquiring more experience in these areas to strengthen the application.",
        "Provide specific examples of collaborative projects, emphasizing teamwork, communication, and problem-solving skills to demonstrate emotional intelligence.",
        "Quantify achievements whenever possible to demonstrate impact and results.",
        "Tailor the resume summary to more directly address the keywords in the job description, focusing on automation and problem-solving.",
        "Include automation-specific projects if available. Mentioning the use of tools like Power Automate could be beneficial"
      ],
      "summary": "The resume demonstrates a strong alignment with the Associate Automation Developer role, showcasing proficiency in relevant programming languages, full-stack development, cloud platforms, and DevOps practices. The candidate's experience with process automation, CI/CD pipelines, and testing frameworks aligns well with the role's focus on automation workflows. While the resume could benefit from highlighting experience with the .NET Framework and Microsoft Technology stack, and more explicitly emphasizing collaborative skills, the overall match is high."
    },
    "job_category": "sde"
  },
  {
    "id": 5,
    "job": {
      "title": "Platform Developer – Entry Level Sales Program 2026",
      "company": "IBM",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4348573773",
      "url": "https://www.linkedin.com/jobs/view/4348573773/?alternateChannel=search&eBP=CwEAAAGa8Qms6yB40qUyz3JSiYBUoHJn3psh1I0AENtxDvcO-v0WpXGVV_9BWKjDyRvVofmgwgxBKALkL14y6X4KvDiVg_lvW_-k4mbDs_X1PEmzI9DeTHUu6kpJNi6c-vUfHDtHqCqitBgOXW5w0wO1KRcg69O0TK9h-KhmPFMS3VryUtxe7HKuR0ulyqlpIC3K7JfKe0DlanpyoBghPoflAhYmceCQ9gOgSSjqzSQs5AEHc25vK_wxxGBJYGcM9vsgJa6qilLEr571iPMBXrNmvm2sBcQ7-BrpmDbPiKD4rjUV22iMqRkvnkIId18HTjZQDvSlviei3YIgotevCUEstrE6fEzXVN3ay05g7FjxZLKkXBWRk-fX3ZWQ4lOIItBv2i7BYaTahg8U-TEsmOJ57JGQMCYTtrzKeYGg4Gx6KwP8Q2G_eUIIjXAjzLQ5fhB0L-8JTZSZOUw8iWilBEYdkIBgwVty_X4-RMCtzxCftqcjzG0cncMaEaZaqcpxUDI&refId=3u56gcKVGXqVE2RWHye9Tg%3D%3D&trackingId=v4etVSd7eNV1uVe9UpF8Rg%3D%3D",
      "description": "About the job\n\nIntroduction\n\nTechnology sales at IBM is evolving its way of working to break beyond boundaries with innovative approaches. Preferring to ‘show’ vs. ‘tell’, Client Engineering co-creates with clients, in real-time, on solutions to solve their hardest business challenges.\n\nAs a Platform Developer within Client Engineering, you'll be a key player in a multi-disciplinary team made up of Architects, AI Engineers, Designers, and Business Technology Leaders. The brightest and creative minds collaborating with clients as one team and contributing to experiential working sessions and builds. The outputs of which produce pilots that lead to deployment of enterprise-scale solutions at start-up speed.\n\nExcellent onboarding training will set you up for success, whilst ongoing development will continue to advance your career through its upward trajectory. Our sales environment is fast-paced and supportive. Always part of a team, you'll be surrounded by leaders and colleagues who are always willing to help and be helped – as you support pilots that compel clients to invest in IBM's products and services.\n\nYour Role And Responsibilities\n\nAs a Platform Developer within IBM Client Engineering, you'll help deliver unique client co-creation experiences to accelerate their transformation. You’ll be involved in all aspects of integrated solutions, from identifying requirements to make technical decisions that impact the business case. Your role will be to work with cross-functional teams to realize the full potential of our hybrid cloud and AI solutions and prove business value to our clients.\n\nYour primary responsibilities will include, but not be limited to:\n\n\n Cloud Expertise: Leverage contemporary hybrid cloud skills (ex. AI, analytics, DevOps, DevSecOps, IaC, security, networking, and storage) with deep industry expertise and understanding of your dedicated set of clients' businesses.\n Value Communication: Define and communicate the differentiated value of IBM's technology both technically and commercially.\n Technical Leadership: Participate in client sessions that include a broad range of public and hybrid cloud technologies, such as Red Hat OpenShift, IBM Cloud Paks, and Kubernetes.\n Solution Support: Support the solutions architecture plan and be a hands-on \"builder\" in client-facing engagements. Advise on solution architecture to align with platform best practices and focus on our clients’ target environment to ease transition to deployment.\n Transition to Deployment: Provide a seamless transition to our clients by working with deployment teams to transition platform assets and information.\n\n\nTo Be Successful In This Role, You Will Need\n\n\n Confidence to contact and engage potential new customers and deliver an elevated experience.\n Motivation to achieve sales, business objectives and high client satisfaction.\n Strong analytic, problem solving, and troubleshooting skills combined with an agile process.\n Embrace curiosity and a growth mindset.\n\n\nReadiness to travel up to 50% annually.\n\nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\n\n Technical Education: B.S. or M.S. in Computer Science, Computer/Electrical Engineering, Information Systems or equivalent technical degree/experience.\n Programming: Working knowledge in at least one common cloud native programming language (Java, Python, HCL, Rust, Ansible, or language in similar discipline.)\n Tech Savvy: Conversant about cloud technology, latest industry trends and how it is being applied to address business challenges.\n Team Player: Demonstrates team collaboration and can navigate different communication styles.\n Excellent Communication Skills: Possess verbal, written, and interpersonal skills that are engaging, compelling and influential.\n Self-Starter: Growth mindset, motivated to work with clients and can lead projects independently.\n\n\nPreferred Technical And Professional Experience\n\n\n Experience in deploying and operating solutions on AWS, Azure, IBM Cloud, or Google Cloud.\n Relevant technical certifications (e.. CNCF, AWS, IBM Cloud, Azure, Google Cloud, DevOps).",
      "easy_apply": false,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-05T20:23:05.179561-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong full-stack development skills with relevant technologies like TypeScript, React, Node.js, and cloud platforms (AWS, Azure).",
        "Experience with DevOps practices including CI/CD (GitHub Actions, Azure DevOps), containerization (Docker), and testing frameworks (Jest, React Testing Library, Playwright).",
        "Proven ability to improve performance, reduce load times, and increase test coverage in previous projects.",
        "Experience with Agile methodologies and team collaboration.",
        "Familiarity with AI integration through Google Cloud APIs, Gemini APIs, and OpenAI APIs.",
        "Cloud expertise and experience deploying solutions on AWS and Azure as demonstrated in the projects.",
        "Experience with serverless architecture using AWS Lambda and API Gateway.",
        "The candidate's resume highlights numerous projects and experiences that directly align with the job descriptions requirements for co-creating solutions for clients business challenges."
      ],
      "gaps": [
        "No direct experience with IBM Cloud or Red Hat OpenShift is explicitly mentioned.",
        "Lack of mention of specific experience in 'Technology sales' or 'Client Engineering'.",
        "No specific examples of defining and communicating the differentiated value of IBM's technology, both technically and commercially is not explicitly stated.",
        "No prior experience using programming languages like HCL, Rust, Ansible."
      ],
      "suggestions": [
        "Highlight experience with cloud security and networking skills, if any, as the job description mentions them.",
        "Quantify the impact of projects with specific business outcomes (e.g., cost savings, revenue generation).",
        "Tailor the summary to emphasize experience in client-facing roles and communication skills to show a better fit for a sales-oriented position.",
        "Explicitly mention any experience related to sales or pre-sales activities, even if it was part of a different role.",
        "Consider adding a bullet point in the summary or experience section stating familiarity with enterprise-scale solutions."
      ],
      "summary": "Roger Xu's resume demonstrates a strong alignment with the Platform Developer role at IBM Client Engineering. The candidate possesses a solid foundation in full-stack development, cloud technologies (AWS, Azure), DevOps practices, and AI integration. They have a proven track record of delivering high-quality software solutions and improving performance. However, the resume lacks specific experience with IBM Cloud technologies and direct sales or client-facing roles. Tailoring the resume to highlight relevant cloud security skills, communication abilities, and the business impact of projects would significantly enhance the match."
    },
    "job_category": "sde"
  },
  {
    "id": 8,
    "job": {
      "title": "Site Reliability Engineer (Node.js)",
      "company": "Scotiabank",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325971656",
      "url": "https://www.linkedin.com/jobs/view/4325971656/?alternateChannel=search&eBP=CwEAAAGa8Qq3J_Y_9yHfo8KTe5KuGtuIylGFFywDuoCn2aMabTGjLP3sB9-mJKirc9aFKTxCcfPn1bOD6v92JDkSH0Qv9VzamIm4qtiNEtUlhm7pOWFDQu0SdVClwIS5cd3mzfocMYskMJDkyk04DaJ9BPWzGP-7arWPnH9f6Psq1Ntdxlke4X2H8jFAsbLKfatYEKViGCMkGLm4ZSAMdu12GBk7_oP0wSjix_7rEARm5Mw7cpd7-wkViVBm0uM301pJYhjNlC7M-Bas2dzxhARpcrutur_xcoNxV-sC_HDdP8uGoMKe1vswhWBENUUEazmagx_QOzrKyl3gSzFnUONbY3hJRgboVn3R8pZGSr9m0NUG7TLcqa73aU6BLjuKdSkEsUOsabR7vgtzp0UGn7bRAuYhjODoIJ23jgcB5YBy9MBQ5WOBUoXj-GTOQRLyfDLyepX7yXDgHu-09OYTRnV-qT4EYShzJz9NbxqASriPS9fWggPJ4X9DmOmyfqpLlO1a2wb5euo&refId=de9ZBHPutu3wPXIWDhJ6Gw%3D%3D&trackingId=DlcEuX37ato0WIhk3Niqpw%3D%3D",
      "description": "About the job\n\nRequisition ID: 244026\n\nJoin a purpose driven winning team, committed to results, in an inclusive and high-performing culture.\n\nOverview: As a Site Reliability Engineer (SRE), you will join the Digital Engineering Operations team, responsible for ensuring the operations and reliability of Scotiabank digital applications. You will have the opportunity to drive the success of Scotia Digital production services by enhancing availability, scalability, performance, and reliability. The team proactively seeks ways to improve application monitoring, address production issues, and assist with customer inquiries. The role will also involve implementing tagging for customer analytics.\n\nIs this role right for you? In this role you will:\n\n\nSpecification Gathering: Gather and refine specifications and requirements based on technical needs.\nRisk Management: Direct day-to-day activities in alignment with our risk culture and relevant risk appetite statements, communicating these throughout the team.\nOperational Efficiency: Create an environment that promotes effective and efficient operations while ensuring adherence to day-to-day business controls for risk and compliance.\nDocumentation: Create and maintain comprehensive software documentation.\nCustomer Focus: Champion a customer-focused culture to deepen client relationships and leverage broader Bank relationships, systems, and knowledge.\nIncident Management: Drive incident management, problem management, and site reliability engineering (SRE) practices.\nLeadership in Crisis: Lead, triage, and communicate severity 1 and major incidents, including change management impacting the digital banking channel. Note that this role includes on-call responsibilities outside of traditional working hours.\nLiaison Role: Perform ongoing interaction between various units, including technology partners, customer-facing staff, QA departments, vendors, product groups, business lines, and leadership.\nSubject Matter Expertise: Provide end-to-end support as a subject matter expert.\nApplication Reliability: Lead initiatives to perform analysis for lasting application reliability.\nOperational Enhancement: Enhance steady-state operations, alerting, real-time monitoring, and operational visibility.\nApplication Deployment: Safely deploy provided code packages utilizing approved application security platform\n\n\nSkills\n\nDo you have the skills that will enable you to succeed in this role? We’d love to work with you if you have:\n\n\nEducation: Post-secondary degree in a related field (technical or business).\nTechnologies: (ES6+, Node.js, react.js); deep knowledge of Object-Oriented and Functional Design.\nIndustry Knowledge: Familiarity with Google SRE practices and ITIL service delivery methodology and previous 2+ years experience in SRE role\nLogical Thinking: Strong logical thinking in understanding end-to-end use cases and mapping them to system flows.\nCustomer Experience: Good understanding of how technologies, infrastructure, and processes impact the customer experience.\nInnovation: Curious and experimental mindset to drive innovation amidst uncertainty.\nProblem Management: Lead initiatives to perform deep analysis into recurring or complex problems.\nCommunication Skills: Effective communication and diplomacy skills to liaise between groups of varying technical expertise and interests.\nTechnical Expertise: Experience with at least one modern JS frontend framework, preferably Node.js and React.js; devops tools such as Git, Bitbucket, CI/CD (Azure DevOps), and Jenkins; application security platforms like Checkmarx, Blackduck, Webinspect; production-quality NodeJS servers, preferably with Express; REST API design; modern JS toolsets\nCloud Computing: Solid understanding of Cloud computing technologies – Kubernetes/Docker; GKE; Azure PCF is an asset.\nIncident Resolution: Experience driving incident resolution through bridge calls and leading root cause analysis with technology partners.\nMonitoring and Support: Knowledge about building a highly automated production monitoring and support model, expert knowledge integrating Splunk, and Dynatrace.\nCommunication: Superior verbal and written communication skills with the ability to influence decision-making with stakeholders. \nNice to Have: Experience building accessible and internationalized web applications\nNice to Have: Experience working with authenticated applications utilizing OAuth (or similar)\nNice to Have: Prior experience in software engineering/SRE role within a financial services organization.\n\n\nWhat's in it for you?\n\n\nDiversity, Equity, Inclusion & Allyship - We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow & participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability & veterans.\nAccessibility and Workplace Accommodations - We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements. \nUpskilling through online courses, cross-functional development opportunities, and tuition assistance. \nCompetitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\nDynamic Ecosystem - Free tea & coffee, universal washrooms, and lots of space for team collaboration.\nCommunity Engagement - No matter where you choose to work from; we offer opportunities for community engagement & belonging with our various programs.\n\n\nLocation(s): Canada : Ontario : Toronto\n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. If you require technical assistance, please click here. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-05T20:23:57.512278-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong experience with Node.js and React.js, key technologies mentioned in the job description.",
        "Proficient in DevOps tools such as Git, CI/CD (Azure DevOps, GitHub Actions), Docker, and cloud platforms (AWS, Azure).",
        "Experience in building and deploying applications on cloud platforms like AWS Lambda and API Gateway.",
        "Demonstrated ability to improve application performance, reliability, and scalability through various optimizations and automations.",
        "Hands-on experience with monitoring tools like CloudWatch and Datadog.",
        "Familiarity with Agile/Scrum development practices.",
        "Experience with REST API design and development."
      ],
      "gaps": [
        "Lack of explicit mention of Google SRE practices or ITIL service delivery methodology.",
        "Limited details on experience with application security platforms like Checkmarx, Blackduck, or Webinspect.",
        "No explicit mention of Kubernetes/Docker or GKE, only general understanding of cloud computing technologies is specified.",
        "Limited experience with Splunk and Dynatrace integration."
      ],
      "suggestions": [
        "Highlight any familiarity with Google SRE practices or ITIL service delivery methodology, even if gained through personal projects or online courses.",
        "If applicable, expand on experience with application security platforms and tools.",
        "Quantify the impact of SRE-related tasks, such as incident resolution time or reduction in production issues.",
        "Showcase experience with building accessible and internationalized web applications, if any.",
        "Tailor the resume to emphasize experience specifically related to incident management, problem management, and root cause analysis.",
        "Consider adding a separate section for 'SRE Experience' to showcase relevant skills and projects in a more focused manner."
      ],
      "summary": "The resume presents a strong candidate with a solid foundation in full-stack development, DevOps practices, and cloud technologies, aligning well with the requirements of a Site Reliability Engineer role. The candidate demonstrates practical experience with key technologies like Node.js, React.js, Azure DevOps, and cloud deployment, showcasing their ability to improve application reliability and performance. While some areas require further clarification or emphasis, the candidate's skills and experience make them a promising fit for the position."
    },
    "job_category": "sde"
  },
  {
    "id": 9,
    "job": {
      "title": "Intermediate Full Stack Engineer",
      "company": "Clariti",
      "location": "Toronto, ON",
      "job_id": "4342432588",
      "url": "https://www.linkedin.com/jobs/view/4342432588/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=de9ZBHPutu3wPXIWDhJ6Gw%3D%3D&trackingId=3n743Cicd1R0wBFx3IdiWw%3D%3D",
      "description": "About the job\n\nJoin our mission to provide governments with exceptional experiences so they can do the same for their communities!\n\nWhat do we do?💥\n\nWe empower governments to deliver exceptional citizen experiences. \n\nCheck out our 'About Us' page for a deep dive into our product and what makes us exceptional.\n\nCivCheck is transforming how cities manage plan review and building code compliance. As part of Clariti, CivCheck brings together deep domain expertise and cutting-edge AI to streamline and modernize the permitting process. Our Guided AI Plan Review™ (GPR) platform is the first of its kind and it is helping cities and applicants alike navigate complex building codes with clarity, consistency, and speed. By combining intelligent automation with human expertise, CivCheck empowers communities to build faster, safer, and smarter.\n\nHow will you help us make an impact? 👩‍💻👨‍💻\n\nWe're looking for an Intermediate Full-Stack Engineer who can independently deliver features end-to-end while bringing strong quality and testing practices into our codebase. You'll work across the stack, shipping new functionality, refactoring existing systems, improving reliability, and writing the automation and test coverage needed to confidently support our growing platform. This role is ideal for someone who enjoys both building products and improving engineering foundations. You'll collaborate closely with a team of senior engineers and product owners and you'll play a key role in ensuring that what we ship is stable, maintainable, and well-tested.\n\nAs a Intermediate Full-Stack Engineer at Clariti, you'll get to :\n\n\nDesign, build, and maintain features across our platform (Next.js, React/Chakra UI, Node.js/Express, Firebase).\nContribute to architectural decisions, code quality improvements, and refactoring efforts.\nWork closely with product, to turn requirements into shipped, user-facing functionality.\nWrite clean, maintainable, and testable code with TypeScript.\nDevelop and maintain automated tests (unit, integration, and end-to-end) using tools like Jest, Vitest, Playwright, or Cypress.\nEnsure reliable test coverage around your own changes and help evolve our testing strategy.\nIdentify gaps in testing, reliability, or structure and proactively fix them.\nHelp modernize and refactor parts of the codebase as we scale.\nParticipate in code reviews and contribute to engineering standards.\nImprove internal tooling, documentation, and CI/CD workflows (GitHub Actions).\nWork across teams (engineering, QA, product) to embed quality throughout the development lifecycle.\nMentor junior engineers on clean code, debugging, testing patterns, and best practices.\nHelp shape technical direction and contribute to continuous improvement of our engineering culture.\n\n\nWhat do you bring to the team? 🧠\n\n\n3–5+ years of professional full-stack experience (or equivalent depth through impact + projects).\nStrong proficiency with JavaScript/TypeScript.\nExperience with modern frontend frameworks (React, Next.js, or similar).\nExperience building APIs and backend services (Node.js/Express, Firebase, or equivalent).\nStrong understanding of software testing fundamentals and experience writing automated tests.\nExperience refactoring or improving existing codebases.\nComfort owning features end-to-end, from design to implementation to testing.\nSolid understanding of Git, CI/CD, and modern development workflows.\nStrong communication skills and the ability to collaborate in a fast-moving environment.\nA mindset focused on quality, maintainability, and continuous improvement.\n\n\nBonus Points 🎉\n\n\nStrong opinions (loosely held) on best practices for testing strategy and setting up testing infrastructure\nExperience being burned before by untested or brittle systems - and you now deeply appreciate the beauty and leverage of a well-structured test suite that makes teams faster, not slower.\nKnowledge of building with Github Actions\n\n\nWhat's in it for you?🫵\n\n\nExperience with Firebase (Firestore, Auth, Cloud Functions).\nHands-on experience with Playwright, Cypress, or advanced test automation tooling.\nExposure to infrastructure or DevOps concepts (CI/CD pipelines, GitHub Actions).\nExperience improving or designing testing frameworks or quality processes.\nInterest in civic tech, government platforms, or products with real-world community impact.\n\n\nWe invest in and empower our team members with competitive compensation packages, well deserved time off and benefits to keep you and your family healthy! *\n\n💰 The base salary range for this role is expected to be between $110,000 -130,000 CAD based on the candidate's skills, experience, and qualifications while considering internal pay equity and our broader pay philosophy. 💰\n\nIf you have questions about compensation as we move through the process, we're happy to discuss further.\n\n\nBenefits depend on employment type (full-time, part-time, contract, etc).\n\n\nThings to Note 📝\n\nBackground checks - Because our customers trust us with sensitive information, we require all successful candidates to undergo comprehensive background checks before joining our team. We focus strictly on global sanctions and criminal offences that are directly relevant to employment at Clariti, and follow all applicable privacy and human rights legislation.\n\nTravel- Although we operate as a remote company, all roles are expected to participate in occasional travel for in-person company-wide or departmental meetings, typically 1-2 times per year. Additional travel requirements specific to the role, if any, will be outlined in the job description.\n\nWe're committed to building an inclusive culture where our team members take ownership over projects, tasks, and outcomes; bring a growth mindset to drive continuous learning and self-development; have the ability to communicate courageously in a direct but respectful way; and are customer-focused by keeping the customer at the heart of decision-making. It's the diversity of our team that helps us make better decisions, by leveraging the diversity in thought & experience across to create impactful solutions as we explore new paths & challenges as we grow. We're working to create a workplace and team that is as diverse as the communities we serve. We welcome and encourage candidates of all backgrounds to apply. \n\nQuestions? We are here to help \n\nIf you require accommodations in completing an application, interviewing, completing any pre-employment testing, or otherwise participating in our hiring process for any reason, please direct your questions to hr@claritisoftware.com and we'll be happy to support you.",
      "easy_apply": false,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-05T20:24:01.079047-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Strong full-stack experience with relevant technologies (Next.js, React, Node.js/Express, TypeScript).",
        "Demonstrated ability to design, build, and maintain features across the entire stack.",
        "Experience with building APIs and backend services.",
        "Solid understanding of software testing fundamentals and experience writing automated tests (Jest, React Testing Library, Playwright).",
        "Experience with CI/CD workflows (GitHub Actions, Azure DevOps).",
        "Proven ability to refactor and improve existing codebases.",
        "Experience owning features end-to-end.",
        "Strong communication skills evidenced by contributions to Agile ceremonies and code reviews.",
        "Experience integrating AI services",
        "Quantifiable results from past projects (performance improvements, increased user engagement)."
      ],
      "gaps": [
        "No specific experience with Chakra UI or Firebase mentioned.",
        "Lack of explicitly stated years of experience, although the job description mentions '3–5+ years of professional full-stack experience'.",
        "No direct examples of mentoring junior engineers",
        "Although experience improving CI/CD workflows is present, the resume does not state experience building them from scratch, if this is required."
      ],
      "suggestions": [
        "Highlight experience with Firebase, if any, even if it's a personal project.",
        "Explicitly state years of professional experience to align with the job requirement (or emphasize equivalent depth through impact + projects).",
        "Include a line related to mentoring junior engineers, or other forms of technical guidance.",
        "Mention how the candidate meets the company's values (ownership, growth mindset, courageous communication, customer focus).",
        "If available, include examples of designing and implementing CI/CD pipelines from the ground up."
      ],
      "summary": "Roger Xu's resume is a strong match for the Intermediate Full-Stack Engineer position. The resume highlights key skills and experiences that align well with the job requirements, including expertise in Next.js, React, Node.js/Express, TypeScript, and automated testing. The candidate demonstrates a proven ability to deliver features end-to-end and improve existing codebases. The resume could be further strengthened by explicitly stating years of experience and addressing the gaps regarding Chakra UI and Firebase. Overall, Roger Xu appears to be a highly qualified candidate."
    },
    "job_category": "sde"
  },
  {
    "id": 12,
    "job": {
      "title": "Agile Software Engineer - OTT / Connected TV",
      "company": "TribalScale",
      "location": "Toronto, ON",
      "job_id": "4342402729",
      "url": "https://www.linkedin.com/jobs/view/4342402729/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=DVKRe%2FyoonF4WGiDezMfmg%3D%3D&trackingId=2Vq4HDU5xp70l6eMq0Y0ig%3D%3D",
      "description": "About the job\n\nShape the Future with TribalScale\n\nAt TribalScale, we're not just participating in digital transformation—we're driving it. As global leaders in innovation, we combine Agile methodologies and cutting-edge AI, including Large Language Models (LLMs), to create digital solutions that propel enterprises into the future. Based in Toronto with a hybrid workforce across the Americas, we're on an ambitious mission to \"Right the Future.\" If you're a bold innovator ready to push the boundaries of what's possible, we invite you to join our team of digital pioneers.\n\nOur Digital Expertise\n\n\nTransformation Experts: We transform traditional business models into agile, AI-powered ecosystems.\nStrategic Visionaries: We navigate the uncharted waters of technological evolution.\nProduct Virtuosos: We orchestrate the creation of world-class digital solutions.\nCode Optimizers: We leverage AI to refine and perfect digital systems.\n\n\nOur Technological Toolkit\n\n\nMobile & Web Development: (iOS, Android, React Native, React, Node.js)\nVoice-Activated Platforms: (Amazon Alexa, Google Home)\nConnected Ecosystems: (Cars and Homes)\nStreaming Platforms: (Roku, Fire TV, Android TV, tvOS)\n\n\nThe TribalScale Professional\n\nYou thrive in challenging environments where innovation is key. Your passion for technology is matched only by your drive to redefine its limits. You seek more than a job; you seek a calling—a chance to make a lasting impact on the digital landscape.\n\nAgile Software Engineer - Connected TV / OTT\n\nAbout The Role\n\nWe're seeking a talented Connected TV engineer to join our growing team and help build the next generation of mobile applications with integrated AI capabilities. This is an exciting opportunity for an intermediate-level developer who is passionate about mobile development and emerging AI technologies.\n\nYou'll work on developing Connected TV applications on a team working with a global media company. You will work with our team in our Agile+AI practices in order to build applications on a week by week sprint. This role is perfect for someone who has experience building connected TV or OTT media players and related applications, and wants to explore building software with AI.\n\nWhat You'll Do\n\n\nOTT Development: Build high-quality, performant Connected TV applications across a variety of platforms and devices\nBackend Development: Develop and maintain Node.js backend services and APIs to support mobile applications\nFull Stack Ownership: Take end-to-end responsibility for feature development\nCode Quality: Write clean, testable code following best practices and conduct code reviews\nCollaboration: Work closely with designers, product managers, and other engineers to deliver exceptional user experiences\nPerformance Optimization: Monitor and optimize application performance across platforms\n\n\nRequired Skills & Experience\n\nEssential Requirements:\n\n\n2+ years of hands-on Connected TV application development experience \nExperience working with multipe device libraries \nStrong proficiency in JavaScript/TypeScript\nStrong proficiency in HTML and CSS, particularly related to bounding boxes and margin\nUnderstanding of RESTful API design and development\nFamiliarity with cloud platforms (AWS, Google Cloud, or Azure)\nExperience with version control (Git) and collaborative development workflows\n\n\nNice to Have Skills\n\nAI & Modern Development:\n\n\nExperience integrating AI/ML models into mobile applications\nKnowledge of Large Language Models (LLMs) and AI APIs\nExperience with AI-powered features like chatbots, recommendation systems, or intelligent automation\n\n\nAdditional Technical Skills:\n\n\nReact.js experience for web development\nPHP development experience\nDatabase design and management (SQL and NoSQL)\nCI/CD pipeline setup and maintenance\nTest-driven development (TDD) practices\nMicroservices architecture experience\nDocker and containerization\n\n\nSoft Skills:\n\n\nStrong problem-solving and analytical thinking\nExcellent communication skills and ability to work in cross-functional teams\nSelf-motivated with ability to work independently\nAdaptability and eagerness to learn new technologies\n\n\nWhat We Offer\n\nProfessional Growth:\n\n\nOpportunity to work with cutting-edge AI technologies\nProfessional development budget for courses and conferences\nMentorship and career advancement opportunities\nExposure to diverse projects and technologies\n\n\nWork Environment:\n\n\nFlexible hybrid or remote work options\nCollaborative and inclusive team culture\nModern development tools and equipment\nAgile development methodology\n\n\nCompensation & Benefits:\n\n\nCompetitive salary commensurate with experience\nComprehensive health, dental, and vision coverage\nGenerous vacation and personal time\nStock options or equity participation (if applicable)\nProfessional development allowance\n\n\nNice-to-Have Experience\n\n\nPrevious experience in startups or fast-paced environments\nOpen source contributions or personal projects showcasing your skills\nExperience with real-time applications (WebSockets, real-time databases)\nKnowledge of mobile security best practices\nExperience with automated testing and quality assurance\nFamiliarity with design systems and component libraries\n\n\nApplication Process\n\nPlease include:\n\n\nSend us your resume and answer a couple of short questions. We want to see that you do actually have Connected TV experience. And tell us a bit about you and what you're looking for! \nIf we like your resume we will send you a series to questions to answer that clarify your experience (we do this in place of an initial call with a recruiter, which allows us to review more candidates)\nCall with HR to get to know you\nTechnical interview with our Director of Engineering\nMaybe: second technical interview with a TribalScale engineer\nFollow up survey to understand your job expectations & continued interest\nOffer\nStart!\n\n\nWhy Choose TribalScale\n\nAt TribalScale, collaboration is at the heart of our innovative approach. We don't simply work for clients; we form partnerships, building transformative solutions that redefine what's possible. Our team, once at the forefront of the mobile revolution, now leads the charge in AI-driven innovation.\n\nWe empower each team member to be a catalyst for change, adhering to our principles of meritocracy, empowerment, and transparency. Diversity isn't just celebrated—it's fundamental to our strength. Our mission to \"Right the Future\" is a call to action to make a significant impact in the world of innovation.\n\nDiversity: Our Collective Strength\n\nTribalScale proudly stands as a beacon of equal opportunity in employment and workplace culture. We are steadfastly committed to equal employment opportunity, transcending the boundaries of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, able-bodiedness, or gender identity.\n\nWe not only welcome but actively encourage applications from individuals of all abilities, ages, citizenships, marital statuses, and gender identities. Your unique perspective is the key to our collective innovation.\n\nShould you require any accommodations, we implore you to inform us. Our commitment to inclusivity knows no bounds, and we stand ready to adapt our processes to ensure your comfort and success.",
      "easy_apply": true,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-05T20:25:34.371512-04:00"
    },
    "matchScore": 82,
    "analysis": {
      "matchScore": 82,
      "strengths": [
        "Strong full-stack development experience with relevant technologies like TypeScript, React, Node.js, and cloud platforms (AWS, Azure).",
        "Demonstrated experience in building and optimizing web applications, including performance improvements and UI enhancements.",
        "Experience with CI/CD pipelines and automation, leading to faster deployment times.",
        "Proven ability to integrate AI services (e.g., Azure OpenAI Service, Gemini APIs) into applications.",
        "Solid understanding of Agile/Scrum methodologies and collaborative development workflows.",
        "Experience with testing frameworks and practices (Jest, React Testing Library, Playwright) and improving test coverage.",
        "Experience with backend development using Node.js, REST APIs, and databases (PostgreSQL, MongoDB).",
        "Experience with Docker and containerization.",
        "Experience with Serverless architecture."
      ],
      "gaps": [
        "Limited explicit mention of Connected TV application development experience, which is an essential requirement.",
        "No explicit mention of experience working with multiple device libraries for Connected TV.",
        "No specific mention of experience with Roku, Fire TV, Android TV, tvOS (specific Connected TV platforms mentioned in the Technological Toolkit).",
        "Limited mention of PHP development experience (Nice to Have Skill)."
      ],
      "suggestions": [
        "Highlight any Connected TV or OTT media player experience in the resume, even if it was a small part of previous roles or projects. Quantify results achieved in these roles.",
        "Include any experience with device libraries for Connected TV, if available. Specify which ones.",
        "Showcase experience with React.js beyond project descriptions, if available, perhaps in the summary or skills section to align with the job description's Technological Toolkit.",
        "Since the job description emphasizes Agile+AI practices, highlight projects or experiences that demonstrate the intersection of these two areas.",
        "Consider tailoring the project descriptions to more closely align with the Connected TV/OTT focus if possible. Emphasize the video streaming or media-related aspects of any projects.",
        "Address the 'couple of short questions' requested in the application process thoughtfully, emphasizing Connected TV experience."
      ],
      "summary": "The resume demonstrates a strong alignment with the required skills and experience for a full-stack software engineer role. The candidate possesses relevant expertise in TypeScript, React, Node.js, cloud platforms, and AI integration. However, the lack of explicit and prominent mention of Connected TV development experience is a significant gap. Addressing this gap in the resume and the application questions is crucial to improve the match score."
    },
    "job_category": "sde"
  },
  {
    "id": 17,
    "job": {
      "title": "MEAN STACK DEVELOPER",
      "company": "Iris Software Inc.",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4325936794",
      "url": "https://www.linkedin.com/jobs/view/4325936794/?alternateChannel=search&eBP=CwEAAAGa8Q_TGzWt5u6gtGpPyHeobSEChJ2L0kajzqrPjompreUrRR74sS0FqT4iEHzBTFl8O3gjyq7Pl3XrYaNXj-i8DzqYAojyFAjxzgrUxDN1EFUz6cj_J-Cxv0Ovf-nq0rdJU8GDqcYlbGeQsPUZQL6Q0fxC2cLBMG2dLOWUyVIGZ0O9XfXdmfOksOybNdD3wKNn7WCsF1am2dYPbpr550bBN-02L4IA6c_kRaFl6LALMDK6PrtCydShl0qnlmSG2JfLN4Uqhfm-_sl6WlSg_pykASmBP_34x9GExyjoP8dmHXfuzpmz5vzmH-DPgp-kQ-I4nf6N0Vr0WKHzlLTjCcZA77PBA8VFdt2YMF7v4DyIjpNq9W5vzJMSFI2xVFFYoSjF9eQnfEAwo7P98OWZuBQRsPgBuXu3ydn27M3pKkVJtMa7tE_SYmoI72ts_qqetDVHphV6ecVy6AXd7qsMtUT8clymSZ72QhBl4QsVIxvODdq1cnS9hyxjECFN&refId=gGhVUVCwgkEGCF47HUKX0w%3D%3D&trackingId=ZHA0Z2O5uMu1KoIjJOJENA%3D%3D",
      "description": "About the job\n\nIris's Fortune 100 direct client is looking for MEAN Stack Developers. Please find below Job description and share me your updated resume at Saurav.upadhyay@irissoftware.com .\n\n\n\n\nPosition: MEAN Stack Developers\n\nLocation: Toronto ON\n\n\n\n\nKey Responsibilities:\n\nDevelop and maintain web applications using MongoDB, Express.js, Angular, and Node.js.\nBuild and integrate RESTful APIs for front-end and back-end communication.\nWrite clean, efficient, and reusable code following best practices.\nCollaborate with UI/UX teams to implement responsive and user-friendly interfaces.\nOptimize applications for speed, scalability, and performance.\nTroubleshoot, debug, and upgrade existing applications.\nEnsure application security and data protection measures.\nParticipate in code reviews and contribute to continuous improvement.\nWork in an Agile environment and meet project deadlines.\n\n\n\n\nAbout Iris Software Inc.\n\nWith 4,000+ associates and offices in India, U.S.A. and Canada, Iris Software delivers technology services and solutions that help clients complete fast, far-reaching digital transformations and achieve their business goals. A strategic partner to Fortune 500 and other top companies in financial services and many other industries, Iris provides a value-driven approach - a unique blend of highly-skilled specialists, software engineering expertise, cutting-edge technology, and flexible engagement models. High customer satisfaction has translated into long-standing relationships and preferred-partner status with many of our clients, who rely on our 30+ years of technical and domain expertise to future-proof their enterprises. Associates of Iris work on mission-critical applications supported by a workplace culture that has won numerous awards in the last few years, including Certified Great Place to Work in India; Top 25 GPW in IT & IT-BPM; Ambition Box Best Place to Work, #3 in IT/ITES; and Top Workplace NJ-USA.",
      "easy_apply": true,
      "posted_date": "9 hours ago",
      "scraped_at": "2025-12-05T20:30:03.071419-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Strong full-stack experience with relevant technologies (Node.js, React, MongoDB).",
        "Experience building and integrating RESTful APIs.",
        "Proficient in JavaScript/TypeScript.",
        "Experience with Agile methodologies and CI/CD pipelines.",
        "Demonstrated ability to improve application performance and user engagement.",
        "Experience with cloud platforms (AWS, Azure)."
      ],
      "gaps": [
        "The resume doesn't explicitly mention Angular, which is part of the MEAN stack. While React experience is valuable, familiarity with Angular is a direct requirement.",
        "The resume doesn't specifically highlight experience in optimizing applications for scalability."
      ],
      "suggestions": [
        "Explicitly mention experience with Angular, even if it's a brief personal project or learning experience.",
        "Highlight any experience with performance testing or monitoring, especially in relation to scalability.",
        "Tailor the resume summary to emphasize experience relevant to the MEAN stack and web application development.",
        "Quantify accomplishments whenever possible to demonstrate impact."
      ],
      "summary": "The resume is a strong match for the MEAN Stack Developer position. Roger has solid full-stack experience with many of the required technologies, including Node.js, React, MongoDB, and REST APIs. He demonstrates a strong understanding of web application development, Agile methodologies, and CI/CD. The main gap is the lack of explicitly mentioned Angular experience. Addressing this gap and highlighting scalability experience would significantly strengthen the application."
    },
    "job_category": "sde"
  },
  {
    "id": 18,
    "job": {
      "title": "Python Developer",
      "company": "Avanciers Inc.",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4348556194",
      "url": "https://www.linkedin.com/jobs/view/4348556194/?alternateChannel=search&eBP=CwEAAAGa8RQZP2IbuwTEFb29wBYspq7UdsIz7Q6IP-uKAsfKsRT1QRw963xdmelc86UnyJ6q42u-7TliZ3EyYl_bAOCDkKxJbTXp4lbZHJ56xABotBgsuaESWul_AkfYFkj2-MEc4xLGAaw2cZ4zTyXW-KqMCQSzMx7Mree2v5ipz6x8DUp4mpsMTsIxnsE6IRSeOWeX12r240q2emo7bfvM4RSCxXPWZUIaAMtHK_0gipU2l57LzjYAYU33A8YqAG9T7DUDtdCXqz32LvF_Eniz2AMIeIHKazEYzG7gdB1tcSWxrJJ7nwDSsdQAA4fMsbKOYG5qko-SVTrScTZN4vRPKTYumerhAp6F_Eps9Ij3qJEP6jrcMFO32-WYtOEZzxq35EyQOACZfK8Z0fERnB340TQb_WXGOqFOmKPH0zMZydOJryWW-BG7fGNmVKeO5OwSNTOvPaSiLOgiOXGv-gjoPhU5cfA3pn1cIQ1B2y5tqhUM-ILxhqBa8YCtSlAc&refId=HL8qDFObCRuMosOmJpP8FQ%3D%3D&trackingId=L6kchc6C8d8FiICP2UBMHg%3D%3D",
      "description": "About the job\n\nAvanciers is hiring Python Developer at Toronto, ON for one of our clients. This is a Full-Time Permanent role with the client. Benefits will be covered by the Client.\n\n\n\n\nPython Developer in Toronto, ON - FTE- Hybrid (3 Days in office)\n\n\n\n\nKey Responsibilities:\n\nSeeking developers with strong hands-on Python experience (not ETL-focused) and the ability to quickly pick up new programming languages; exposure to Elixir is highly preferred.\nExperience building secure, large-scale web applications using modern technologies, with familiarity in React/JavaScript, HTML/CSS, Docker, and infrastructure tools like Terraform and AWS.\nWorking knowledge of databases and distributed systems such as PostgreSQL, MongoDB, Elasticsearch, Kubernetes, and Kafka, along with solid understanding of software engineering best practices and Agile delivery.\nStrong communication skills, proactive problem-solving abilities, and a bachelor’s degree in Computer Science or equivalent experience.",
      "easy_apply": true,
      "posted_date": "9 hours ago",
      "scraped_at": "2025-12-05T20:33:53.926959-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong Python experience demonstrated through projects (FastAPI)",
        "Experience with React/JavaScript, HTML/CSS",
        "Experience with Docker and AWS",
        "Working knowledge of PostgreSQL and MongoDB",
        "Experience with Agile/Scrum methodologies",
        "Experience building web applications"
      ],
      "gaps": [
        "Lack of explicit mention of experience building 'secure, large-scale' web applications, though experience implies this.",
        "No explicit mention of Terraform, although AWS and Azure experience is present.",
        "No explicit mention of Elasticsearch, Kubernetes, or Kafka.",
        "Elixir experience is missing.",
        "No mention of Computer Science bachelor's degree, although other degrees are listed."
      ],
      "suggestions": [
        "Highlight the 'large-scale' nature of projects in the resume, emphasizing the number of users or transactions.",
        "If you have any experience with Terraform, even personal projects, include it.",
        "Even basic familiarity with Elasticsearch, Kubernetes, or Kafka should be mentioned.",
        "Address the missing CS degree explicitly, perhaps highlighting equivalent experience or relevant coursework.",
        "Tailor the resume summary to directly address the key requirements of the job description."
      ],
      "summary": "The candidate is a strong match for the Python Developer role. They possess relevant experience with Python, React, databases, cloud platforms, and Agile methodologies. Key strengths include full-stack development experience and a proven track record of delivering and optimizing projects. Gaps include lack of explicit Elixir, Terraform, Elasticsearch, Kubernetes, or Kafka experience, and a Computer Science degree. Addressing these gaps by highlighting relevant experience and tailoring the resume will increase the match score."
    },
    "job_category": "sde"
  },
  {
    "id": 19,
    "job": {
      "title": "Ingestion Engineer",
      "company": "Tata Consultancy Services",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325869481",
      "url": "https://www.linkedin.com/jobs/view/4325869481/?alternateChannel=search&eBP=CwEAAAGa8RQZP77YS5NzutQSLLmhcDrsSnyWBz__n5AWVLa8UOkolXshcSUur_YpypoL5f90YZ8CZtmJGCY1ZPjaiykoSOCNuRNt3-f2NAaoMpOWCCgM6fMT8ai1CncCC2Qdea_m5Gi_aNU4Y3p692NWWQnxwAHDdl-eV4r-B0YXUMpBeaK9DUYVMKYS0TMJz_IpdSHkuJ0HA442F_A_K0vfrqP8b4UJ8TEZpOplfBv1ZH0M08GJTrDUCNq9g6SeMiTXTIWwlfdjS0v3VPSKBQ4ZSsbphfdELMiVjXHPFaFlVrX2A-QQd8EIO2KU1CgN1FkMTvjP9hRVOhqxhbdywBGpzZDoIh1KZVH7L9L988opSqe-vSH39ijyJnfns-lAr6_aW_6nEDYSAne81WvNFiwTQtkkF9x3a150T04Gzh7GqZxZK0tanv1V65JWayoVIcxLFolKj41v9R466hvsBddYkI-a6UGMzEotBiLONQ1X61X5xFF330lTL1qTAg&refId=HL8qDFObCRuMosOmJpP8FQ%3D%3D&trackingId=yu4W9OJ8WzquDzyCjaE9Sg%3D%3D",
      "description": "About the job\n\nInclusion without Exception:\n\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people stories across our workforce and implemented through equitable workplace policies and processes.\n\n\n\n\nAbout TCS:\n\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $ 30 billion in the fiscal year ended March 31, 2025, and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\n\n\n\n\nKey Responsibilities\n\n\n\n\n\n\n\n• The Ingestion Engineer is responsible for designing, implementing, and maintaining data ingestion solutions that enable secure, efficient, and scalable data flow across platforms.\n\n• This role ensures end-to-end delivery of high-quality data from source to destination, supporting analytics, reporting, and operational needs.\n\n• Mandatory Pro B Clearance\n\n• Data Ingestion Delivery Ingest data from internal and external sources, operationalize ingested data, and ensure complete delivery from source to destination.\n\n• Platform Development Maintenance Install, configure, and integrate software components and third-party tools deliver fixes and improvements to existing products while maintaining environments and versions.\n\n• Problem Solving Analysis Analyze current products and platforms, apply data engineering patterns to troubleshoot issues, and recommend solutions.\n\n• Quality Assurance Deliver clean and efficient ingestion processes, test and deploy software products, and maintain compliance documentation.\n\n• Change Management Adhere to corporate change management standards for all deployments and upgrades.\n\n• Collaboration Customer Focus Partner with product teams and architects to define technical requirements, train team members, and resolve client issues promptly.\n\n\n\n\n\n\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodations during the recruitment and selection process, please inform Human Resources.\n\n\n\n\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
      "easy_apply": true,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-05T20:33:57.654514-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong full-stack development experience with relevant technologies (TypeScript, React, Node.js, SQL/NoSQL databases).",
        "Experience with cloud platforms (AWS, Azure) and CI/CD pipelines (GitHub Actions, Azure DevOps).",
        "Proven ability to improve application performance and reliability.",
        "Experience with data ingestion and processing using technologies like Lambda, API Gateway, and DynamoDB.",
        "Experience with Agile/Scrum methodologies.",
        "Experience with testing frameworks (Jest, React Testing Library, Playwright).",
        "Experience with DevOps practices, including containerization (Docker) and automation."
      ],
      "gaps": [
        "The resume doesn't explicitly mention experience designing and implementing data ingestion solutions, but showcases related skills.",
        "The resume does not state explicit experience with data engineering patterns used to troubleshoot issues",
        "The resume does not state explicit experience with change management standards as required"
      ],
      "suggestions": [
        "Highlight specific projects where data ingestion pipelines were designed and implemented.",
        "Quantify the impact of improvements to data flow or processing efficiency.",
        "Explicitly mention familiarity with change management standards in the experience section.",
        "Elaborate on the types of data sources used and the data formats handled.",
        "Tailor the summary to explicitly state experience in data ingestion and related aspects of the role."
      ],
      "summary": "The resume is a strong match for the Data Ingestion Engineer role. The candidate possesses a broad skillset in full-stack development, cloud platforms, and DevOps practices, with demonstrable experience in data processing and automation. The resume showcases the ability to build and optimize applications, improve performance, and work within Agile environments. While the resume doesn't explicitly state experience designing and implementing data ingestion solutions or using data engineering patterns, the candidate's skills and project experience align well with the key responsibilities outlined in the job description. Highlighting data ingestion-specific projects and emphasizing relevant skills would further strengthen the application."
    },
    "job_category": "sde"
  },
  {
    "id": 20,
    "job": {
      "title": "Cloud Engineer - Enterprise AI Services/Big Data",
      "company": "Thomson Reuters",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4342333069",
      "url": "https://www.linkedin.com/jobs/view/4342333069/?alternateChannel=search&eBP=CwEAAAGa8RivGeZTvoTkFweA3Uw1M9lempFjxf0-thqucA_gPpA6FpwSJsZCsujYipO_qmzQIc6UfDiXRH1zHbBA_ONV5iparE8ZhLmLG3vWZO4rlv_V31Z5h0_IgxXP8xsdibiIbYw2vEvmvssYfMUQ2qzEfyk0qKW1Fgtq5VBuctlpuks-d9KsesSkrCJ9Aikth_yAH_O9W7tbsyLl63viYkSVjMTNRoRdsnkPYy-WZA66qZbahvisXB0zveM6uAoncpR4JORZ3iGr8CfPFdC3OykbwyDRkb-t4rUJRSvWKS6uipuVk70eqhE_GSnxfE0qWWKuz0nio1Y0QMgky343wgK8fbdB_NEFmnFJ7efUPokD5TfD29pnP5RZ7YODYle_I2sSv-UYQ02dZ42j0iR--FYtCQtUJcK5czxcV7hgqx71SxwHFp5ZsIGvOOsFcerqMDPb_d45TMU4VC5FJejwNtEOOQ&refId=Koyp5qLOuvvAf826FGgrvg%3D%3D&trackingId=bZCSYUdI0icQvFkRhEVb2A%3D%3D",
      "description": "About the job\n\nOverview:\n\nWe are seeking a driven and talented Cloud Engineer to join our growing Enterprise AI Services team in Platform Engineering. As a Cloud Engineer, Enterprise AI Services/Big Data reporting to our Enterprise AI Services Senior Manager, you will be instrumental in designing, building, and maintaining the cloud infrastructure that powers our cutting-edge AI solutions for enterprise clients. This is an opportunity to work with leading-edge technologies in a fast-paced and collaborative environment.\n\nAbout the Role:\n\n\nLeverage your strong C# programming skills to design, develop, and implement highly scalable, resilient, and secure Enterprise AI Services. This includes building foundational components for Agentic AI, LLM orchestration, and intelligent automation.\nWork closely with Enterprise AI Services and Big Data technical teams and architects to establish and deliver Cloud/SaaS based technologies and services including Azure Open AI, AWS Bedrock, Azure API Management, Google Cloud APIGEE, Snowflake, Power BI and other emerging technologies to Thomson Reuters product teams.\nPartner with product development teams to implement best practices and optimize performance of the Enterprise AI and Cloud applications\nParticipate in the analysis of new SaaS, PaaS, and IaaS services, then develop automation and solutions to support using them at enterprise scale\nManage cloud service product/feature upgrades, including testing and release planning\nResearch new AI and Cloud technologies and assess maturity and alignment of the technology to business and technology strategy. Collaborate with vendors on previewing technologies.\nEvaluate and incorporate enterprise-grade security features as standard components of the service offerings we produce, in alignment with Thomson Reuters information security team\nPrepare and present high quality technical and non-technical documentation\nCommunicate in a professional manner when interacting across staff levels and internal customers\nEvaluate and communicate risk as a top consideration for all solutions and changes being made on behalf customers\n\n\n\nAbout You:\n\nYou’re a fit for the role of Cloud Engineer, Enterprise AI Services/Big Data, if you have\n\n\nB.S./B.A. Computer Science or related field; or equivalent level of experience\nC# Programming Language required.\nDemonstrated use of Python and/or SQL is an asset\nPrevious Software or Cloud engineering and development experience required\nSnowflake experience heavily preferred, including Stored Procedures and administrative functions.\nAWS Cloud experience (highly recommended, Cloud Practitioner and higher AWS certification preferred)\nAzure Cloud experience (highly recommended, AZ-900 or AI-900 and higher Azure certification preferred)\nGoogle Cloud experience (APIGEE preferred)\nUnderstanding of cloud infrastructure. Understanding of non-relational database and search technologies. Understanding of vector capabilities and other AI functions.\nDemonstrated use of CI/CD technologies is a plus,\nUnderstanding of tools like Azure DevOps, GitHub, GitHub Actions, JFrog Artifactory, Docker preferred.\nStrong passion for technology and a willingness to learn new skills and use new technologies like AI coding assistants like GitHub Co-Pilot or Claude Code.\nSelf-motivation and self-direction, ability to translate technical direction and apply to specific work responsibilities\nAbility to work effectively with cross-functional teams across global time zones.\nAbility to investigate complex issues spanning multiple technologies\nExcellent communication (written and verbal) and interpersonal skills\n\n\n\nWhat’s in it For You?\n\n\nHybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected.\nFlexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\nCareer Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\nIndustry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\nCulture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast / Learn Fast, and Stronger Together.\nSocial Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives. \nMaking a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\n\n\n\nAbout Us\n\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\n\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\n\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\n\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law. More information on requesting an accommodation here.\n\nLearn more on how to protect yourself from fraudulent job postings here.\n\nMore information about Thomson Reuters can be found on thomsonreuters.com",
      "easy_apply": false,
      "posted_date": "55 minutes ago",
      "scraped_at": "2025-12-05T20:38:57.206845-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong experience in cloud platforms (AWS, Azure).",
        "Proficient in CI/CD technologies (GitHub Actions, Azure DevOps).",
        "Experience with containerization (Docker).",
        "Familiar with relevant programming languages including C#, Python and SQL.",
        "Demonstrated experience in building and optimizing cloud-based applications.",
        "Experience with REST APIs and serverless architectures (Lambda, API Gateway).",
        "Experience with automated testing and raising test coverage.",
        "Agile/Scrum experience."
      ],
      "gaps": [
        "No explicit Snowflake experience mentioned, although SQL experience is noted.",
        "No explicit mention of Google Cloud APIGEE.",
        "No listed AWS or Azure certifications."
      ],
      "suggestions": [
        "Quantify achievements and contributions with specific metrics wherever possible.",
        "Highlight any experience with Snowflake or big data technologies prominently.",
        "Consider pursuing AWS or Azure certifications to strengthen cloud expertise.",
        "Tailor the resume summary to directly address the specific requirements outlined in the job description.",
        "Expand on any experience with AI coding assistants."
      ],
      "summary": "The resume is a strong match for the Cloud Engineer position. The candidate possesses a solid foundation in cloud technologies, software development, and DevOps practices. Key strengths include experience with AWS, Azure, CI/CD, and relevant programming languages. The primary gaps are the lack of explicit Snowflake experience and Google Cloud APIGEE. Addressing these gaps and tailoring the resume to highlight relevant experience will further improve the match."
    },
    "job_category": "sde"
  },
  {
    "id": 21,
    "job": {
      "title": "Cloud Platform Engineer – AWS",
      "company": "Apex Systems",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4325817683",
      "url": "https://www.linkedin.com/jobs/view/4325817683/?alternateChannel=search&eBP=CwEAAAGa8RivGkYW0OJmvHQNZod-II548Z4NZwjaPKhSVAdy_TNjru99UuDdHM-vFtf0pf8x3P7dA3RDmuFj-zTAvki5UpgePfG21b0bn1nAfYu2gQcvdF3WQCQLSXVrPsu1mtCjLEQcasDyY2pNO-53T1nZmQ1pq-xN4gNldxfQnWmw3_2Oby6Xr7p6qz4NeTxPY6dUIYiIWAbbrJt7R1XMGxKfcV5sR9MDV04oMWyhqQk8dTE3_bSOikdViqBlvJpCAWIFj-DrPTEt9Geghn62g2QNwp8Ae_bcOuC4sa4ZPXao4bW4kQJuj4gMs85TSsPCT25zcBAj7Fyt9LdmbDiCRb3DgfNjq2mvszzEiUeAJcAUJXOJiFAKORmoWSv35t3SWX0MlMGZwr_dobaq6688opl3g0u0HS0q5Q6SA4Jkmx-I130uPb47m_9TV_VSTssFSJ4jtAyi78xWWIDIj4iHa0t-T-WQCaMGz8nAPYNp0xEfMetAOnQUkXl1xmBb9WY&refId=Koyp5qLOuvvAf826FGgrvg%3D%3D&trackingId=M7TIF2P7MF9sDgNNGQ2qkw%3D%3D",
      "description": "About the job\n\nCloud Platform Engineer – AWS\n\nApex Systems is a global IT services provider, and our staffing practice has an opening for a Cloud Platform Engineer with extensive programming abilities with Python, Typescript or NodeJS, an in-depth cloud background with AWS, and DevOps experience to place at our client, a Big Five Bank.\n\nClient: Big Five Bank\n\nTerms: Contract through October 2026.\n\nLocation: Hybrid twice a month is preferred with an office in Downtown Toronto. however open to remote for the right candidate with EST working hours.\n\nProject:\n\nThe Bank is seeking a Cloud Platform Engineer to support the Bank’s cloud strategy, which is focused on innovation and leveraging rapidly emerging cloud native services to meet the rapidly evolving needs of their customers.\nThe Cloud DevOps Automation Team is focused on the implementation, deployment, and maintenance of the core Cloud Platforms across the Bank.\nThe Cloud Platform Engineer will help evolve the core cloud platform, by leveraging emerging best practices and tools, securely connecting to our strategic cloud suppliers, providing a platform for innovation for the entire Bank.\n\nJob Description:Design, implement and integrate the bank’s Cloud Platform, core, and shared services.\n\nDesign, implement and manage hybrid cloud connectivity and intra-cloud networking.\nDevelop patterns for automated provisioning, management, scalability, and security.\nEnsure that all cloud solutions follow internally defined security and compliance standards and controls.\nBe the major contributor to IaC modules: develop new modules, maintain existing modules.\nDesign and plan enterprise-scale cloud environments including application dependencies, data storage and flow, network connectivity and overall cloud hosting.\nDevelop and maintain up-to-date architectural templates, build an operational documentation of the technical environment.\nContinuously enhance the capability, security, and experience of the enterprise Hybrid cloud.\n\nTechnical Requirements:\n\nExtensive experience in the following tools and technologies:\nTypescript\nNodeJS\nPython\nAWS CDK\nTerraform\nCloud Formation\nCICD\nOpen Policy Agent/Policy as Code\nContainer – EKS – Kubernetes – ECS – Docker\nAzure DevOps pipeline design and architecture\nGithub Actions\nCircleCI\nJenkins\nAgile Framework\nLinux\nExtensive cloud platform experience and skills:\nCertifications in AWS and/or Azure.\nDynomoDB\nECS\nLambda – Serverless\nStep Functions\nCognito\nAPI Gateway\nIAM\nAzure DevOps\nWebApp\nAKS\nACI\nKey Vault\nSQL MI\n\nInterview Process: Interviews will take place in two rounds with a technical screening component.\n\nThis is a great opportunity to join a Big Five Bank and continue your career in the financial domain. Be a part of a great work environment with a very well-organized team and colleagues who will help you succeed.",
      "easy_apply": true,
      "posted_date": "8 hours ago",
      "scraped_at": "2025-12-05T20:39:20.645390-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Strong proficiency in TypeScript, NodeJS, and Python, matching the job's core requirements.",
        "Extensive AWS cloud experience with Lambda, API Gateway, DynamoDB, showcasing relevant skills.",
        "Proven experience with CI/CD pipelines using GitHub Actions and Azure DevOps, aligning with DevOps needs.",
        "Experience with containerization (Docker) and Agile/Scrum methodologies.",
        "Experience with infrastructure-as-code (IaC) such as Terraform and CloudFormation through Azure DevOps pipeline design and architecture.",
        "Knowledge of security practices and experience integrating security tools into CI/CD pipelines.",
        "Experience integrating AI services via cloud APIs and languages."
      ],
      "gaps": [
        "Lack of explicitly stated experience with AWS CDK, Open Policy Agent/Policy as Code, EKS, Kubernetes, ECS, CircleCI, Jenkins, Step Functions, Cognito, IAM, AKS, ACI, Key Vault, and SQL MI, which are mentioned in the job description. Although, experience using other comparable tools may translate.",
        "Resume does not explicitly demonstrate experience designing, implementing, and managing hybrid cloud connectivity, intra-cloud networking and patterns for automated provisioning, management, scalability, and security.",
        "Although the resume mentions adherence to security and compliance standards, the resume needs to clearly state experience in compliance and auditing of deployed IaC to ensure standards are met."
      ],
      "suggestions": [
        "Quantify the impact of cloud automation efforts with metrics beyond time saved, like cost reduction or improved resource utilization.",
        "Explicitly mention experience with specific AWS services listed in the job description, such as ECS, Step Functions, Cognito, and IAM, even if the experience is tangential.",
        "Highlight experience with security and compliance aspects of cloud deployments, referencing specific standards or frameworks.",
        "Elaborate on experience in designing and implementing automated provisioning, management, scalability, and security patterns in cloud environments.",
        "Quantify the impact of automation of compliance and auditing of IaC modules.",
        "Include certifications in AWS and/or Azure to demonstrate cloud expertise.",
        "In the summary, add a sentence about experience with enterprise-scale cloud environments."
      ],
      "summary": "The resume presents a strong candidate for the Cloud Platform Engineer role, demonstrating solid skills in TypeScript, NodeJS, Python, and AWS cloud services. The candidate has hands-on experience in full-stack development, DevOps practices, and cloud infrastructure. The resume highlights several relevant projects showcasing cloud experience and problem-solving capabilities. To further strengthen the application, the candidate should emphasize experience with specific AWS services mentioned in the job description, detail hybrid cloud connectivity experience, and showcase expertise in cloud security and compliance and IaC."
    },
    "job_category": "sde"
  },
  {
    "id": 22,
    "job": {
      "title": "Quality Automation Engineer (with AI Awareness)",
      "company": "Tata Consultancy Services",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325779413",
      "url": "https://www.linkedin.com/jobs/view/4325779413/?alternateChannel=search&eBP=CwEAAAGa8RoPQatvS1KmlSLJmsblijYQsnAWUJ3hjHqSakN1ajAs6VdevM8AsTRN7DGmiTUkUma5lK9RuqEuRFCDupuTZfsGlHR21idcA9sQ6f4iooX2Va1r3LQboHcNT61QbclUJcQyaQTZb45NC80GAd1iV3uzfBcplcc7j-DF5E8NHP82C95VQFivStcf9SZvd8T9smyvVET4tKkc2tYz192W9pqQtMQB8_Ebq_NKPhTKL-Uss1M6-J9y_wXGM6KoY9AbxOHxLlpIcu98pGRBcIDYl6YYzWNMmQMv1a9-6tjVCNDMs-H2xfTq86oWKLHNin7DbD7xH5BEndH4qX0OtW4Pta95kiZLTaOSVLdCpBJD02l_AGHkcet4IEp20Rj-GgI4eQFZowqPUO4aZeffH1wiQjrBLbbc5w7zYDkieb6sEP4aRFhqO4270AUv9UfyX2dfI-JiNFjurxA6THpvek0FolBd4aAVfrNhw5-A6Dq5hH9ecl7PGhYL3CKnDgE&refId=8Wf7tZeDVKYlIDNeuO9WfQ%3D%3D&trackingId=v3%2Fcuic9hJjGnrpCWQj3xQ%3D%3D",
      "description": "About the job\n\nInclusion without Exception:\n\n\n\n\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people stories across our workforce and implemented through equitable workplace policies and processes.\n\n\n\n\nAbout TCS:\n\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $ 30 billion in the fiscal year ended March 31, 2025 [BS1] and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\n\n\n\n\nSkills and Responsibilities:\n\n \n\n •The Quality Automation Engineer is responsible for designing, developing, and executing automated test scripts to ensure the quality and reliability of software applications.\n\n •In addition to strong QA automation skills, this role requires conceptual knowledge of AI technologies to effectively test AI-driven features and collaborate with AI teams.\n\n \n\n •The Quality Automation Engineer is responsible for designing, developing, and executing automated test scripts to ensure the quality and reliability of software applications.\n\n •In addition to strong QA automation skills, this role requires conceptual knowledge of AI technologies to effectively test AI-driven features and collaborate with AI teams.\n\n •Design and implement automated test scripts using frameworks like Selenium, Cypress, or Playwright. Maintain and optimize automation frameworks for scalability and performance.\n\n •Execute automated and manual tests to validate application functionality.\n\n •Ensure regression coverage for new features and releases.\n\n •Understand how AI-driven features (recommendations, chatbots, personalization) impact testing strategies.\n\n •Validate AI outputs for consistency, usability, and compliance with business rules.\n\n •Conduct load and stress testing using tools like JMeter or Locust.\n\n •Ensure application security through automated vulnerability checks.\n\n •Work closely with developers, AI engineers, and product teams to clarify requirements.\n\n •Participate in Agile ceremonies and contribute to continuous integration and delivery (CICD).\n\n •Required Technical Skills Strong proficiency in test automation tools (Selenium, Cypress, Playwright).\n\n •Experience with programming languages (Java, Python, or JavaScript).\n\n •Familiarity with CICD pipelines and tools like Jenkins and GitHub Actions.\n\n •Knowledge of API testing (Postman, REST Assured).\n\n •Basic understanding of AI concepts (LLMs, recommendation systems, model outputs).\n\n •AI Knowledge (Conceptual)Awareness of how AI-generated content affects test cases and validation.\n\n •Understanding of bias, accuracy, and ethical considerations in AI outputs.\n\n •Soft Skills Strong analytical and problem-solving abilities.\n\n •Excellent communication and documentation skills.\n\n •Ability to work in cross-functional teams and adapt to emerging technologies.\n\n\n\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodations during the recruitment and selection process, please inform Human Resources.\n\n\n\n\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
      "easy_apply": true,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-05T20:40:28.753967-04:00"
    },
    "matchScore": 85,
    "analysis": {
      "matchScore": 85,
      "strengths": [
        "Strong proficiency in test automation tools like Jest, React Testing Library, and Playwright.",
        "Experience with programming languages JavaScript and Python.",
        "Familiarity with CI/CD pipelines and tools like GitHub Actions and Azure DevOps.",
        "Knowledge of API testing (REST APIs).",
        "Experience integrating AI services (OpenAI, Google Cloud APIs, Gemini APIs).",
        "Experience with Agile methodologies.",
        "Experience with Cloud Platforms AWS and Azure",
        "Experience with testing Frameworks like Jest, React Testing Library",
        "Experience with full stack development"
      ],
      "gaps": [
        "No explicit mention of Selenium or Cypress.",
        "No explicit mention of Jenkins.",
        "No explicit mention of JMeter or Locust for load/stress testing.",
        "Limited evidence of understanding bias, accuracy, and ethical considerations in AI outputs.",
        "No explicit mention of Java"
      ],
      "suggestions": [
        "Highlight experience with Selenium or Cypress if applicable, even in personal projects.",
        "Mention familiarity with Jenkins if any.",
        "Showcase any experience with load/stress testing tools.",
        "Include a brief statement regarding awareness of ethical considerations in AI testing.",
        "Quantify testing results with metrics where possible.",
        "Explicitly state how you validate AI outputs for consistency, usability, and compliance with business rules."
      ],
      "summary": "The resume is a strong match for the Quality Automation Engineer position. The candidate demonstrates proficiency in several key areas, including test automation tools (Playwright, Jest, React Testing Library), programming languages (JavaScript, Python), CI/CD pipelines (GitHub Actions, Azure DevOps), and API testing (REST APIs). The candidate also has experience integrating AI services, which is a significant advantage. The main gaps are the absence of explicit mention of Selenium, Cypress, JMeter/Locust, Jenkins, and a deeper discussion of ethical considerations in AI outputs. Addressing these gaps would further strengthen the application."
    },
    "job_category": "sde"
  },
  {
    "id": 23,
    "job": {
      "title": "Product Technical Support - Tier 2",
      "company": "Assent",
      "location": "Ottawa, ON (Remote)",
      "job_id": "4325839439",
      "url": "https://www.linkedin.com/jobs/view/4325839439/?alternateChannel=search&eBP=CwEAAAGa8RujPAzKpzutQ_hxbC1dG8zWbOVeoJRyVgNeafsV8DHp83Bg-cAFPOi93RbjFxrseNQdnZccTYLGgyV7OBQ4ZUU_YP14jrlrqQ1OTFrc4f5yMVPD_8oXU6DbKmd8W5aTbMVqeOMK8Crfu-eN0PsFBSy97T5rbZutkauXCSWjlPxu93ayFjavi5ZrFCTieNkboLPg38dVAY5VTTp34pbA7lUiLqnBofgogoMBM99uE3Lh_ZJpRqSii1cASKpmTzKQnRvPkxkrsbzz0UlAaKra2N8EwYBxYXhToOp4_LKVMVtpcM1G4VU0ffWA-JBdauVrm_mL9IRYg0ngQzb7k0Zr9hh9MUm0jjMWtGJniO2XZ1lqIgszPezjmGsxnO1-S5jAAl56_sx9pPzB2Cb6gMqfbwee_VXih5NA3xYaKYxIvPwL64jC8KHIhwKTVbikfyAJ_RhJOhAUQ3V_5PlTtuEeUyRrNmRSilxctxrnxrQNiS00XS4fqAKwwk0r&refId=kplczyqU17coIEKehbLtuw%3D%3D&trackingId=h4g%2Fo%2Ftr9Bix8c7FBcJiRQ%3D%3D",
      "description": "About the job\n\nCompany Description\n\nAssent is the leading solution for supply chain sustainability tailored for the world’s top-tier, sustainability-driven manufacturers. Hidden risks riddle supply chains, many of which weren't built with sustainability in mind. That's where we step in. With insights from experts, Assent is the tool manufacturers trust for comprehensive sustainability.\n\nWe are proud to announce that Assent has crossed the US$100M ARR milestone, granting us Centaur Status. This accomplishment, reached just 8 years following our Series A, makes us the first and only Certified B Corporation in North America's SaaS sustainability industry to celebrate this milestone.\n\nOur journey from $5 million to US$100M ARR in just eight years has been marked by significant growth and achievements. With our $350 million US funding led by Vista Equity Partners, we're poised for even greater expansion and are on the lookout for outstanding team members to join our mission.\n\nHybrid Work Model\n\nAt Assent, we proudly embrace a remote-first work model, valuing the flexibility and autonomy it provides our team. We also acknowledge the intangible benefits of occasional in-person workdays. For team members situated within 50 kms/31 miles of our five global offices in Ottawa, Eldoret, Penang, Columbus, Pune and Amsterdam, you can expect to come into the office 1-3 days a week. Similarly, those near our co-working spaces in Nairobi and Toronto are encouraged to work onsite once a month.\n\nJob Description\n\nReporting to the Manager, Product Technical Specialist, the Product Technical Support Tier 2 is responsible for providing advanced technical support to customers and internal users. This role involves troubleshooting complex technical issues, offering solutions, and ensuring customer satisfaction. The ideal candidate will have strong technical expertise, excellent problem-solving skills, coaching skills and the ability to work independently and as part of a team.\n\n\nAdvanced Troubleshooting: Responsible for the advanced troubleshooting of technical issues or user reported problems\nIn-Depth Issue Understanding: Work with the end-users (such as our clients, suppliers, and internal super users) or Tier 1 colleagues to understand product issues more in-depth\nProactive Communication: Communicate proactively to internal end-users regarding expected or identified issues\nQueue Management: Effectively manage Product Support Tier 2 queue by updating cases and tracking interactions in the ticketing system for timely responses and accurate records.\nIssue Reproduction and Definition: Find path to reproducing and clearly defining identified product issues raised by our clients and suppliers\nLogging Tools Utilization: Advanced utilization of logging tools to identify and provide necessary logs for investigation\nIssue Summarization: Summarize ongoing product issues for management and Assent leadership\nIssue Extrapolation: Identify patterns from reported problems to predict potential widespread issues.\nJIRA Ticket Management: Responsible for creation and updating of Jira tickets related to reported bugs\nIssue Escalation Cases: Handle escalated customer issues and providing updates on a timely manner.\nKnowledge Base Documentation: Assist in developing and updating technical support documentation and knowledge base articles.\nInterdepartmental Collaboration: Collaborate with other departments to resolve customer issues and improve product functionality.\nExpert Application Use: Become an expert user of Assent Applications\nMentoring and Coaching: Ability to mentor and coach Tier 1 agents by providing guidance on issues\nContinuous Learning: Stay up-to-date with product updates, technologies, and best practices to provide high-quality support.\n\n\n\nQualifications\n\nWe strongly value your talent, energy, and passion. It will also be valuable to Assent if you have the following qualifications.\n\n\nGreat verbal and written communication skills, primarily in English, able to summarize information clearly and concisely\nBachelor's Degree/Higher Diploma from a recognized learning institution or relevant experience\n3+ years of experience in a technical support role, with at least 1 year in a Tier 1 or higher position.\nTechnical Expertise: Strong technical background with proficiency in troubleshooting and resolving complex technical issues.\nProficiency in using advanced troubleshooting tools e.g SQL, API.\nProblem-solver who is a fast learner, self-motivated, and willing to go the extra mile\nProficiency in using ticketing systems (e.g. Salesforce, JIRA) and remote support tools.\nSkilled in documenting solutions and creating knowledge base articles to aid both clients and internal teams.\nStrong customer service orientation and the ability to handle difficult situations with professionalism.\nYou excel at managing multiple tasks and priorities independently, thriving in fast-paced and dynamic environments with high adaptability and flexibility.\nYou have a natural curiosity about technology and AI, constantly seeking to understand how they work and exploring their potential.\nYou are a critical thinker and can suggest, implement, and support efficient and effective workarounds\nYou are a diligent, detail-oriented, and conscientious individual who consistently works towards providing solutions, achieving excellence, and driving results.\nYou consider yourself a lifelong learner, you have an insatiable thirst for knowledge, and are always striving to self-improve\nYou are proficient in the use of MS Office Suite, Google Applications, and other Office productivity tools.\n\n\n\nAdditional Information\n\nLife at Assent\n\nWellness: We believe that you and your family’s well being is important. As a result, we offer vacation time that increases with tenure, comprehensive benefits packages (details vary by country), life leave days and more.\n\nFinancial Benefits: It’s not all about the money – well, it’s a little about the money. We understand that financial health is important and we offer a competitive base salary, a corporate bonus program, retirement savings options and more.\n\nLife at Assent: There is purpose beyond your work. We provide our team members with flexible work options, volunteer days and opportunities to get involved in corporate giving initiatives.\n\nLifelong Learning: At Assent, curiosity is not only valued but encouraged. You will receive professional development days that are available to you the day you start.\n\nAt Assent, we are committed to growing and sustaining an environment where our team members feel included, valued, and heard. Our diversity and equal opportunity practices are guided and championed by our Diversity and Inclusion Working Group and our Employee Resource Groups (ERGs).\n\nOur commitment to diversity, equity and inclusion includes recruiting and retaining team members from diverse backgrounds and experiences, and fostering a culture of belonging where all team members are included, treated with dignity and respect, promoted on their merits, and placed in positions to contribute to business success.\n\nIf you require assistance or accommodation throughout any part of the interview and selection process, please contact talent@assent.com and we will be happy to help.",
      "easy_apply": false,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-05T20:42:09.541795-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Strong application support experience with incident triage, log analysis, SQL investigation, and root-cause analysis.",
        "Proficient in relevant technologies like SQL, JavaScript/TypeScript, Python, Node.js, REST APIs, AWS (Lambda, CloudWatch), Azure DevOps, and ticketing systems (ServiceNow, Jira).",
        "Experience with monitoring tools like Datadog and Application Insights.",
        "Experience in troubleshooting and debugging APIs (JSON payloads, HTTP errors).",
        "Experience with customer service from TD Canada Trust.",
        "Experience writing knowledge base articles.",
        "Experience with interdepartmental collaboration.",
        "Experience with issue escalation.",
        "Experience managing a queue.",
        "Experience reproducing issues."
      ],
      "gaps": [
        "The job description asks for 3+ years of experience in technical support with at least 1 year in Tier 1 or higher. The resume does not specify tier support level and the co-op may not fully count.",
        "No explicit mention of experience with Salesforce which is listed as an example ticketing system.",
        "No explicit mention of MS Office Suite or Google Applications proficiency, though this is likely implied."
      ],
      "suggestions": [
        "Quantify achievements wherever possible (e.g., \"Reduced incident resolution time by X% by automating...\").",
        "Explicitly state Tier experience if applicable. Adjust the experience section to emphasize the years in technical support to directly reflect the job requirement.",
        "Add a bullet point about MS Office Suite or Google Applications proficiency if it is the case.",
        "Tailor the summary to highlight experience with specific problem-solving and proactive communication to match the Job Description.",
        "Add a brief line or two about mentoring and coaching others if this has been done informally, to address this requirement in the job description."
      ],
      "summary": "The resume is a strong match for the Product Technical Support Tier 2 role. The candidate possesses relevant technical skills and experience in application support, troubleshooting, and collaboration. The resume highlights relevant technical skills, issue escalation, and interdepartmental collaboration that aligns with the job description. Some gaps exist regarding the years of experience in a tier support role and experience with MS Office/Google Suite, and Salesforce. Addressing these gaps and tailoring the resume further would significantly increase the chances of a successful application."
    },
    "job_category": "support"
  },
  {
    "id": 24,
    "job": {
      "title": "IT Specialist",
      "company": "AMOREPACIFIC",
      "location": "Greater Toronto Area, Canada (Hybrid)",
      "job_id": "4325868958",
      "url": "https://www.linkedin.com/jobs/view/4325868958/?alternateChannel=search&eBP=CwEAAAGa8RujPFGVAFWpdJNbiN_DCv8XtEeWLVjbd4aBA6jp5Z9iAJiqpDOVwue4M7hZljuiuqwlQtNVzIv80Q8YXf6jsVnSYkri9IkstMf2zm51vBJA19Y7qpn7j2E2_LPgepr7MV4ELjWUX_FU2vCvBFg_HWUAv5r_jX83vtDlyej6VZ_BYUQ5C1x_qNhkoTUmCG8fxpwBO9yO5KAbBjqI73_kuEvJEYX5YfBkC8DCmO8ise5E47kqGECT7uCxUdRNHvI7RKF9dMX__bySizkGfkpaClUTJvJCvoSj9Sq2PPDAbPQ3ZZC9O2M6YsLU3PBkR4L-Eud9ymzXI2tYcXi7W_4hLjJTppEvjbJRacukklE5CFPsg_9hsgQBzcrJJoMAleraXviCkHXYEKDBwI2WJljhcLDZH-Ob2iSp-W_Qcc8LdiDMe4QcmNo1RNfHVk1ZJBnUAV-N52uIbJLcFippXtkXLEStQFhUHKxtmjlGBbxAacljph6wdgZ5BiaSdvf5SA&refId=kplczyqU17coIEKehbLtuw%3D%3D&trackingId=oR%2Buv2pfWqU7DJdkcRNj3g%3D%3D",
      "description": "About the job\n\nAMOREPACIFIC Holdings is a pioneering Korean beauty company with a rich history dating back to 1945. Headquartered in Seoul, we proudly operate over 30 brands across beauty, personal care, and healthcare. Guided by our mission — \"We make A MORE beautiful world\" — we’ve taken each step with purpose, believing that our work contributes to a brighter, more beautiful future.\n\nOur dream is rooted in the belief that the world becomes more beautiful when every individual's unique beauty shines. This belief fuels our journey and inspires everything we do.\n\n\n\n\nTo bring this vision to life, we are committed to five core principles:\n\n\n\n\nCustomer First\nBe the 1st and the Best\nCollaborate with an Open Mind\nRespect Differences\nAct with Integrity\n\n\n\n\nAt AMOREPACIFIC, every member of our team carries a deep sense of pride and responsibility, knowing that together, we are shaping a more beautiful world.\n\n\n\n\nJob Summary\n\nThe IT Support Specialist is responsible for delivering day-to-day technical support to all Amorepacific Canada employees and ensuring the smooth operation of our IT environment. This role manages the IT Helpdesk, troubleshoots and maintains systems including POS, e-commerce platforms (e.g., Amazon), SAP, EDI, network infrastructure, and security tools. The position is also accountable for IT asset management, hardware/software configuration, and onboarding/offboarding system access.\n\nThe IT Specialist will work closely with cross-functional teams to resolve issues, support system enhancements, and ensure reliable technology performance across the organization. This role reports to the Sr. Manager, Business Strategy & IT.\n\n\n\n\nPrincipal Accountabilities - Responsibilities include but are not limited to:\n\n\n\n\nIT Helpdesk Support\n\nProvide daily technical support to APCA employees across hardware, software, and system-related issues.\nRespond to IT requests and inquiries promptly, ensuring high service quality.\nMonitor IT systems and applications to ensure operational stability and escalate issues when necessary.\n\n\n\n\nSystem & Platform Support (POS, E-commerce, SAP, EDI, Networking, Security)\n\nSupport POS and e-commerce platforms, including coordination, troubleshooting, and backend maintenance.\nPrepare and configure IT equipment for new store openings and new employees.\nManage and maintain accurate IT asset inventories, ensuring data is up to date for reporting to HQ.\nSupport operational management of SAP, EDI, network infrastructure, and security systems.\n\n\n\n\nIT Asset Management\n\nLog, track, and update all IT hardware and software assets in the master inventory.\nEnsure proper assignment, retrieval, and documentation of company equipment during onboarding and offboarding.\n\n\n\n\nCollaboration & Project Support\n\nAssist the Assistant IT Manager with day-to-day requests and departmental initiatives.\nSupport planning and implementation of complex systems or IT projects led by the Business Strategy & IT team.\nLiaise with HQ teams to support major IT initiatives and prepare reports required by global offices.\n\n\n\n\nTraining & Reporting\n\nTrain new hires on internal systems, tools, and IT processes.\nProvide daily and weekly updates on IT activities, issues, and ongoing projects.\nEnsure timely provisioning of IT equipment and access for new hires and retrieval for terminated employees.\n\n\n\n\nKey Experience and Skills\n\n\n\n\nDegree or Diploma in Information Technology, Computer Science, Engineering, Business Management, or a related technical field.\nMinimum 2 years of IT experience, supporting both operational tasks and project-based initiatives.\nStrong project management capabilities, coordinating deliverables and timelines across multiple stakeholders.\nHands-on experience with hardware, software, and network administration.\nWorking knowledge of SAP and Shopify (front-end and/or back-end).\nAdvanced proficiency in AI tools is a strong advantage.\nAbility to work independently, manage multiple priorities, and meet tight deadlines in a fast-paced environment.\nStrong analytical and problem-solving skills with a solution-focused mindset.\nExcellent written and verbal communication skills.\nStrong interpersonal skills with the ability to collaborate effectively across teams and support users at all levels.\nHigh attention to detail and strong organizational skills.\nDemonstrates initiative, ownership, and a proactive, hands-on approach when needed.\nReliable, self-motivated, and trusted to handle sensitive information appropriately.\nResults-oriented, resourceful, and resilient.\nWilling to work beyond standard hours when required.\nA collaborative team player who listens well and contributes positively to team culture.\nBilingual in Korean and English is an asset but not required.\n\n\n\n\nWe are committed to integration and equal opportunity. Accommodation is available to all applicants upon request throughout our recruitment process. Should you require accommodation during the interview process, please advise the recruiter when contacted.",
      "easy_apply": true,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-05T20:42:13.349881-04:00"
    },
    "matchScore": 70,
    "analysis": {
      "matchScore": 70,
      "strengths": [
        "Experience in application support and incident management aligns with IT Helpdesk Support responsibilities.",
        "Experience with troubleshooting and resolving technical issues related to hardware, software, and systems.",
        "Familiarity with ticketing systems and documentation aligns with IT asset management and reporting requirements.",
        "Skills in scripting languages (Python, PowerShell) can be valuable for automation and system maintenance.",
        "Experience in cross-functional communication and collaboration with BA/Dev/Ops teams is relevant to collaboration requirements."
      ],
      "gaps": [
        "Lack of explicit experience with POS systems is a gap.",
        "No specific mention of Shopify experience, which is desired.",
        "No mention of SAP experience, which is desired.",
        "No explicit experience with EDI or networking systems as required in System & Platform Support.",
        "Lack of experience with AI tools, which is a strong advantage",
        "No evidence of project management capabilities or project-based initiatives experience",
        "No experience in training new hires on internal systems"
      ],
      "suggestions": [
        "Highlight transferable skills related to troubleshooting and system maintenance to address the POS, SAP, and Shopify experience gaps.",
        "Quantify accomplishments in previous roles to demonstrate impact and project management skills.",
        "Mention any personal projects or learning experiences that demonstrate familiarity with e-commerce platforms or AI tools to address the respective gaps.",
        "Explicitly state willingness to work beyond standard hours if the candidate is comfortable with it.",
        "Add a cover letter to address the gaps and to express enthusiasm to learn new systems",
        "Emphasize relevant skills like troubleshooting and stakeholder management to align with IT Support Specialist responsibilities"
      ],
      "summary": "The resume demonstrates relevant experience in application support, troubleshooting, and system maintenance. However, there are gaps in experience with specific systems like POS, Shopify, and SAP, as well as with AI tools, project management experience and training delivery. Addressing these gaps with targeted examples and highlighting transferable skills will improve the match."
    },
    "job_category": "support"
  },
  {
    "id": 25,
    "job": {
      "title": "IT Analyst",
      "company": "Euna Solutions",
      "location": "Oakville, ON (Hybrid)",
      "job_id": "4342441186",
      "url": "https://www.linkedin.com/jobs/view/4342441186/?alternateChannel=search&eBP=CwEAAAGa8RujPCPYW_3_-2pKBXONHzgbHocsnj9BnXVrDsIXLDzc1LIDDigXLtxq4wZ-TI4xz68O2o84YNqT-qYqWymCRKveg_-bBHiO5jBmOzKruaZOThQFZzw-pG_AIEbDJdgjlWfOmGq0hk15CPymKJwMMrwTJLyjNLKlYZ9fkKLnkwS4bNOXFtbudEjs3MOHgE7np_T5C8OyhjE0TeXlC2AMItsPtpExDWcSiGDxEEwj6nITzTSGaCbvvL-0rWByNKwGsfJEG5H_P1tyrpyMTpmKdCJ1tMtoATzWOOYMoWHveY52qVBG6hnhrjN_lwj4SIz6Iga9RANd_PTc2Mp3F1j-tINgeNqHji03M8LWhu2N1KsGYzPpc02cbs4bfsTMn0eRzMq16r38EbSiFduSzm_cgAWpPDcRsnMs-hM6jCXX4gFTvfxbCeB8dXJlxYdYOdyx2SLa-_gx9JYiozRGzYVPWe4_&refId=kplczyqU17coIEKehbLtuw%3D%3D&trackingId=Qa2O3PgK4x5mgnPglFW3mA%3D%3D",
      "description": "About the job\n\nThe Opportunity\n\nThe IT Analyst at Euna Solutions is responsible for supporting and maintaining IT solutions and assets. This role requires a deep understanding of IT best practices, adaptability, and a passion for integrating business and IT systems. The IT Analyst will excel in supporting users and managing IT assets across the organization.\n\nKey Responsibilities\n\n\n Provide first-level contact and support for end users, ensuring effective recording and handling of incidents.\n Manage and fulfill routine service requests, such as password resets, software installations, and access permissions, in a timely and efficient manner.\n Aim for one-touch resolution of incidents whenever possible, leveraging knowledge base and troubleshooting skills.\n Identify and diagnose recurring problems; contribute to developing solutions.\n Escalate unresolved incidents and problems to higher-level support teams as per escalation procedures.\n Accurately document incident resolutions and contribute to the IT knowledge base for future reference.\n Maintain detailed records of user interactions, steps taken, and solutions provided.\n Regularly review and update IT processes and procedures to align with departmental objectives.\n Adhere to the organization's designated security framework in all IT operations.\n Communicate effectively with end users, team members, and other stakeholders.\n Collaborate with cross-functional teams to ensure integrated and cohesive IT support.\n\n\nRequired Skills & Experience: \n\n\n 0-2 years in IT system administration and user support.\n Knowledge of Windows and Mac operating systems.\n Excellent written and oral communication skills.\n Strong team-building and interpersonal skills.\n Ability to work independently and as a team.\n Strong technical and troubleshooting skills.\n\n\nPreferred Skills & Experience: \n\n\n Experience working within the Microsoft 365 ecosystem.\n Knowledge of networking technologies and cloud-first environments.\n Experience with Jira Service Desk.\n Knowledge of industry best practices and experience with both hardware and software systems.\n Knowledge of security frameworks and certifications.\n Microsoft 365 Fundamentals certification (MS-900)\n\n\nLocation:\n\nThis position will be hybrid 3x a week in our Oakville office.\n\nAI Mindset at Euna Solutions\n\nWe believe the future of work is human + AI. At Euna Solutions, we encourage our team members to leverage AI tools to enhance creativity, efficiency, and decision-making. We’re looking for people who are curious about emerging technologies, eager to experiment, and committed to using AI responsibly to augment—not replace—their expertise.\n\nIf you enjoy exploring new ways to solve problems, learning continuously, and applying AI to make your work smarter and more impactful, you’ll thrive here.\n\nWhat It's Like to Work at Euna Solutions \n\nAt Euna Solutions, we carefully foster a work environment where employees have a safe space for creative and intellectual freedom, and the opportunity to work cross-functionally. We offer a dynamic environment with considerable opportunity for professional growth and advancement. \n\nHere are some of the perks that Euna employees enjoy: \n\n💵 Competitive wages \n\nWe pay competitive wages and salaries, and we only expect an honest 40-hour week for it. \n\n🧘‍♀️ Wellness days \n\nWhat’s better than a long weekend?  An extra-long weekend! This summer let's begin and end the summer with an extra day on top of the long weekend (July and Sept)! An extra day to decompress and spend time doing the things you love. \n\n🙌 Community Engagement Committee \n\nAt Euna, we know how important it is to give back. Our community engagement committee looks for ways to give back to our local communities through time, gifts and skills. \n\n🕰 Flexible workday\n\nWe understand that what a workday looks like differs by employee and the role requirements. Through our interview process we’ll work with you to ensure it’s a fit for you and the specific role you’re interested in. \n\n💰 Benefits \n\nAsk us for a copy of our health and dental benefits! \n\n🎉 Culture committee \n\nCelebrate at every occasion with the culture team! They make sure that our team’s culture is bustling with frequent fun events for holidays and special occasions, as well as for miscellaneous fun. \n\nAbout Euna Solutions \n\nEuna Solutions® is a leading provider of purpose-built, cloud-based software that helps public sector and government organizations streamline procurement, budgeting, payments, grants management, and special education administration. Designed to enhance efficiency, collaboration, and compliance, Euna Solutions supports more than 3,400 organizations across North America in building trust, enabling transparency, and driving community impact. Recognized on Government Technology’s GovTech 100 list, Euna Solutions is committed to advancing public sector progress through innovative SaaS solutions. To learn more, visit www.eunasolutions.com.\n\nPlease visit our website: https://eunasolutions.com/careers/ and check out our LinkedIn Pages https://www.linkedin.com/company/eunasolutions/\n\nWe believe in embracing new perspectives and optimizing impact. If you have relatable experience and relevant transferrable skills but feel you may be missing a few of the requirements, we encourage you to apply!  We recognize that people have unique career journeys and if you're excited about this role and know you can bring something great to the team, then we want to hear from you. Please know Euna Solutions is committed to providing a comfortable and accessible interview process for every candidate. If there are any accommodations our team can make throughout our hiring process (big or small), please let us know.\n\nFor any inquiries or requests regarding accessibility at Euna Solutions, please email recruiting@eunasolutions.com or call our office at 1.877.707.7755. Upon request, appropriate accessible formats or arrangements will be provided as soon as practicable.",
      "easy_apply": false,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-05T20:42:32.770550-04:00"
    },
    "matchScore": 70,
    "analysis": {
      "matchScore": 70,
      "strengths": [
        "Hands-on experience with incident triage and resolution.",
        "Experience with troubleshooting and log analysis.",
        "Familiarity with ticketing systems like ServiceNow and Jira.",
        "Strong communication skills demonstrated through cross-functional collaboration and documentation.",
        "Experience supporting financial workflows.",
        "Experience with Windows and potentially Mac through personal use",
        "Experience with scripting languages (Python/TypeScript) which is useful for automation",
        "Some cloud experience"
      ],
      "gaps": [
        "Lack of explicit experience in IT system administration.",
        "No explicit mention of experience managing routine service requests (password resets, software installations).",
        "No mention of Microsoft 365 Fundamentals certification or direct experience with the Microsoft 365 ecosystem.",
        "Limited experience with networking technologies.",
        "No explicit mention of knowledge of security frameworks and certifications (beyond adhering to the organization's designated security framework)."
      ],
      "suggestions": [
        "Highlight experience related to user support, such as assisting users with application issues.",
        "Quantify the impact of automated tasks to showcase efficiency improvements.",
        "Explicitly state familiarity with managing routine service requests, drawing on applicable experiences.",
        "Mention experience with or knowledge of Microsoft 365 if applicable.",
        "Emphasize troubleshooting skills and ability to resolve issues independently.",
        "Tailor the resume to specifically mention skills and experiences aligned with the IT Analyst role at Euna Solutions. Leverage keywords in the job description.",
        "Relate security knowledge to frameworks if possible."
      ],
      "summary": "Roger's resume demonstrates a good fit for the IT Analyst role at Euna Solutions, with a strong background in application support, incident triage, and troubleshooting. The resume showcases relevant skills in log analysis, SQL, and communication, aligning well with the job requirements. However, there are gaps in experience with IT system administration, managing routine service requests, and knowledge of Microsoft 365 and networking technologies. Addressing these gaps and tailoring the resume to emphasize relevant skills will significantly improve the application's competitiveness."
    },
    "job_category": "support"
  },
  {
    "id": 26,
    "job": {
      "title": "Integration Application Specialist Student",
      "company": "OLG",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326050051",
      "url": "https://www.linkedin.com/jobs/view/4326050051/?alternateChannel=search&eBP=CwEAAAGa8RujPVishVtOutqrk8gYDeaeiHZG_NI4CjN5ZwyBwPBMfk6uEk4PajNICY-PD_MS5bMW0kLIIvdGfGnCz54bk8XUZq1SS5wf9LEQfIfMfcQArSLBypBJ1vw-n1Ey2OKm76QHQETOcAHKvslwFF6hU2gW6GRSg7wHnLEJ3khKI1G5xmsEpsHeybmuwC6d-HzDKRsWyqMYWXI6o-2HfmDNZmAk5Lz4aQDo2r91EgRHur_I3YDhH4Ooc_PHSlL_AGBAPdoBqOaOrNAAQ61q_nPqp4eMGhh6wvm0ZzxU8XGmEVlGXQiJgrXciry1BFRtfD8X-IdWLTfAO7aJVb_4NOeVJo7S6EAIZefsqodMi38AE05XSrw3gE7fjIwPjOjquf6_b4hrfp0lh7MMelHvUURaypVCjlDpitJScOez-Jc08g3pAtOvrjs58EnjVj8Pk1x09-Nw1GDRItKa_3y1ZB16585p&refId=kplczyqU17coIEKehbLtuw%3D%3D&trackingId=xJs5a9IxxfxnqcNjLS7a4A%3D%3D",
      "description": "About the job\n\nJob Description\n\nIntegration Application Specialist – Student\n\nLocations Available: Sault Ste. Marie or Toronto\n\nDuration: Winter (January - April 2026)\n\nType: Student Full Time\n\nRange: $18.50 - $28.50\n\nGAME ON – OLG needs you\n\nWe’ve said GAME ON, and we mean it – OLG is rapidly transforming its organization to better serve Ontarians by delivering great gaming experiences through our digital, retail lottery, and land-based gaming channels. Over the course of fiscal 2023-24, OLG delivered a record $2.4 billion in net profit to the Province of Ontario. OLG is now expanding our horizons even further, with a new strategic direction that builds on successes to date as a world class gaming entertainment leader with a globally admired omni-channel platform.\n\nPosition Summary\n\nAs an Integration Application Specialist – Student at OLG you will get to support our team in evaluating, optimizing, and enhancing system integration processes across the organization. This role provides an opportunity to gain hands-on experience in system integration, process improvement, and data management while working alongside an experienced team of professionals.\n\nYour Role In The Game\n\n\nEvaluating and optimizing system integration processes involved in integrating and transforming systems within an organization\nAssessing current operations to identify inefficiencies and recommend improvements.\nEnsuring seamless communication between different systems and applications.\nManaging data flow between systems, ensuring integrity, accuracy, and security.\nAssisting in coding, testing, and debugging integration solutions.\nContinuously monitor system performance and suggest necessary updates.\nEnsuring integration solutions comply with company standards and industry regulations.\nMaintaining detailed documentation of integration processes, configurations, and technical specifications.\n\n\nWhat You Need To Play\n\n\nCurrently enrolled in a post-secondary program with a focus on computer science and information technology\nExperience in an information technology field with experience in at least one or more IT domains \nExcellent interpersonal skills and highly developed verbal and written communication skills \nAbility to work independently and within a team in a fast-paced environment \nAbility to self-motivate and the desire to learn new skills \n\n\nPerks Of Joining Our Team\n\n\nWorking as part of a large Technology and Digitally driven organization\nBeing part of a collaborative working environment alongside OLG Leaders who support the growth and development of students\nParticipate in Diversity and Inclusion initiatives across the organization including Pride Parade and Women’s Leadership Programs\nSupport OLG Charities including the Federated Health Campaign, United Way Campaign and other fundraising efforts for local charities\n\n\nLearn about OLG – GAME ON! \n\nOLG’s purpose is to contribute to a better Ontario by delivering great entertainment experiences for our customers. We are a multi-billion-dollar organization with a wide array of business lines including, lottery, land-based casinos, digital lottery and casino, horseracing, and charitable gaming. OLG is amidst a massive transformation focusing on being customer obsessed and bringing our digital business to a whole new level.\n\nThe key to our success is our people. Our culture will be grounded in true, positive partnerships that embrace trust, clarity, and openness in all that we do. We are supporting and empowering employees and teams across the organization through greater accountability, leadership development and growth opportunities. OLG is embracing more flexible work options and family friendly work practices including hybrid work.\n\nEquity, diversity, and inclusion are essential elements of our culture and cornerstones of the Five Truths that OLGers Live by. At OLG, our employees have the space to be themselves and use their perspectives and skills to benefit the people and the Province of Ontario.\n\nWhile we are re-shaping and growing our business, we are unwavering when it comes to living our purpose, and ensuring our business delivers meaningful benefits for the people of Ontario. OLG’s net profits are reinvested back into the province, contributing to the quality of life for Ontarians.\n\nTo learn more about OLG go to our website at www.olg.ca\n\nApplication Instructions\n\n\n If you are in a co-op program, please apply through your school’s portal or co-op coordinator AND through the OLG student careers page: https://olg.wd3.myworkdayjobs.com/Careers-Students\n If you are not in an official co-op program or we have not posted at your school, please apply through the OLG student careers page using the link above.\n\n\nApplication Deadline: December 14, 2025.\n\nOLG is an equal opportunity employer. We are committed to providing employment accommodation in accordance with the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act. Please contact Human Resources at careers@olg.ca if you require accommodation at any time throughout the hire process\n\nWe thank you for your interest in this opportunity; however only those individuals selected for an interview will be contacted.\n\nPersonal information is collected by the Ontario Lottery & Gaming Corporation (OLG) and/or its third party service provider(s) under the authority of the Ontario Lottery and Gaming Corporation Act, 1999, SO 1999, c 12, Sch L and the Employment Standards Act, 2000, S.O. 2000, c. 41 (as amended) and will be used for the purpose of determining qualifications for employment with OLG and for recruitment modernization initiatives. The information will be managed in accordance with all applicable laws, OLG’s Protection of Privacy Policy (the Policy) and related policies and procedures. For any questions about this collection, please contact careers@olg.ca, 800-70 Foster Drive, Sault Ste. Marie, ON, P6A 6V2.",
      "easy_apply": false,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-05T20:42:43.077082-04:00"
    },
    "matchScore": 70,
    "analysis": {
      "matchScore": 70,
      "strengths": [
        "Experience with system integration processes through supporting internal applications.",
        "Strong communication skills demonstrated through customer service and cross-functional collaboration.",
        "Experience in troubleshooting and debugging, particularly API failures and deployment issues.",
        "Familiarity with monitoring tools like Datadog and Application Insights.",
        "Technical skills including scripting (Python/TypeScript) and database knowledge (SQL, MongoDB)."
      ],
      "gaps": [
        "No explicit mention of experience in evaluating or optimizing system integration processes.",
        "Lack of direct experience in managing data flow between systems, ensuring integrity, accuracy, and security.",
        "No mention of experience ensuring integration solutions comply with industry regulations."
      ],
      "suggestions": [
        "Highlight relevant experience in optimizing processes, even if not explicitly labeled 'system integration'.",
        "Provide specific examples of ensuring data integrity or security in previous roles.",
        "Tailor the resume to emphasize skills directly related to the job description, such as process improvement.",
        "Quantify achievements wherever possible to demonstrate impact."
      ],
      "summary": "Roger Xu's resume demonstrates a strong foundation in application support and troubleshooting, with relevant experience in incident triage, log analysis, and SQL investigation. The resume highlights strong communication and collaboration skills, aligning with the needs of the Integration Application Specialist role. While the resume lacks explicit experience in optimizing integration processes and managing data flow, Roger's existing skills and experience make them a potentially suitable candidate with some tailoring."
    },
    "job_category": "support"
  },
  {
    "id": 28,
    "job": {
      "title": "Cyber Analytics Specialist",
      "company": "Resonaite",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4325794439",
      "url": "https://www.linkedin.com/jobs/view/4325794439/?alternateChannel=search&eBP=CwEAAAGa8SRtZhV6Z6eXHZ7JDFVboGUD7pSHLxXgINGsaeztEjnjJu4cy1iovq81_soFUplOwJgwI0LG55_Lax2qaGAtdHeIgPATSw8qYhITQNWoTsOQnxl-B4qNsTDySCUqEWeXXBCpkUqFC3OpBYNxiC5nJBPGRW_6YOaeDUFmezcBg_z3xMWfDday03gzahbxybDZDnD3kDcuyeAF0OSj2DOp5wuNmnjKkGk5gRjBkAiXTYlGsua_-A53291AbJGJhBGBB7jgl0ODBf7y3JZ6gxnIeC2C-u28QeLS5-VxXDOcjzxLoc3mWVsE3rgJ644e2cM5x5WXyqHK1S3Rp1fpoeWEoZFh2NpwL9mfpafDw5qx-tK1iSnEfN5seyK7c_Y4N2Db7726ZkMUjwxHuKT-D3QRp6Tkj8uvGFYpnT_cN2oSskvofehCL-YzVT7A9cYgEkI1ry8RPzTGbB0d8sIkASNJMRzyHCRa82isO9jBfUcrhNU9DHJFOse2veLTUVKPJw&refId=ik2i%2F3OtqshUCp0R5jTaBA%3D%3D&trackingId=q2lbIs8aRuxj48McV7wBzA%3D%3D",
      "description": "About the job\n\nOur client in the public sector is seeking a contract based Cyber Analytics Specialist \n\nThis role is responsible for designing automated workflows, building resilient data pipelines, and developing dashboards that deliver clear, actionable insights for executive and operational decision-making.\n\n\n\n\nLocation: 3d/week Toronto\n\nDuration: 6 months + 6 month ext\n\n\n\n\nResponsibilities\n\nMaintain and optimize AWS data pipelines (S3, Glue, Lambda, Redshift, Step Functions) for cyber security reporting.\nAutomate data ingestion, transformation, and quality checks; resolve pipeline and ingestion issues.\nPerform data cleaning, validation, version control, and support flat-file operations.\nDesign, update, and troubleshoot Tableau dashboards; manage user access and support future EntraID SSO integration.\nDevelop scripts, reusable ETL components, and API integrations to streamline workflows and automate data exchanges.\nEnhance legacy workflows using Python, JavaScript, VBA, or other scripting tools.\nConfigure and maintain JIRA workflows, dashboards, permissions, and automations.\nCollaborate with internal teams and vendors to ensure reliable reporting, data integrity, and operational continuity.\nIdentify opportunities to improve processes, reduce manual effort, and strengthen automation across systems.\n\n\n\n\nRequirements:\n\nAWS Expertise: Hands-on experience with S3, Glue, Lambda, Redshift, Step Functions, and managing production data pipelines.\nData Engineering Skills: Strong ETL/ELT development background, SQL proficiency, and experience with data transformation, validation, and automation.\nTableau Knowledge: Ability to design, maintain, and troubleshoot Tableau dashboards; familiarity with Tableau administration and user access management.\nIntegration & Automation: Experience integrating APIs, building automation scripts, and applying best practices for workflow automation and version control (Git).\nIdentity & Access Management: Understanding of EntraID, SSO concepts, and IAM compliance best practices.\nCyber Security Metrics: Familiarity with cyber security or risk metrics used in executive and operational reporting.\nJIRA Administration: Experience configuring workflows, dashboards, permissions, and automations, including scripting for workflow enhancements.\nScripting & Development: Proficiency with Python, JavaScript, and/or VBA; ability to extend workflows and build reusable components.\nProblem-Solving: Strong analytical skills to troubleshoot pipeline failures, data issues, and dashboard logic errors.\nCollaboration & Communication: Ability to work effectively with cross-functional teams, vendors, and technical stakeholders.\nPreferred Certification: AWS Certified Data Engineer – Associate (or equivalent).",
      "easy_apply": true,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-05T20:52:07.852101-04:00"
    },
    "matchScore": 70,
    "analysis": {
      "matchScore": 70,
      "strengths": [
        "Strong AWS skills demonstrated through experience with Lambda, API Gateway, and CloudWatch.",
        "Proficient in data transformation and automation using Python, JavaScript/TypeScript, and SQL.",
        "Experience with building and maintaining data pipelines, including data ingestion, transformation, and quality checks.",
        "Familiar with ticketing systems (ServiceNow, Jira, Azure Boards) and JIRA workflows.",
        "Experience with API integration and debugging.",
        "Strong analytical skills demonstrated through root-cause analysis and log investigation.",
        "Experience with version control using Git/GitHub."
      ],
      "gaps": [
        "Limited explicitly stated experience with Tableau dashboard design, maintenance, and troubleshooting.",
        "No direct experience mentioned with Redshift and Step Functions, key AWS services listed in the job description.",
        "No experience with EntraID, SSO concepts, and IAM compliance best practices.",
        "Lacks explicit experience in a cybersecurity context or specific knowledge of cyber security metrics.",
        "No experience with VBA which is mentioned as preferred."
      ],
      "suggestions": [
        "Quantify achievements whenever possible, e.g., 'Reduced manual workload by X% by automating Y tasks.'",
        "Highlight specific projects where AWS services (especially Lambda, API Gateway, and CloudWatch) were used to build data pipelines or automate data processing.",
        "If the candidate has worked with data visualization tools, even if not Tableau, this should be mentioned to showcase transferable skills.",
        "Consider adding a brief personal project showcasing knowledge of cybersecurity concepts or data analytics in the cybersecurity domain.",
        "Consider pursuing AWS Certified Data Engineer – Associate (or equivalent) to strengthen credentials."
      ],
      "summary": "The resume presents a strong candidate with relevant experience in data engineering, AWS, and scripting. The candidate's application support experience translates well to troubleshooting and optimizing data pipelines. However, there are gaps in Tableau dashboard expertise, specific AWS services mentioned in the job description (Redshift, Step Functions), cybersecurity context, and Identity & Access Management. Addressing these gaps with targeted examples or additional training will significantly improve the match."
    },
    "job_category": "support"
  },
  {
    "id": 30,
    "job": {
      "title": "Senior Analyst, Systems & Analytics",
      "company": "CPP Investments | Investissements RPC",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326004277",
      "url": "https://www.linkedin.com/jobs/view/4326004277/?alternateChannel=search&eBP=CwEAAAGa8SRtZxaRXAjmW8d3petJQo5zxLGBAxaM8-nH3e9-3iF2IQA86l-hXnGGAxGTMgGaeDEgUeKLfnqMFvJ5ARsof-T6X1pGvx3YGXeNu64vcq_XFYixcvqxWQjq9Grn0YFeJWu2e3RJoGRAOhcKY960T6YC5KsPVHtHima-9SEsuyKY07UVdDzyBIZF0ilvX0MVr_yqgwbHbBfNlJxYlsmoD3rTwp7jCZ6LWxduZsoJzr_1bk0H4Z78SQMmNspCs_8zkenRSIX9OqHunv1UhfFU_NhvGBR7FVTyZTq48rTW_BvYBqO3V_qPfzWYeHanaw5tAT5CpmRAZEGjX7XO-srUp9wTZjhk-Oom-Wxm6NsqW98N4-WJNblo8g7Q_a9Q4XwjXYf4Sq6A6WuSXujlSMhG_aPEi85edYVaNvVSRcroCZ7X7GZ7v5dB7vlhuAjbVoX3Nv7cucfFpnIuYTPotjq_NnpEl9QBYBY7pr57btfnWagfviJwCPCtQOTl1PyYRjjJfW45-g&refId=ik2i%2F3OtqshUCp0R5jTaBA%3D%3D&trackingId=31Sw0boxfRXmtRpv3Pu1TA%3D%3D",
      "description": "About the job\n\nCompany Description\n\nMake an impact at a global and dynamic investment organization\n\nWhen you join CPP Investments, you are joining one of the world’s most admired and respected institutional investors. As a professional investment management organization, CPP Investments invests the funds of the Canada Pension Plan (CPP) to help ensure its financial sustainability for generations of working and retired Canadians.\n\nCPP Investments invests across regions and asset classes to build a globally diversified portfolio. It holds assets in public equity, private equity, real estate, infrastructure, and fixed income, and the CPP Fund is projected to reach $3.6 trillion in assets by 2050. The organization is headquartered in Toronto with offices in Hong Kong, London, Mumbai, New York City, San Francisco, São Paulo, and Sydney.\n\nCPP Investments successfully attracts, selects, and retains talented individuals from top-tier institutions worldwide. Join our team for access to:\n\n\nStimulating work in a fast-paced and intellectually challenging environment\nAccelerated exposure and responsibility\nGlobal career development opportunities\nDiverse and inspiring colleagues and approachable leaders\nA hybrid-flexible work environment with an emphasis on in-person collaboration\nA culture rooted in principles of integrity, partnership, and high performance\nAn organization with an important social purpose that positively impacts lives\n\n\nIf you have a passion for performance, value a collegial and collaborative culture, and approach work with the highest integrity, invest your career here.\n\nJob Description\n\nReporting to the Manager, Systems and Analytics within the Global Corporate Services (GCS) organization, the Senior Analyst, Systems and Analytics will be responsible for provisioning system reporting, functional system configuration and analytical support for assigned GCS systems, and disparate GCS relevant data. This role encompasses supporting the creation of Executive level systems and analysis communication, in addition to assisting with business analysis, system reporting, functional system configuration changes and continuous process improvement opportunities.\n\nSystems and Analytics projects that are assigned may span a single year or multiple years and will require the support of other business functions within the organization. In this role, you will be responsible for ensuring that GCS system and analysis activities are progressing as planned and are meeting the documented requirements, and service level objectives.\n\nThis role will be of interest to a self-driven, highly organized individual who is interested in supporting global corporate transformation programs where systems, automation, process refinement, and cost & risk management intersect. The candidate should have a combination of technical, analytical and system administration and configuration skills, and is ready to take the next step in his or her career.\n\nTeam Description\n\nSystems & Analytics team plays a critical role in ensuring the success of Global Corporate Services business and process enabling applications. We focus on the functional sustainment, optimization, and continuous improvement of the platforms that support our business operations.\n\nAs Part Of Our Team, You’ll\n\n\nEnhance and evolve enterprise systems by managing functional configurations, enabling new features, and ensuring smooth release cycles.\nPartner with business stakeholders and end users to improve functionality, drive adoption, and deliver an excellent user experience.\nEnsure data integrity and transparency by managing functional data flows that support accurate reporting and informed decision-making.\nCollaborate across teams to align systems capabilities with business needs and strategic priorities.\n\n\nMajor Accountabilities\n\n\nEnsures accuracy, integrity and completeness of reporting information. Recommends and supports improvements to support data driven decision making.\nAnalyzes and summarizes detailed data using moderately complex logic and validation methods to deliver clear & concise reporting and accompanying data narrative of key business drivers to GCS leadership, team & cross-function customers.\nMaps business process improvements for GCS management through reporting & key business planning cycles that create 'value add' business decision support.\nLeads cross function interactions with Technology & Data and other relevant stakeholders to drive efficient & effective business planning and system configuration, management reporting & key strategic program reporting.\nProvide insightful analysis related to existing system configuration functions and their ability to meet stakeholder needs; identify issues & opportunities and recommend solutions.\nProvides improved business control support to the GCS Team through the provision of systems reporting, business analysis, sustainability reporting and cost management reporting during key business cycles (month-end, forecast, long range plan, & budget,) to GCS Budget Managers\nDrives continuous business process improvements regarding the GCS management reporting & key business planning cycles that create 'value add' business decision support.\nDocument and update key process documentation, including risk / controls, and ensure proper alignment with key stakeholders.\nTogether with the Manager and collective GCS organization enables the operational management and subsequent reporting of all GCS systems and processes while also looking for opportunities to further enable end user self-service, improve automation, limit carbon generation and reduce task touch time thus enabling efficiency and maximum system utilization. \nWorks in partnership across Systems and Analytics as well as the broader GCS organization in support of a GCS cost to serve model where service utilization, service level objectives, and relevant costs can be quantified and reported vis existing systems and/or through traditional methods to the GCS Senior Management Team level for budgeting and cost management.\nAs part of the GCS systems and operational framework supports CPPIB’s journey to carbon neutrality through the development of GCS operations carbon impact reporting where available.\n\n\nQualifications\n\n\nA University degree or College Diploma in Data Science & Analytics, IT, Business Administration, or related field\n3-5 years’ experience working as part of large-scale organization and or complex business projects in an analytical and process engineering role is required.\nStrong aptitude in IT controls, Software Development Lifecycle (SDLC), UAT, and Change Management principles to support successful implementation and end-user adoption of new digital offerings\nCurious mindset with a willingness to explore emerging AI tools and assess their potential to drive efficiencies in processes, data management, and user support\nStrong analytical, problem-solving and organizational skills\nHas strong attention to detail\nAbility to manage multiple projects or tasks simultaneously\nExperience with Enterprise Platforms & Systems (i.e.: ServiceNow, Oracle, Third-Party Risk, Procurement Platforms) would be considered an asset\nProficient in Microsoft Office products such as Word, Excel, PowerPoint\nProficient in data analysis, visualization and deriving actionable insights from operations data. Experience with data visualization platforms would be considered an asset\nAbility to work independently and in a team environment\nExcellent written and oral communications skills able to liaise confidently with internal and external stakeholders, including team members, senior management, office managers, contractors, and consultants\nAbility to be assertive in a public environment\n\n\nAdditional Information\n\nVisit our LinkedIn Career Page or Follow us on LinkedIn. \n\nAt CPP Investments, we are committed to diversity and equitable access to employment opportunities based on ability.\n\nWe thank all applicants for their interest but will only contact candidates selected to advance in the hiring process.\n\nOur Commitment To Inclusion And Diversity\n\nIn addition to being dedicated to building a workforce that reflects diverse talent, we are committed to fostering an inclusive and accessible experience. If you require an accommodation for any part of the recruitment process (including alternate formats of materials, accessible meeting rooms, etc.), please let us know and we will work with you to meet your needs.\n\nDisclaimer\n\nCPP Investments does not accept resumes from employment placement agencies, head-hunters or recruitment suppliers that are not in a formal contractual arrangement with us. Our recruitment supplier arrangements are restricted to specific hiring needs and do not include this or other web-site job postings. Any resume or other information received from a supplier not approved by CPP Investments to provide resumes to this posting or web-site will be considered unsolicited and will not be considered. CPP Investments will not pay any referral, placement or other fee for the supply of such unsolicited resumes or information.",
      "easy_apply": false,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-05T20:52:37.601030-04:00"
    },
    "matchScore": 70,
    "analysis": {
      "matchScore": 70,
      "strengths": [
        "Experience in application support and systems analysis.",
        "Proficient in SQL, data analysis, and log investigation.",
        "Familiar with incident triage, root-cause analysis, and ticketing systems.",
        "Experience with cloud platforms (AWS, Azure DevOps) and CI/CD pipelines.",
        "Strong communication and collaboration skills.",
        "Experience supporting financial workflows."
      ],
      "gaps": [
        "Limited explicit experience with enterprise platforms and systems mentioned in the job description (ServiceNow, Oracle, Third-Party Risk, Procurement Platforms).",
        "No explicit experience with data visualization platforms.",
        "Limited detail regarding experience in a large-scale organization or complex business projects (although experience at HOOPP and J.P. Morgan implies this).",
        "No specific mention of experience with AI tools."
      ],
      "suggestions": [
        "Highlight any experience with ServiceNow, Oracle, or other enterprise platforms in the skills section or within the experience descriptions.",
        "Quantify achievements whenever possible to demonstrate impact, such as reducing incident resolution time or improving system uptime.",
        "If comfortable, add a brief section on familiarity or interest in emerging AI tools.",
        "Tailor the resume summary to directly address the key requirements of the Senior Analyst, Systems and Analytics role, emphasizing analytical and process engineering experience.",
        "Specifically mention relevant experience in data visualization, even if it's a brief mention of tools or techniques used."
      ],
      "summary": "The resume demonstrates a solid background in application support, systems analysis, and related technical skills that align well with the job description. The candidate possesses relevant experience with incident management, log analysis, SQL, and cloud platforms. While the resume shows strengths in data analysis and communication, it could be strengthened by explicitly addressing the requirements for experience with specific enterprise platforms (ServiceNow, Oracle), data visualization tools and large-scale organizations."
    },
    "job_category": "support"
  },
  {
    "id": 31,
    "job": {
      "title": "Associate, AI Governance",
      "company": "BMO",
      "location": "Toronto, ON",
      "job_id": "4342342795",
      "url": "https://www.linkedin.com/jobs/view/4342342795/?alternateChannel=search&eBP=CwEAAAGa8SRtZ2PJbbav9irl7ae0uPyN8gPyuNJTDY12Vz80XEf_LTFCLyyc-kW7DUBrvA6BN92ZLzXlpHmayKcd7zw8DxtpV9neNhuBVydSLGRgdiJBHLOKfkrj9GGNtNQRcoWx5Za9DSrr2kguaVV1mUqzsHubmcegrW75BUetkwfO8m11dnP0dhlHWvV2NTZKPmFc2ICXv_m3_IWXfwgwPM5t8AwKXeuh6WxgYrDToVFYrVxju2Jlfp5V0nBACEqa0Aat6ucCebGDKsfH8w3x63FlgIBl-leEjRXhQSAmZBkKJnZv9In9Bre7FS33LSW0e-NVrCeMQjSgQOr7U8LWjlO0oPy-b7FvhSabkYp_mG0XN9TfF98F7T4Jk4OzsEfHWCXIXzt6bEJRrPPb4SZjk-lEbXyQw9dISNPzQtZLnXTu0jE5hUG1mM-y-yTyBKA3cmVdfJQ8rk23kenTHlKdbQ6WZFObDPc&refId=ik2i%2F3OtqshUCp0R5jTaBA%3D%3D&trackingId=2qWm2Dk3eBqSgUjG1P1lcw%3D%3D",
      "description": "About the job\n\nBMO Capital Markets is a leading, full-service North American-based financial services provider offering equity and debt underwriting, corporate lending and project financing, merger and acquisitions advisory services, securitization, treasury management, market risk management, debt and equity research and institutional sales and trading. BMO Capital Markets has over 2,700 professionals in 30+ locations around the world, including 20 offices in North America.\n\nBMO Capital Markets is a member of BMO Financial Group (NYSE, TSX: BMO), one of the largest diversified financial services providers in North America with US$1.0 trillion total assets and approximately 54,000 employees as of January 31, 2025.\n\nOversees the development of methods, practices, policies, tools and processes to collect, store, access and use data securely, efficiently, and cost-effectively. Supports the full lifecycle of data assets. Assures the quality of data collection, including the adequacy, accuracy and legitimacy of the data. Identifies ways to manage data across a diverse but unified data tier. Plans and supports the implementation of cloud data management platforms and tools, policies and procedures giving the organization control of business data, both in cloud applications and hybrid cloud/ on-premise set-ups. Manages data integration applying relevant data governance and management practices.\n\n\nCreates and maintains an optimal data pipeline architecture.\nAssembles large, complex data sets that meet functional / non-functional business requirements.\nIdentifies, designs, and implements internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability.\nBuilds the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources.\nBuilds analytics tools that utilize the data pipeline to provide actionable insights into customer, operational efficiency and other key business performance metrics.\nWorks with different stakeholders and teams to assist with data-related technical issues and support their data infrastructure needs.\nWorks with experts in data strategy and data governance to suggest quality enhancements.\nFocus is primarily on business/group within BMO; may have broader, enterprise-wide focus.\nExercises judgment to identify, diagnose, and solve problems within given rules.\nWorks independently on a range of complex tasks, which may include unique situations.\nBroader work or accountabilities may be assigned as needed.\n\n\nQualifications:\n\n\nFoundational level of proficiency:\n\n\nCreative thinking.\nData architecture design and modeling.\nCloud computing architecture.\nData security.\nMachine learning.\nComputational thinking and programming.\nDeep learning.\nDecision making.\nCritical thinking.\n\n\n\nIntermediate level of proficiency:\n\n\nData integration.\nData warehousing.\nEnterprise data management.\nData mining.\nBig data.\nStreaming / Real time.\nVerbal & written communication skills.\nCollaboration & team skills.\nAnalytical and problem solving skills.\nData driven decision making.\nTypically between 4 - 6 years of relevant experience and post-secondary degree in related field of study or an equivalent combination of education and experience.\nTechnical proficiency gained through education and/or business experience.\n\n\n\nBase Salary: $90,000- $120,000 CAD \n\n(subject to negotiation and subject to the candidate meeting the specific skills, experience, education, and qualification requirements)\n\nSalary:\n\n$61,600.00 - $113,900.00\n\nPay Type:\n\nSalaried\n\nThe above represents BMO Financial Group’s pay range and type.\n\nSalaries will vary based on factors such as location, skills, experience, education, and qualifications for the role, and may include a commission structure. Salaries for part-time roles will be pro-rated based on number of hours regularly worked. For commission roles, the salary listed above represents BMO Financial Group’s expected target for the first year in this position.\n\nBMO Financial Group’s total compensation package will vary based on the pay type of the position and may include performance-based incentives, discretionary bonuses, as well as other perks and rewards. BMO also offers health insurance, tuition reimbursement, accident and life insurance, and retirement savings plans. To view more details of our benefits, please visit: https://jobs.bmo.com/global/en/Total-Rewards\n\nAbout Us\n\nAt BMO we are driven by a shared Purpose: Boldly Grow the Good in business and life. It calls on us to create lasting, positive change for our customers, our communities and our people. By working together, innovating and pushing boundaries, we transform lives and businesses, and power economic growth around the world.\n\nAs a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one – for yourself and our customers. We’ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we’ll help you gain valuable experience, and broaden your skillset.\n\nTo find out more visit us at https://jobs.bmo.com/ca/en\n\nBMO is committed to an inclusive, equitable and accessible workplace. By learning from each other’s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.\n\nNote to Recruiters: BMO does not accept unsolicited resumes from any source other than directly from a candidate. Any unsolicited resumes sent to BMO, directly or indirectly, will be considered BMO property. BMO will not pay a fee for any placement resulting from the receipt of an unsolicited resume. A recruiting agency must first have a valid, written and fully executed agency agreement contract for service to submit resumes.",
      "easy_apply": false,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-05T20:52:44.611431-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Extensive experience with relevant technologies like TypeScript, React, Node.js, and cloud platforms (AWS, Azure).",
        "Demonstrated ability to design and implement data pipelines and build analytics tools.",
        "Experience with data integration, data warehousing, and data mining concepts.",
        "Proven track record of improving data delivery, automating processes, and redesigning infrastructure for scalability.",
        "Experience with Agile/Scrum methodologies and CI/CD pipelines.",
        "Experience with database technologies (SQL & NoSQL, PostgreSQL, MongoDB)."
      ],
      "gaps": [
        "Limited explicit mention of data architecture design and modeling skills.",
        "No explicit mention of experience with Big Data technologies.",
        "No explicit mention of experience with streaming/real-time data processing.",
        "Lack of specific examples related to data security in a financial context.",
        "Experience level is likely less than the preferred 4-6 years, given the stated Co-op experience."
      ],
      "suggestions": [
        "Highlight experience related to data architecture and data modeling, even if it was part of broader projects.",
        "If possible, quantify the impact of data integration and pipeline improvements using metrics relevant to BMO's business (e.g., cost savings, revenue increases).",
        "Include projects showcasing experience with large datasets or real-time data processing, even if on a smaller scale.",
        "Tailor the resume to emphasize the candidate's understanding of data security principles and their application, especially within cloud environments.",
        "Clarify the nature of the co-op experience and relate it to full-time equivalent experience where possible."
      ],
      "summary": "Roger Xu's resume demonstrates a strong foundation in software engineering with skills and experience relevant to the data pipeline architecture role at BMO Capital Markets. He possesses significant experience in full-stack development, cloud platforms, and DevOps, with demonstrable achievements in improving efficiency and reliability. While some gaps exist in specific areas like data architecture design, big data, and data security, the candidate's overall profile aligns well with the job description, making him a promising candidate with the potential for a strong fit."
    },
    "job_category": "sde"
  },
  {
    "id": 33,
    "job": {
      "title": "Site Reliability Engineer",
      "company": "Scotiabank",
      "location": "Toronto, ON (On-site)",
      "job_id": "4325844400",
      "url": "https://www.linkedin.com/jobs/view/4325844400/?alternateChannel=search&eBP=CwEAAAGa8SevGngGe9NkYkwCE2t-rdYKcImtNgBB4NObLsz3WbUOg1cgV34HVLM9QXDKKusUGuhudfJ3ZZn7lFqQ7d6IKZ8qXA1kHbhU0ebDpdYLNqnAdHwEhL6-yIrrzHrG77N1lk_Ch266jFJkzXsFBW1IrvHFXi9wuvXk96abxwnglMZyQ67vbzvWsQfXJSOupaWw-SeqP2JxCb9QGi530x6CmWjfex2QpSBEyK8b0RDzmY2d0xKSTVaJjQY4vCNcJw3wErcmok4YEZ99Xb5NDhbnUTA33rZT0yLpY57cxan4Gqv6Y6c_KnU5sdF2EEA4Id8IODF_qZfOpKLSyhbdXLEsHxE-icuM3_Ux_VUzHPMnsfoOBqWp-rA_w34N2RPEu1xk8PdyAUE1m1Pm9h25sUKKhRymBD0YV-L7fO_w6zNN6Ln25bh-PmCIIMdViu6a4JTYgNV13U_ALKBq4xilUBCej6lCXuZMPAoHohJas6pYa37xyH3UF3ZdbfXeVN38yKT5D5nTHw&refId=dT9VTQK4TLoP%2BiVpk4K3ug%3D%3D&trackingId=OwzeANHGxsR4hG5lvlcB3A%3D%3D",
      "description": "About the job\n\nRequisition ID: 244027\n\nJoin a purpose driven winning team, committed to results, in an inclusive and high-performing culture.\n\nOverview: As a Site Reliability Engineer (SRE), you will join the Digital Engineering Operations team, responsible for ensuring the operations and reliability of Scotiabank digital applications. You will have the opportunity to drive the success of Scotia Digital production services by enhancing availability, scalability, performance, and reliability. The team proactively seeks ways to improve application monitoring, address production issues, and assist with customer inquiries. The role will also involve implementing tagging for customer analytics\n\nIs this role right for you? In this role you will:\n\n\nSpecification Gathering: Gather and refine specifications and requirements based on technical needs.\nRisk Management: Direct day-to-day activities in alignment with our risk culture and relevant risk appetite statements, communicating these throughout the team.\nOperational Efficiency: Create an environment that promotes effective and efficient operations while ensuring adherence to day-to-day business controls for risk and compliance.\nDocumentation: Create and maintain comprehensive software documentation.\nCustomer Focus: Champion a customer-focused culture to deepen client relationships and leverage broader Bank relationships, systems, and knowledge.\nIncident Management: Drive incident management, problem management, and site reliability engineering (SRE) practices.\nLeadership in Crisis: Lead, triage, and communicate severity 1 and major incidents, including change management impacting the digital banking channel. Note that this role includes on-call responsibilities outside of traditional working hours.\nLiaison Role: Perform ongoing interaction between various units, including technology partners, customer-facing staff, QA departments, vendors, product groups, business lines, and leadership.\nSubject Matter Expertise: Provide end-to-end support as a subject matter expert.\nApplication Reliability: Lead initiatives to perform analysis for lasting application reliability.\nOperational Enhancement: Enhance steady-state operations, alerting, real-time monitoring, and operational visibility.\nApplication Deployment: Safely deploy provided code packages utilizing approved application security platform\n\n\nSkills\n\nDo you have the skills that will enable you to succeed in this role? We’d love to work with you if you have:\n\n\nEducation: Post-secondary degree in a related field (technical or business).\nTechnologies: (Java, Spring Boot); deep knowledge of Object-Oriented and Functional Design with Java programming language.\nIndustry Knowledge: Familiarity with Google SRE practices and ITIL service delivery methodology and previous 2+ years experience in SRE role\nLogical Thinking: Strong logical thinking in understanding end-to-end use cases and mapping them to system flows.\nCustomer Experience: Good understanding of how technologies, infrastructure, and processes impact the customer experience.\nInnovation: Curious and experimental mindset to drive innovation amidst uncertainty.\nProblem Management: Lead initiatives to perform deep analysis into recurring or complex problems.\nCommunication Skills: Effective communication and diplomacy skills to liaise between groups of varying technical expertise and interests.\nTechnical Expertise: Experience with at least one modern JS frontend framework, preferably Node.js and React.js; devops tools such as Git, Bitbucket, CI/CD (Azure DevOps), and Jenkins; application security platforms like Checkmarx, Blackduck, Webinspect; SSL authentication; REST API design; modern Java toolsets\nCloud Computing: Solid understanding of Cloud computing technologies – Kubernetes/Docker; GKE; Azure PCF is an asset.\nIncident Resolution: Experience driving incident resolution through bridge calls and leading root cause analysis with technology partners.\nMonitoring and Support: Knowledge about building a highly automated production monitoring and support model, expert knowledge integrating Splunk, and Dynatrace.\nCommunication: Superior verbal and written communication skills with the ability to influence decision-making with stakeholders.\nNice to Have: Experience building accessible and internationalized web applications\nNice to Have: Experience working with authenticated applications utilizing OAuth (or similar)\nNice to Have: Prior experience in software engineering/SRE role within a financial services organization.\n\n\nWhat's in it for you?\n\n\nDiversity, Equity, Inclusion & Allyship - We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow & participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability & veterans.\nAccessibility and Workplace Accommodations - We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements. \nUpskilling through online courses, cross-functional development opportunities, and tuition assistance. \nCompetitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\nDynamic Ecosystem - Free tea & coffee, universal washrooms, and lots of space for team collaboration.\nCommunity Engagement - No matter where you choose to work from; we offer opportunities for community engagement & belonging with our various programs.\n\n\nLocation(s): Canada : Ontario : Toronto\n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. If you require technical assistance, please click here. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-05T20:55:38.989488-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong full-stack development experience with relevant technologies (TypeScript, React, Node.js).",
        "Experience with cloud platforms (AWS, Azure) and related services (Lambda, API Gateway, DynamoDB).",
        "Proficient in DevOps practices including CI/CD (Azure DevOps, GitHub Actions), containerization (Docker), and testing (Jest, React Testing Library, Playwright).",
        "Demonstrated experience in improving application performance, reliability, and scalability.",
        "Experience with incident management and problem-solving, as evidenced by optimizing CI/CD pipelines and improving test coverage.",
        "Experience with building REST APIs and integrating with external services (e.g., Finnhub, OpenAI, Microsoft Graph API).",
        "Familiarity with Agile/Scrum methodologies.",
        "Exposure to application security platforms is indicated by working with OAuth and integrating Sentiment Classifiers to reduce triage time for support tickets.",
        "Experience with monitoring tools like CloudWatch and Datadog."
      ],
      "gaps": [
        "Limited experience with Java and Spring Boot, as emphasized in the job description.",
        "No explicit mention of Google SRE practices or ITIL service delivery methodology.",
        "Lack of specific experience with Google Kubernetes Engine (GKE) and Azure PCF.",
        "No direct experience with Splunk or Dynatrace integration.",
        "No prior experience in a dedicated SRE role is explicitly stated, although the resume contains strong indications of SRE skills.",
        "Experience in a financial services organization is not evident.",
        "No direct discussion of experience building accessible or internationalized web applications."
      ],
      "suggestions": [
        "Highlight experience with Java or Spring Boot if available, even in personal projects or coursework.",
        "Research and briefly mention Google SRE practices and ITIL methodologies in the cover letter or during the interview.",
        "Emphasize relevant experience in incident management, problem-solving, and application reliability to demonstrate SRE capabilities.",
        "Quantify the impact of improvements made to CI/CD pipelines, application performance, or test coverage to showcase results.",
        "Provide further detail on integration of sentiment classifier with Azure OpenAI Service to highlight application security platforms.",
        "Incorporate how experiences in current roles relate to SRE principles (Observability, Automation, Reliability) in a cover letter or during the interview to close the gap on the SRE requirements.",
        "If applicable, mention any experience with building accessible and internationalized web applications."
      ],
      "summary": "The resume demonstrates a strong alignment with the job description, particularly in areas of full-stack development, cloud computing, DevOps practices, and problem-solving. While gaps exist in specific technologies like Java/Spring Boot and experience with Google SRE practices and specific monitoring tools, the candidate's overall skillset and experience make them a promising candidate. Highlighting relevant skills and experiences in a cover letter and during the interview can further strengthen their application."
    },
    "job_category": "sde"
  },
  {
    "id": 34,
    "job": {
      "title": "Production Engineer",
      "company": "IBM",
      "location": "Markham, ON (Hybrid)",
      "job_id": "4325867874",
      "url": "https://www.linkedin.com/jobs/view/4325867874/?alternateChannel=search&eBP=CwEAAAGa8SevGjUgnR60UzEMIXUgqX-yQ4UW07VkGsNzJqSd8sJ2OLMQqngQCdhFMZQy3Nd6GCq82A9L4SQc9P3afIWf9dKz24T6Kbn3uzTA0qwXqhyAMvQrdp50TtJIz2PKkkIaMeiRCiNpCSJlOhjj3WP1XvUtsQaLHhROaeL_JPxIhPPtRMiHyp7VQGhWGMlh4m5xhdG3pNo0H8h1O1rF4WKTLBS2ysdHeR_2TtxLxloFxdbOmm1fLrBhFTDQLAr6FqNGDIJKQBQTKG-ZoqoVvajvnkLsldXkR2Edf4x7fiLT8BnuM_uvbfKMah1HseIxrgAQRMzUrlaHw-_rNU-1N94lOjhbS3x1lOot7HytdYb84gvYumibUnc0iefxq0sia9bvk0bC-0E2j2jURe-ShyqTUfW2ychJGnDjHN02Gc52blotbwbRJG5FxGt7BKp1XIyinRH3QvS72PXwZL48WyOSQE84p30&refId=dT9VTQK4TLoP%2BiVpk4K3ug%3D%3D&trackingId=ucY%2FBZKfcKWTcGuPZPrduw%3D%3D",
      "description": "About the job\n\nIntroduction\n\nA career in IBM Software means you’ll be part of a team that transforms our customer’s challenges into solutions.\n\nSeeking new possibilities and always staying curious, we are a team dedicated to creating the world’s leading AI-powered, cloud-native software solutions for our customers. Our renowned legacy creates endless global opportunities for our IBMers, so the door is always open for those who want to grow their career.\n\nIBM’s product and technology landscape includes Research, Software, and Infrastructure. Entering this domain positions you at the heart of IBM, where growth and innovation thrive.\n\nYour Role And Responsibilities\n\nWhat you will do:\n\n\nEnsure platform reliability and performance: Monitor, troubleshoot, and optimize production systems running on Kubernetes (EKS, GKE, AKS).\nAutomate operations: Develop and maintain automation for infrastructure provisioning, scaling, and incident response.\nIncident response & on-call support: Participate in on-call rotations to quickly detect, mitigate, and resolve production incidents.\nKubernetes upgrades & management: Own and drive Kubernetes version upgrades, node pool scaling, and security patches.\nObservability & monitoring: Implement and refine observability tools (Datadog, Prometheus, Splunk, etc.) for proactive monitoring and alerting.\nInfrastructure as Code (IaC): Manage infrastructure using Terraform, Terragrunt, Helm, and Kubernetes manifests.\nCross-functional collaboration: Work closely with developers, DBPEs (Database Production Engineers), SREs, and other teams to improve platform stability.\nPerformance tuning: Analyze and optimize cloud and containerized workloads for cost efficiency and high availability.\nSecurity & compliance: Ensure platform security best practices, incident response, and compliance adherence..\n\n\nPreferred Education\n\nMaster's Degree\n\nRequired Technical And Professional Expertise\n\n\nStrong expertise in Kubernetes (EKS, GKE, AKS) and container orchestration.\nExperience with AWS, GCP, or Azure, particularly in managing large-scale cloud infrastructure.\nProficiency in Terraform, Helm, and Infrastructure as Code (IaC).\nStrong understanding of Linux systems, networking, and security best practices.\nExperience with monitoring & logging tools (Datadog, Splunk, Prometheus, Grafana, ELK, etc.).\nHands-on experience with automation & scripting (Python, Bash, or Go).\nExperience in incident management & debugging complex distributed systems.\nFamiliarity with CI/CD pipelines and release automation.",
      "easy_apply": false,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-05T20:55:46.468530-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong experience with AWS and Azure Cloud platforms aligns well with the requirement of managing large-scale cloud infrastructure.",
        "Proficiency in Kubernetes and container orchestration is evident through project descriptions and experience, directly addressing a key requirement.",
        "Experience with Terraform, Infrastructure as Code (IaC), and CI/CD pipelines is demonstrated through projects and work experience.",
        "Familiarity with monitoring tools like CloudWatch and Datadog is mentioned, aligning with the need for observability and monitoring.",
        "Experience with scripting languages like Python and Bash is listed, covering the automation & scripting requirement.",
        "Demonstrated ability to improve system performance and reliability through implemented solutions shows practical experience in areas of platform stability and performance tuning."
      ],
      "gaps": [
        "The resume doesn't explicitly state experience with GKE or AKS, focusing more on general Kubernetes experience.",
        "Specific experience with Splunk, Prometheus, Grafana, or ELK is not clearly detailed, only general mention of CloudWatch and Datadog.",
        "The resume does not explicitly mention experience with Terragrunt, although it does include Terraform.",
        "While incident response experience is implied, it is not explicitly highlighted as a primary responsibility."
      ],
      "suggestions": [
        "Highlight specific projects or experiences where GKE or AKS were utilized, even if briefly.",
        "Quantify the experience with Datadog and CloudWatch, mentioning specific use cases or dashboards created.",
        "Consider adding details about your experience with incident response processes to showcase expertise in this area.",
        "Elaborate on any experience with security best practices and compliance adherence within cloud environments.",
        "If comfortable, adding a personal website link or Github link will help prove claimed skills."
      ],
      "summary": "The resume demonstrates a strong alignment with the job description, particularly in areas of Kubernetes, cloud infrastructure management (AWS/Azure), IaC (Terraform), and CI/CD. Key strengths include hands-on experience with relevant technologies and a proven track record of improving system performance and reliability. Some gaps exist regarding specific experience with GKE/AKS, certain monitoring tools (Splunk, Prometheus, Grafana, ELK), and explicit incident response responsibilities. Addressing these gaps with more detail and quantification would further strengthen the application."
    },
    "job_category": "sde"
  }
]