[
  {
    "job": {
      "title": "Full Stack Developer",
      "company": "ShyftLabs",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4313651633",
      "url": "https://www.linkedin.com/jobs/view/4313651633/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=jNPcNiy%2BgDqM9XF5vUqOfQ%3D%3D&trackingId=4PsppyWPFjRGeraC28IxKw%3D%3D",
      "description": "About the job\n\nAbout ShyftLabs\n\nAt ShyftLabs, we live and breathe data. Since 2020, we’ve been helping Fortune 500 companies unlock growth with cutting-edge digital solutions that transform industries and create measurable business impact. We’re growing fast and we’re looking for passionate problem-solvers who are ready to turn big ideas into real outcomes.\n\nThe Opportunity\n\nWe’re a fast-growing startup building intelligent, data-driven products that blend AI, automation, and stunning visual experiences. We move fast, think big, and love solving complex problems with clean code and creativity. We’re looking for a Full Stack Developer who’s excited to ship impactful features, experiment with emerging tech, and help shape the direction of our product and architecture.\n\nWhat you'll be doing\n\n\nBuild, maintain, and scale full-stack applications using Node.js (Express/NestJS), React (Next.js / Framer Motion), and TypeScript\nDesign and implement scalable APIs and microservices connected to PostgreSQL, MongoDB, Kafka, and ClickHouse\nCreate beautiful, responsive, and animated UIs with Tailwind CSS, Framer Motion, and Three.js that bring data to life\nDevelop automation workflows powered by AI (OCR, LLMs, ML models) to process financial data, reconcile records, and surface insights in real time\nDeploy code through CI/CD pipelines with Docker, GKE, or ECS, keeping everything observable via Prometheus and Grafana\nCollaborate closely with designers and product owners to ship high-quality features that feel fast, intuitive, and fun to use\nTune databases and services for performance using Redis/Memorystore and connection pooling (HikariCP, RDS Proxy)\nWrite solid unit and integration tests to keep our stack reliable as we grow\n\n\n\nWhat You Bring\n\n\n4+ years of experience building production-grade web applications\nStrong hands-on experience with Node.js, React, and TypeScript\nFamiliarity with GCP or AWS and modern containerized deployments\nExperience working with data-heavy systems or AI-driven workflows is a plus\nA builder’s mindset where you enjoy taking ideas from concept to production\nComfortable working in a hybrid setup (3 days/week onsite) and collaborating face-to-face with a small, ambitious team\nCuriosity, creativity, and a drive to make an impact in a startup environment\n\n\n\nWhy You’ll Love Working at ShyftLabs\n\nAt ShyftLabs, your work matters. We’re a growing data product company making a big impact with Fortune 500 clients and as we scale, you’ll have the chance to shape solutions, influence strategy, and grow your career alongside us.\n\nHere’s what you can expect when you join our team:\n\n\nHybrid Flexibility: Enjoy a hybrid model with 3 days per week in our Toronto office\nDowntown Toronto Office: Work in the heart of the city\nComprehensive Benefits: We cover 100% of health, dental, and vision insurance premiums for you and your dependents which means no out-of-pocket costs. Eligibility starts from day one itself\nGrowth & Learning: Access extensive learning and development resources to keep leveling up your skills\n\n\n\nInclusion at ShyftLabs\n\nWe’re building something big, and we want you on the journey with us. If you’re ready to use data and innovation to make an impact, apply today and let’s grow together.\n\nShyftLabs is an equal-opportunity employer committed to creating a safe, diverse, and inclusive environment. We encourage applicants of all backgrounds including ethnicity, religion, disability status, gender identity, sexual orientation, family status, age, and nationality to apply. If you require accommodation during the interview process, let us know and we’ll be happy to support you.",
      "easy_apply": false,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-10-11T17:54:34.384421-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Strong full-stack development experience with TypeScript, React, and Node.js.",
        "Experience with relevant technologies like Next.js, Tailwind CSS, PostgreSQL, and MongoDB.",
        "Experience with cloud platforms (AWS and Azure) and containerization (Docker).",
        "Demonstrated ability to improve performance, reduce load times, and optimize CI/CD pipelines.",
        "Experience with AI integration (Google Cloud APIs, Gemini APIs, OpenAI APIs).",
        "Experience with Agile/Scrum development methodologies.",
        "Experience with testing frameworks (Jest, React Testing Library, Playwright).",
        "Experience designing APIs and microservices"
      ],
      "gaps": [
        "Lack of explicitly stated experience with Framer Motion and Three.js for UI development.",
        "Limited experience with GCP, Kafka, ClickHouse, Prometheus, Grafana, Redis/Memorystore, HikariCP, and RDS Proxy.",
        "Does not explicitly state experience with OCR, LLMs or ML models for processing financial data.",
        "Experience is limited to co-op role and projects.",
        "Experience is less than the '4+ years' stipulated by the job description."
      ],
      "suggestions": [
        "Highlight any experience with Framer Motion or Three.js, even if it's from personal projects.",
        "Quantify the impact of AI integrations where possible, connecting it to financial data processing or insights generation.",
        "In the summary, emphasize the candidate's passion for learning and adapting to new technologies.",
        "Explicitly mention the length of experience in the Summary and tailor it to the minimum requirement where appropriate.",
        "Provide more detail about the types of data the candidate has worked with and the insights they have generated.",
        "While the resume lists GCP API usage, explicitly stating familiarity with GCP's infrastructure or services would strengthen the application."
      ],
      "summary": "Roger Xu's resume demonstrates a strong foundation in full-stack development with relevant technologies like TypeScript, React, Node.js, and experience with cloud platforms and AI integration. The resume showcases project experience where his skills shine. However, the resume has gaps in specific technologies like Framer Motion, Three.js, Kafka, and ClickHouse, and the level of experience listed does not meet the minimum 4 years in the job description. Addressing these gaps with additional detail and emphasizing adaptability would improve the match."
    }
  },
  {
    "job": {
      "title": "Associate, Software Engineer, New Grad",
      "company": "Capital One",
      "location": "Toronto, ON",
      "job_id": "4313636756",
      "url": "https://www.linkedin.com/jobs/view/4313636756/?alternateChannel=search&eBP=CwEAAAGZ1USCz593toqMnR6KKZQDTXfFC5S5RgvQBSAJpu-TgpKG55XPL8njIUH9BzuwR_Vzv80VOnXLxKnJrul0ktpL-yCw0HV2B9ZsfhTylnKy-J6cfCI3KO0XB-Lq42Wfgn96bRG20yJ2U9liZ0Yqh9RGptcfwQRyozWG0U5HrZymtQMvPrz71mhkQOiY_Rpbja7S-_9JZeqZfXsGowVXeH3Spx3Pqzk7qjoYrjuYg6AsSUDX1hAqfcS9xfktWkJsQb99_ofy-0umEC3O7IKx9CL6_h4IbrMsH60kuPItBJA9S32w4TDZYvNYAqjiqJggM3-cb8WNN3WOrFjYnuctoMJ4Ph6lIFvwLaKJExe0NsIqFph-lNmZxkeOv_r2IgPttrdyQ1ZGO6CNyIliatZTi8T4NgyLnpTQm81LfbBC8ZQvb_qw4Grs6wj8IBnhUGeSi7pgyjRy-7ZqnDxBG1odQB3nGg_J6ABqC2zhaTjCcA&refId=jNPcNiy%2BgDqM9XF5vUqOfQ%3D%3D&trackingId=Wcn0G0E7TBw9nfuPTsCdmg%3D%3D",
      "description": "About the job\n\n161 Bay Street (93021), Canada, Toronto,Toronto, Ontario,\n\nAssociate, Software Engineer, New Grad\n\nMUST INCLUDE YOUR RESUME AND UNOFFICIAL TRANSCRIPT IN ONE PDF DOCUMENT IN THE ATTACHMENT SECTION WHEN YOU CREATE YOUR PROFILE TO APPLY.\n\nAbout Capital One Canada.\n\nFor over 20 years, we’ve been on a mission to change banking for good and build relationships by making credit accessible, simple, intuitive and rewarding. We want to help Canadians succeed with credit, because we believe in people — in our customers, in our associates, and in talent like you!\n\nAbout The Team\n\nYes, we’re a credit card company. But we’re more than that too. We’re driven by what our customers want, and how to make their lives simpler.\n\nWe’re always looking for creative ways to offer digital solutions that make sense for our customers. With your help, we’ll build the next generation of banking in Canada based on customer-focused values, compelling products and great engineering.\n\nAbout The Role\n\nOur environment is creative, filled with teams that are passionate about the work they're doing and the people they are doing it for. We're a technology thought leader in the financial industry and we want to keep it that way.\n\nWe have a passion for open-source and for working with the latest technologies. Whether you're a big Apple fan or an Android lover, a UI developer or prefer NoSQL databases over anything else, you'll fit in our team. All you need is to be passionate about technology!\n\nBelow are some of the skills the team is looking for, but you’re not expected to have them all. Curiosity and willingness to learn are what matter most.\n\n\nIDE: Android Studio, XCode, Visual Studio Code, IntelliJ\nLanguage: Kotlin, Swift, Javascript, Typescript, GoLang, NodeJS\nAWS: S3, EC2, Lambda, Route53, Security Groups, IAM roles\nMonitoring Tool: Splunk, New Relic, Cloudwatch\nTesting Framework: MockitoJUnitRunner, Espresso, XCTest\n\n\nOur Associates are involved in business critical projects. Here are some examples.\n\n\nImprove user experience for Android / iOS customers\nDevelop CI/CD pipelines to AWS cloud environment \nRemediate and enhance cyber security\nCreate front end applications with React and Angular. \nDevelop backend Microservice applications and APIs\n\n\nThink it. Code it.\n\nThis is our motto! By that, we mean that you, as a member of one of our great Agile teams will be responsible for the design, coding, testing and delivery of solutions that benefit our customers and Canadians in general.\n\nContinuous Learning\n\nWe’re here to help you develop your knowledge and skills, both on the job and in the classroom. Our engineers have access to incredible continuous learning tools and courses through our very own Tech College, a world-class learning hub that offers both online and in-person classes for across multiple disciplines—Cloud Computing, Cyber Security, Mobile Development, Machine Learning & AI, to name a few.\n\nAs a new Software Engineer, you’ll join the Tech Development Program (TDP), which takes place over your first year with us and involves hands-on learning, development, and networking. Throughout your time in the program you could tackle front-end, back-end, full-stack, mobile development, or maybe even all of them.\n\nYour Responsibilities: \n\n\nWork as part of a dynamic team throughout the software development life cycle\nCollaborate with designers and analysts to implement enhancements or new applications \nDevelop code to meet story acceptance criteria \nConduct design and code reviews to ensure high-level quality output\nEnsure adherence to continuous improvement practices as required to meet quality, and time to market imperatives \nMaintain records to document program development, and revisions \nProvide third-level support of software solution as needed\n\n\nBasic Qualifications:\n\n\nHave obtained a Bachelor’s degree or higher between September 2025 to September 2026\nGood communication, presentation, and writing skills\nGood understanding of testing fundamentals\nExperience in unix or linux operating systems\nAble to work within a team setting and actively participate and collaborate in team discussions\n\n\nPreferred Qualifications:\n\n\nExperience in front end development such as JavaScript, HTML, mobile, frameworks such as React, Vue, Angular\nKnowledge of programming languages, including but not limited to Java, Python, JavaScript, NodeJS, Kotlin. \nExperience with Jenkins CI/CD, microservices, API design / integration \nExperience with version control technology i.e. Git\nExperience in a Linux/Unix environment with strong coding background. \n\n\nWorking at Capital One.\n\nEnjoy a hybrid work environment, with 3 days in the office. Build a comfortable workspace with our one-time, Work From Home allowance and enjoy our head office located conveniently across the street from Union Station.\n\nLive well—physically, financially and emotionally. Receive support for you and those who are most important to you, with full coverage for spouses, domestic partners, and dependents. With up to $3000 in mental health coverage and up to $5000 in tuition subsidies per year—and much more—you’ll discover that Capital One is committed to helping you live your best life.\n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One’s recruiting process, please send an email to Careers@capitalone.com.\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\n\nWe may use your information for automated decision making. We may, for certain purposes, render a decision based exclusively on automated processing of your personal information as a part of the candidate screening process. \n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at ARCanada@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "easy_apply": false,
      "posted_date": "3 hours ago",
      "scraped_at": "2025-10-11T17:54:45.366798-04:00"
    },
    "matchScore": 80,
    "analysis": {
      "matchScore": 80,
      "strengths": [
        "Strong full-stack experience with relevant technologies like TypeScript, React, Node.js.",
        "Experience with cloud platforms (AWS, Azure) and related services.",
        "CI/CD experience with tools like GitHub Actions and Azure DevOps.",
        "Experience with testing frameworks like Jest and React Testing Library.",
        "Experience with Agile/Scrum development methodologies.",
        "Project experience demonstrates practical application of skills.",
        "Education aligns with the requirement of a Bachelor's degree obtained within the specified timeframe."
      ],
      "gaps": [
        "Limited explicit mention of Java, Kotlin, and Angular which are listed as preferred skills.",
        "No explicit experience with Splunk, New Relic or Cloudwatch is present.",
        "No mention of experience with Android Studio, XCode, Visual Studio Code or IntelliJ IDEs is present.",
        "No explicit mention of MockitoJUnitRunner, Espresso, or XCTest.",
        "Limited mention of Microservices."
      ],
      "suggestions": [
        "Highlight any experience with Java, Kotlin, or Angular in the projects or skills section, even if it was minimal.",
        "Quantify achievements whenever possible to demonstrate impact.",
        "Tailor the resume to emphasize skills and experiences that align directly with the preferred qualifications in the job description, such as CI/CD experience, and experience in a Linux/Unix environment.",
        "Consider adding a brief mention of experience or familiarity with the IDEs listed in the job description, if applicable.",
        "Include the specific dates of degree completion to ensure it falls within the specified timeframe (September 2025 to September 2026)."
      ],
      "summary": "The resume demonstrates a strong alignment with the job description, particularly in full-stack development, cloud experience, and CI/CD. The candidate possesses many of the desired skills and experiences. Some gaps exist in specific technologies mentioned as preferred qualifications, but overall the resume is a good fit for the role."
    }
  },
  {
    "job": {
      "title": "UI/UX Developer",
      "company": "Softchoice",
      "location": "Toronto, ON",
      "job_id": "4312891374",
      "url": "https://www.linkedin.com/jobs/view/4312891374/?alternateChannel=search&eBP=CwEAAAGZ1USCz3AM4wTAbS4S1PG_SiKhZlRWeLR7-ZlhGxWf-WYeXxOomlUC951_5yvozgV-eh8rawAoQmiW1FkSJw1qy197JgFtJbXbO3Y2Cbvlug8tFOnZ1EhPXyrW-4kjTql0nldPHl40H4AIYEfyy6PhpwJuvjyKlYg_S4Cwax6MiT3jRc7st46daljgJiJx-9ufoz84JuUm0wZaAwYoGg4SSg_AAAtzwLiADFZOqEClHJfvKfIEgY_pX4uO0_LUyQs2kukVsE33SyTMf1k47Td0sQyd5jl5CniqOmaYV-XtL5X87RolSbj-C4sqAkdpgUYESpQeWqfHopfG5dtA6Ele9gdzQ2aXX5lIql0PUey5-dZMCAfFYEmRf5yhySxD4iFSJK5pu17MrEzlp2GZu_H4BXdH-2Huq6eOygnMm0xDRi4rxw_VqRvDcjPFPi9Y--ab6-UQudaGPZmAZqVPwpOpReIneJVOkRPsE_jcNMZW4BNFvpcA_Xj6xiC6JWNcHzIle_8&refId=jNPcNiy%2BgDqM9XF5vUqOfQ%3D%3D&trackingId=BOmIhHABSUcSW%2FmDwZIwmw%3D%3D",
      "description": "About the job\n\nWhy You’ll Love Softchoice\n\nWe are a software-focused IT solutions and services provider that equips organizations to be agile and innovative, and for their people to be engaged, connected, and creative at work. That means moving them to the cloud, helping them build the workplace of tomorrow, and enabling them to make smarter decisions about their technology. By doing these things we help them create success for their customers and their people.\n\nWe stand proudly for our people and support their success through career development and advancement. We are recognized and respected for our culture of inclusion and belonging, continuously striving to do what’s good for our people and communities.\n\nThe Impact You Will Have\n\nAs a UI/UX Developer, you will have a direct impact on delivering user-centered digital experiences that improve usability, accessibility, and customer satisfaction. By combining design thinking with front-end development expertise, you will help reduce friction for users, strengthen brand consistency, and improve collaboration between design and engineering teams - ultimately driving measurable business outcomes.\n\nWhat You Will Do\n\n\nDevelop Angular based company eCommerce website to increase the sales transactions through website. \nGather functional requirements, develop technical specifications, and project & test planning. \nDevelop all pages/features using Angular as the SPA JavaScript framework. \nDevelop pages/features using Vue as the SPA JavaScript framework. \nWork cross-functionally with other Softchoice platforms to develop new features and provide support for sales organization. \nProvide technical support to both our internal and external users. \nWork with internal sales teams to develop new features, troubleshoot any technical issues they may have and ensure that their customers are happy. \nWork with internal platform development teams (i.e. SFDC, SAP, Mule) to integrate the reading/writing of data between softchoice.com and other platforms. \nWork with external Softchoice customers to help troubleshoot any technical issues they may have with the website. \nA widespread level of influence where any internal or external user of softchoice.com could be potentially impacted. \nOn-time delivery of all stories during each sprint of specific projects/programs. \nTransform UI/UX design wireframes into functional front-end code using HTML, CSS, Angular, Vue. \nCollaborate with UX designers to implement design systems, interaction flows, and visual layouts. \nOptimize applications for performance, accessibility, and cross-browser compatibility. \nEnsure consistency and alignment with brand guidelines across digital platforms. \nStay current on emerging technologies and best practices in front-end development and user experience design. \nAdhere to the WCAG 2 Accessibility standard. \n\n\n\nWhat You Will Bring To The Table\n\n\nHave solid practical understanding and experience with latest version of Angular and Vue. \nPost-secondary education obtained at a community college or one or more professional designations or University degree. \n3+ years of relevant experience. \nAbility to work with cross functional teams and external customers. \n\n\n\nPay Range\n\nThe typical pay range for this role is 81,260 - 95,600.\n\nNote: the pay range represents the full pay range for this position. Each individual offer will take into consideration a range of factors, including prior experience and geographic location.\n\nIn addition to the base salary, this role is eligible for additional elements of compensation including (cell allowances, annual bonus, or commissions etc.), as well as a comprehensive benefits plan.\n\nNot sure if you qualify? Think about applying anyway:\n\nWe understand that not everyone brings 100% of the skills and experience for the role.\n\nAt Softchoice, we offer opportunities to a diverse group including those with a variety of workplace experiences and backgrounds. Whether you are new to corporate tech, returning to work after a gap in employment, or looking to transition and take the next step in your career, we are excited to learn more about you and encourage you to apply.\n\nWhy You’ll Love Working Here\n\n\nThe People: You’ll thrive in our collaborative environment, surrounded by incredible colleagues who foster support and innovation, driving our collective success \nHigh-Performing Culture: At Softchoice, we are dedicated to achieving our goals and committed to success for our customers and each other \nFlexibility: Plan your workdays in a way that suits you best \nAward-Winning Workplace: Proudly recognized as a Great Place to Work for 20 consecutive years \nInclusive Culture: We are committed to an inclusive culture where every team member can be their authentic self \nCompetitive Benefits: Benefit from competitive perks that start on day one \n\n\n\nInclusion & Equal Opportunity Employment\n\nWe are an equal opportunity employer committed to diversity, inclusion & belonging. People seeking employment at Softchoice are considered without regard to any protected category including but not limited to, race, color, religion, national origin, age, sex, marital status, ancestry, disability, veteran status, gender identity, or sexual orientation.\n\nRequire accommodation? We are ready to help:\n\nWe are proud to provide interview & employment accommodation during the recruitment and hiring process. If you require any accommodation to apply or interview for a position, please reach out directly to asktalentacquisition@softchoice.com . We are committed to working with you to best meet your needs.\n\nOur Commitment To Your Experience\n\nWe are committed to the safety of all applicants and team members. With that in mind, we have implemented digital interviewing for everyone. We understand that you may need to interview with distractions around you (such as children or furry friends) and we will be doing the same.\n\nBefore you start with us, we will conduct a criminal record check, verify your education, and check your references.\n\nWhen you join Softchoice, we will onboard you remotely. Don't worry. It's quick, simple and you'll be connected with your new team in no time.\n\nJob Requisition ID: 6905\n\nEoE/Vet/Disability",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-10-11T17:54:51.492191-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Strong full-stack development experience with relevant technologies like TypeScript, React, Node.js, and cloud platforms (AWS, Azure).",
        "Experience with frontend frameworks like React, Next.js, Tailwind CSS, and Material UI, aligning well with the UI/UX Developer role.",
        "Experience with database technologies such as MongoDB and PostgreSQL, providing versatility.",
        "Experience with DevOps practices, including CI/CD (GitHub Actions, Azure DevOps) and containerization (Docker), contributing to efficient development workflows.",
        "Proven track record of improving website performance and user engagement, as demonstrated by project accomplishments.",
        "Experience with Agile/Scrum methodologies, indicating ability to work effectively in team environments.",
        "Experience integrating AI using Google Cloud and OpenAI APIs. This shows willingness to learn and adapt to new technologies."
      ],
      "gaps": [
        "Lack of explicit mention of Angular experience, which is a primary requirement in the job description.",
        "Limited details on UI/UX design experience beyond implementing designs.",
        "The resume has mostly used recent project experiences, it's important to mention relevant experience of 3+ years."
      ],
      "suggestions": [
        "Quantify accomplishments whenever possible using metrics to demonstrate impact.",
        "Explicitly mention Angular experience if available, even if it's through personal projects or older experiences.",
        "Highlight any UI/UX design projects or contributions to showcase a user-centered approach.",
        "Tailor the resume summary to emphasize skills and experiences that directly align with the job requirements, particularly Angular and Vue.",
        "Consider adding a portfolio link to showcase UI/UX design and front-end development projects."
      ],
      "summary": "Roger Xu's resume presents a strong candidate profile for a UI/UX Developer role, showcasing proficiency in full-stack development, frontend frameworks, and cloud technologies. However, the absence of explicit Angular experience and limited UI/UX design details may hinder the initial screening. Tailoring the resume to address these gaps and emphasizing relevant achievements would significantly enhance the match."
    }
  },
  {
    "job": {
      "title": "AI Application Architect (1778) $90-100/hr",
      "company": "Direct IT Recruiting Inc.",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4313517187",
      "url": "https://www.linkedin.com/jobs/view/4313517187/?alternateChannel=search&eBP=CwEAAAGZ1USCz392rbBsQULw5oZj0I6Aq4UwAnRu4B1gY1jA_bJgvGKk9YU4m2duJ_NZ_dNaJxRokxdL0EnZvkIyTET-w3CJAQISUpJediX6QnwFNHo1XWegqFoyPKAspkCzXGDxiTFg4PlHp_Gm-NGG0Esd065dka1bTdaxuD1Z5El-L8jof7_UxT6CV6xR12PLH50eUb2yOwJdPeyba7IGVAgV4wmtcu9x0U7qhIYDMcYMq6t4RUyEASX6_brz67nw2aoaPB3lviRgybx7f_pw9l_z3jDqIoXqNaV7yzRJjqdh-CmrYiJ4mpWOIGh0AgaEFOqnORdT9wLK1XM1i30PCm_V-0m-fkIasS-IjJeFx14PSB6wvQxWy5xjBtNOefWTHm14Z3kKUkKKs4fLB4NNmO7C-vdxf6owKaW9CjA970kKYJqEf9KoYWUJw616_-jrVusFNxTAvtm8izg3mamG4-LjoSjRWIc&refId=jNPcNiy%2BgDqM9XF5vUqOfQ%3D%3D&trackingId=BtmzvRmpg9Y0PaadZUuhcQ%3D%3D",
      "description": "About the job\n\nNOTE: Hybrid work model, 2 days/week in Toronto, Ontario office.\n\nTYPE: 6-Month Contract\n\nSKILLS: AI Architect, Senior AI Developer, RAG, LangGraph, Microsoft Agent Framework, Azure, ASE, AKS, APIM, Redis, Azure SQL, Python, FastAPI, Docker, AI microservices, Vue.js, React\n\nINDUSTRY: Bank\n\n\n\n\nDESCRIPTION: \n\n\n\n\nSeeking an AI Applications Architect. This role is a combined AI Architect and hands-on senior AI developer.\n\n\n\n\nAI Architecture: Proven experience with Retrieval-Augmented Generation (RAG) pipelines, multi-agent orchestration (LangGraph, Microsoft Agent Framework), and reasoning systems.\nAzure Cloud Infrastructure: Extensive experience with Azure-native AI infrastructure, including App Service Environments (ASE), Azure Kubernetes Service (AKS), Azure API Management (APIM), Redis, and Azure SQL.\nScalability & Performance: Skilled in creating scalable, resilient AI infrastructure on Azure to support enterprise workloads.\nBackend & AI Services: Proficient with Python (FastAPI), Docker, and deploying AI microservices securely in an Azure environment.\nClient-Side Development: Experience building client-side applications using JavaScript frameworks such as Electron.js, Vue.js, or React.\nBusiness Communication & Collaboration: Ability to translate technical solutions into business language, extract requirements from stakeholders, and collaborate across technology groups to build integrated solutions.\nImplementation Leadership: Experience leading development teams to implement and deliver AI solutions effectively.\nA Master's degree in Computer Science, Computer Engineering, or AI is preferred.\n\n\n\n\nTO APPLY: https://directitrecruiting.com/job/ai-applications-architect-1778/",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-10-11T17:54:54.601699-04:00"
    },
    "matchScore": 78,
    "analysis": {
      "matchScore": 78,
      "strengths": [
        "Extensive hands-on experience in full-stack development with relevant technologies (TypeScript, React, Node.js, Python/FastAPI, Docker).",
        "Proven experience with cloud platforms (AWS & Azure) and related services.",
        "Experience building and deploying AI-powered applications, integrating with services like OpenAI and Azure OpenAI.",
        "Familiarity with CI/CD pipelines (GitHub Actions, Azure DevOps).",
        "Experience with databases such as PostgreSQL and MongoDB.",
        "Experience with REST APIs and microservices.",
        "Experience with testing frameworks such as Jest and React Testing Library.",
        "Experience working in Agile/Scrum environments."
      ],
      "gaps": [
        "Lack of explicit experience with RAG pipelines, LangGraph, and Microsoft Agent Framework.",
        "Limited evidence of extensive experience with Azure-native AI infrastructure components such as ASE, AKS, APIM, Redis, and Azure SQL (DynamoDB is mentioned but not SQL).",
        "No direct experience with Electron.js or Vue.js is listed.",
        "The resume doesn't showcase 'Implementation Leadership' experience, although some team contribution is noted.",
        "The resume shows a Masters in Commerce and Accounting, not Computer Science, Computer Engineering, or AI (preferred)."
      ],
      "suggestions": [
        "Highlight any projects or experiences, even personal ones, that involve RAG, LangGraph, or Microsoft Agent Framework.",
        "Quantify the impact of AI integrations to demonstrate the value of AI solutions.",
        "Explicitly mention any experience with Azure-specific AI infrastructure components (ASE, AKS, APIM, Redis, Azure SQL) in the resume, even if it was a brief exposure.",
        "Even though React experience is mentioned, if there is any experience (even small) with Vue.js or Electron.js, mention it.",
        "Emphasize any experiences where they led or guided a team.",
        "In the summary or cover letter, address the degree preference by highlighting relevant coursework or skills obtained through other educational experiences."
      ],
      "summary": "The resume demonstrates a strong foundation in full-stack development, cloud platforms, and AI integration, making the candidate a potentially good fit for the role. The candidate possesses several required skills such as React, Python (FastAPI), Docker, and Azure experience. However, there are gaps in specific AI architecture technologies (RAG, LangGraph, Microsoft Agent Framework) and deep experience with Azure-native AI infrastructure. Addressing these gaps in a cover letter or during an interview would significantly improve the application."
    }
  }
]