[
  {
    "id": 1,
    "job": {
      "title": "Full Stack Engineer",
      "company": "Compass Digital",
      "location": "Greater Toronto Area, Canada (Hybrid)",
      "job_id": "4348862775",
      "url": "https://www.linkedin.com/jobs/view/4348862775/?alternateChannel=search&eBP=BUDGET_EXHAUSTED_JOB&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=cfKpM99D1yW1ckk4B9VGQw%3D%3D",
      "description": "About the job\n\nHybrid: 3 x Week, Toronto or Mississauga Office\n\nToronto: 72 Fraser Avenue\n\nMississauga: 1 Prologis Blvd\n\n\n\n\nNow, if you were to come on board as our Full-Stack Developer , we’d ask you to do the following for us:\n\nHelp us implement standards, next-best practices for code quality and test coverage\nConsider performance, usability & accessibility first\nCare about our users’ experience just as much as our developers’\nWork across the stack, rounding out your skillset or choosing a specialization\nEnsure scalability and reliability in all decisions\nApproach work with curiosity, and critically question the status quo\nBuild your leadership skills within your team\nThis role includes participation in an on-call rotation to support the reliability of our systems. On-call is shared fairly across the team and supported with robust tooling.\nYou will have the opportunity to use the latest and greatest cloud and open-source technology in developing technology driven hospitality experiences for our customers and to provide self-service capabilities for non-technical groups\nWhat we like to use: Vue, Typescript, trunk-based development, AWS CDK, TEMPLE principles for o11y, Serverless (npm), managed AWS services, feature flagging\nHave an interest in AI? We want to hear all about it\n\n \n\n\n\n\nThink you have what it takes to be our Full-Stack Developer? We’re committed to hiring the best talent for the role. Here’s how we’ll know you’ll be successful in the role:\n\nYou have a variety of experience and are driven by getting things done\nYou’re not done learning yet, or maybe ever\nYou understand macro-services, microservices and service monoliths.\nYou add diversity of thought, background, experience, and skill\nYou bring your whole self to the team, or are learning how to\nYou thrive in a unique, collaborative, high energy environment, and actively build trust\nAccountability, integrity, and respect for people’s ideas and time",
      "easy_apply": true,
      "posted_date": "9 hours ago",
      "scraped_at": "2025-12-08T18:09:20.203567-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 95,
      "cloud_support_fit": 65,
      "sharepoint_support_fit": 10,
      "application_support_fit": 70
    }
  },
  {
    "id": 2,
    "job": {
      "title": "Full Stack Developer",
      "company": "Insight Global",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326159646",
      "url": "https://www.linkedin.com/jobs/view/4326159646/?alternateChannel=search&eBP=CwEAAAGbAALlA8HuJSGzZJBeIRmTKflhz8Ip6AabXiwQVBkDi9VKuZ9z-yTw_50FXA7zS7hKjcgLYQ9S1BzJqsmHxAsI0VhjsOYGl7d3Gbxi7W1iy4LxyhSSvCLmjyUrmxG8oVb6p3NCuAVtqaD1uCvT5vte6N4tqA2Qz3btglTZPc7qYEEE3A8IjyAekOYCOvpcrQA7CQK7t_QgI6F7kKO7eZvkzlCRYJ5f0qWEsAuXrzhNAhvQ6CZz3lteDaH3Dayz3e_3SNGisneUor9a8sdItxn7pMl-agCmujmDIA-nyPr02O4pompJ2N_k8DkQxpcRNajEu7BzMFLchMbEsVyKeGxXhSaO8cAGuB1Nq8_jaxkIEE35gHcxQZRGV7TvC_df-iHAPi8zRWsnbhzR5ZD2b-RXh58WmoO0WBgjw6xqr_qwZUEPPInhzhkkP9GI0OOJ1SG0Ep7VsMkOIgX26ip-0ov_3Zmpd9embYXcXlK4_72ZFtQVzQQhHQkWoIirpwdMoKio&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=7%2FKpAOlAQk5LtJ9G%2BcNRVQ%3D%3D",
      "description": "About the job\n\nJOB DESCRIPTION\n\nInsight Global is seeking a Full Stack Developer to join a global SaaS company, at their Toronto office (5 days/week onsite). This is a high-impact opportunity to be part of a growing team. In this role, you will work closely on updating, enhancing, and developing customer facing products. This role involves working closely with the Customer Success team to support two core product pillars: brand management and marketing compliance, including co-op fund management and creative automation tools. In this role, you will triaging and resolving complex product issues, building internal tools, and contributing to product improvements. You’ll work across the full stack, support production systems, and help shape regional support strategy. This is a great opportunity for a technically strong, service-oriented developer who thrives in collaborative, fast-paced environments.\n\n\n\n\nREQUIRED SKILLS AND EXPERIENCE\n\n3+ years of experience as a full stack experience\nPrecious experience working in a support role\nStrong proficiency in React \nStrong proficiency in Node \nProven ability to debug and resolve issues across frontend and backend systems\nExperience writing and deploying patches, hotfixes, or small enhancements \nStrong communication skills - able to explain technical issues to both technical and non-technical stakeholders \nComfortable working onsite in Toronto, 5 days/week\n\n \n\nNICE TO HAVE SKILLS AND EXPERIENCE\n\nFamiliarity with RESTful APIs, AWS (or other cloud platforms), CI/CD, and Git workflows \nExperience with Ruby on Rails or similar backend frameworks \nExperience with observability tools like Sentry, New Relic, or similar - Exposure to Python, GraphQL, feature flagging, and admin tooling \nExperience in technical customer-facing roles (e.g., support engineering, technical account management) \nBackground in SaaS products related to marketing, compliance, or brand management \nAbility to analyze support trends and propose systemic improvements \nInterest in growing into a leadership role as the team scales",
      "easy_apply": true,
      "posted_date": "7 hours ago",
      "scraped_at": "2025-12-08T18:09:27.329839-04:00"
    },
    "job_category": "cloud_support",
    "fit_scores": {
      "sde_fit": 80,
      "cloud_support_fit": 75,
      "sharepoint_support_fit": 10,
      "application_support_fit": 95
    }
  },
  {
    "id": 3,
    "job": {
      "title": "Back End Developer",
      "company": "RemitBee™",
      "location": "Mississauga, ON (On-site)",
      "job_id": "4326179882",
      "url": "https://www.linkedin.com/jobs/view/4326179882/?alternateChannel=search&eBP=CwEAAAGbAALlA2byFrzFAUtiSziLhFNLPxYLyTY-njLtqj5NpO2pyCqXXCXGm0uXssKpiC-fPBqkA3s9a0tmckqBWc8WTprZ0GeQBCvb4sgDvGh3ddSzvkfTqXYVQzLvM8v5AGH_f3xfyYykTHVjd4_aL9b-IMr6-XfVAjG9Nu_p9hCdZ_J4MZYbXcjj2-amHELjCVy4VpZ_rg8JNokf5vZBIbTjpmrL5Wbhg2IrhYodQOIZ_gefpw3sFtP8f27mjZEyC4tIYi-1gvpnGSvYJvHTHsTOZy2d6jjSSDb6akexUYEwTqDXN5HJArIP87lLDOin06uDXpTtdNC2VGwbBw8v7-Z5CxAsP9zCgJLqh8b2aNdQEPzuMuPusvkE1STVZK54-U-x0dxBonVq1q-y62AmlFNWZtNJT3ySatlN9aN2eZsWvGHjUWUYTg_sUb_LgsYLCMKBTwJfYqctED2NCfLZ5dFW93QuoApMQINQFkTG2hIlirEH7_Q2EG8Z7oWrqLt-7Y5Nq8Weag&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=XGJeu47lznxrECXRlUy4Aw%3D%3D",
      "description": "About the job\n\nJOB DESCRIPTION: FULL STACK DEVELOPER\n\nAbout Company: Do you want to work in a fast growing company by doing meaningful work and have fun doing it? Remitbee, a FinTech which is headquarters in Canada is seeking a skilled full stack developer with experience in React and Node JS. Individuals who apply for Remitbee careers should be passionate about tech and driven towards innovating the industry further with the Remitbee team.\n\n \n\n This position also comes with the opportunity for career growth and working hour flexibility. We look forward to reading your application.\n\nJob Type: Full time\n\nExperience: 3+ Years\n\nWhat will you do?\n\n- Work in an agile team of developers, QA, DevOps and founders\n\n - Implement new systems and redesign legacy systems, using leading technologies, to support advancing business requirements\n\n - Research and analyze business and system needs. Explore solution options to recommend designs and technologies\n\n - Writing test cases\n\nSkills and requirements:\n\n- At least 3+ years of experience in backend technologies like Node.js, Express\n\n - Experience with databases and ORM tools such as SQL, MySQL, PostgreSQL, MongoDB, or Sequelize\n\n - Experience in frontend technologies such as React JS, Next JS, Material UI\n\n - Experience with automated task runners such as Grunt or Gulp\n\n - Comfortable applying engineering best practices for Test Driven Development, integration testing, version control, release management, work estimation and planning\n\n - Experience working with APIs (REST, GraphQL, or SOAP)\n\n - You know how to use Git\n\n - You are passionate about code quality. Writing tests and documentation belong to your natural workflow\n\n - Participate in or lead all parts of the software development lifecycle, including analysis, design, programming, testing, implementation, and support\n\n - A history of active contributions to open-source projects (preferred)\n\nCompetencies:\n\n- Strong communication skills\n\n - Self-Motivated\n\n - Willingness to learn new tools and technology and work in a collaborative environment",
      "easy_apply": true,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-08T18:09:31.880674-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 98,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 10,
      "application_support_fit": 45
    }
  },
  {
    "id": 4,
    "job": {
      "title": "Frontend Developer",
      "company": "PEOPLE FORCE CONSULTING INC",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326310609",
      "url": "https://www.linkedin.com/jobs/view/4326310609/?alternateChannel=search&eBP=CwEAAAGbAALlA3irTpxc1NL2joeP_ZvJLIY9TqU3pyb8Kh6dkpXOTQ9pXsM8M6YcMtP3KgA_h9pENeb6SsRyrwVUXSQtScCQRxUh6ipDlgQYDAfj3fGi6F0nZ9sqEtDVsYJpPEQMpYGBZ_Tt4UIvNNQ0kMIqUaB9pXTicwm1BZea7fBjJhHSgMAZcIBNRek8o3O4TKPQpNSzkpFZHyXMlc4LLLSKT4fbch3AodByHbwqKWcYMjNCp77fdqcqkyMbw0jdOLPq3F4YLSnUnkQ2NgZrH-pCy9_ip_QunA97SkpwF_BjqfHtX-Ubyn4ZZUAiUds6h-aMSBOmzTrdS2_3K0gW71_NLCunAZrzLR-yPpl5ZkiDCo1CCsatwGGqpaXIuU4Ifm4jN4LEBRLqYFV7350FaK8jNsGsq9ZTHe5E6BH1Uw7EbDBuaC6osG0P-ePJijWT5_xOaqi5NqYeiQroe36BPKtBNxmZdtrir3f-dvoQFh8y6DS2BIHWzRpaRWCeYrdk-IWsWnc&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=okpZtxhkRyTN96alJR8NAA%3D%3D",
      "description": "About the job\n\nOn behalf of our Financial Services/Banks client, People Force is searching for a Front-End Developer of the role for a contract role. This position is a hybrid position with onsite presence at our client’s Toronto ,On office , 1-2 days per week\n\n\n\n\nFront-End Developer \n\nLocation: Toronto ,On \n\nHybrid : 1-2 days per week in office\n\nContract Duration: 1 year\n\n \n\n\n\n\nRole Overview\n\n\n\n\nWe are seeking a passionate Front-End Developer to join an innovative technology team building digital solutions that empower consumers and businesses across Canada. In this role, you will develop engaging, performant, and accessible web applications, working in a collaborative environment with UX designers, Product Managers, QA engineers, and Backend Developers.\n\n\n\n\nKey Responsibilities\n\nDesign, develop, implement, and maintain front-end web applications using modern frameworks.\nReproduce visual designs from UI/UX teams and collaborate to enhance usability.\nBuild responsive layouts for cross-device compatibility.\nDevelop and maintain applications primarily built in React.\nImplement reusable components and maintain high code quality using automated unit and integration tests.\nParticipate in code reviews, technical design discussions, and architecture decisions.\nWork closely with Engineering, UX, Product, and QA teams to deliver high-quality solutions.\nResearch and adopt new front-end technologies and development standards to improve processes and product performance.\n\n\n\n\nMust-Have Skills\n\nStrong hands-on experience in React development.\nProficient in JavaScript (ES6+), HTML5, CSS3.\nExperience in building responsive layouts across devices.\nProficiency with Git version control, including pull requests, branching, and code reviews.\nExperience working with CI/CD pipelines.\nStrong knowledge of consuming and integrating with REST APIs.\nSolid understanding of UX/UI principles, with a focus on modern browser technologies and consumer-facing products.\nCollaborative mindset and experience working in Agile teams.\n\n\n\n\nIdeal Tech Stack Combination (Nice to Have)\n\nAdditional experience with Vue.js or Angular.\nWorking knowledge of GraphQL for data fetching.\nExperience using Redux for state management.\nExperience with Next.js for server-side rendering.\nFamiliarity with Node.js.\nKnowledge of Babel for JavaScript transpilation.\nExperience with Highcharts or other data visualization libraries.\n\n\n\n\nDiversity, Inclusion, and Equal Opportunity Employment:\n\nAt People Force Consulting Inc, we are committed to fostering diversity, equity, and inclusion. We welcome applicants from all backgrounds, including Indigenous peoples, women, visible minorities, persons with disabilities, and members of 2SLGBTQIA+ communities. If you require any accommodations during the recruitment or interview process, please let us know, we will work with you to ensure an accessible and positive experience.",
      "easy_apply": true,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-08T18:09:35.959997-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 95,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 10,
      "application_support_fit": 45
    }
  },
  {
    "id": 5,
    "job": {
      "title": "Junior Software Developer",
      "company": "Aaron Consulting Inc.",
      "location": "Greater Toronto Area, Canada (Hybrid)",
      "job_id": "4348913169",
      "url": "https://www.linkedin.com/jobs/view/4348913169/?alternateChannel=search&eBP=CwEAAAGbAALlA0WRx3eoHQZ1wb2IgWUPTFHCSFWAEV9ZHDCP_GJdse-uMFPg85mbKonNhVuiwCpwegNZ4N4lGC9c-sniwvLuQa4nYyKLgbHukE2LO1VitFrV3ZOL4wH32mv08G4PddYBFVt1K5-q8V71yNqmKQ8KJ5sLTBQ6lC3ZRTZTEkbCkaNilhW6_hOzrAma1JOfb675pwhoVPdrBYKV7D-oqv51S6ezxgpKz6mx1bodyWX5QitT9FcMm8VRUoosTRuYq75FcBkA4zd9SU2c_AaPCgljrLB4-B0yitSqMCxS3UHNzf1hUPYp1eHcHoa7iC9IElF6mdFDWqa2wITFz1V7L5pGtvymo580u8XTAiOJFTyCS3dB3CtzUnEj4wksClWJ06yVd_GExYetTJ0EUXhOPPyzT5xKnJMZp3tazgwC4v27IzAB7_FJ-oBsgZIkzd-Ol-oAo4eIBBWweRHR1jbjyHNKwoKJiD39BgqLEWr_vWKJitw4dXMGGZQ-tM4Mp61f8oRWBA&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=b5pmG1Dcvqhjl53Hq9NqVA%3D%3D",
      "description": "About the job\n\n🚀 Hiring: New Grad – Computer Science background\n\n📍 Location: GTA, ON (Hybrid - 3 days onsite)\n\n\n\n\nWe are looking for bright, motivated Computer Science new graduates for a full-time contract opportunity. If you recently graduated or will be graduating soon from one of the following universities, we would love to hear from you:\n\n\n\n\n\n\n\nWhat we’re looking for:\n\n• Hands-on experience with Java or Python, or Front-end stack\n\n• Internship or co-op experience\n\n• Knowledge of AI/ML is a plus\n\n• Strong analytical and problem-solving skills\n\n• Eagerness to learn and grow in a fast-paced environment\n\n• Exposure to cloud platforms (AWS, GCP, Azure)\n\n• Experience with APIs, microservices, or databases (SQL queries)",
      "easy_apply": true,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-08T18:09:39.714598-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 98,
      "cloud_support_fit": 78,
      "sharepoint_support_fit": 55,
      "application_support_fit": 87
    }
  },
  {
    "id": 6,
    "job": {
      "title": "Power Platform Engineer",
      "company": "Tata Consultancy Services",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326237788",
      "url": "https://www.linkedin.com/jobs/view/4326237788/?alternateChannel=search&eBP=CwEAAAGbAALlA2gAYf_qrZmlDacKs8Cn476vJ33PsBalf2XdqhFkY7CVru10ugc5f_D_lB2l71rNg50DuCNMQMSPukFU3hG18J20QKFFXD2l4km2wwKU5gfh7wYg_BVEZQ_HtiEO-rwiY-ZyRoQMeetprvt4lmYkMiXC3O7a6kEiA_P_ziB7dfLlifgyxO8qnbfXDwZuyGsVcbqWvr8eBF1Sx16uXGhacdjK3ivVFUwLS2iO5p6EHU_4jDUwhZkGaaXlKl7sRuOXMY1v0vPXIk_QsIps1ya7VK6JXFK1Jo6KLW0XWccB94vgU-0CNCZcN6kWA758PqcQNAynRBPzi1mrOUXZ3bnlJXniD_QukApfLIM7sycQ5n1PXXNM3QnAPVzY2ZDmthh8HYhfo2yS3IPS5_z5fkUJ6kauCAbk16QhVQNRQZweLHOGdWJzaAWKcne0cmW-dFPOVixbWBAy3brnTMtCZdC-gV-mu8W3rFBPirG1q3ZR3Pa36DMfyev4qjjGyEnGkOA&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=WRvECjC61tlD3NV44zrUew%3D%3D",
      "description": "About the job\n\nInclusion without Exception:\n\n\n\n\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people stories across our workforce and implemented through equitable workplace policies and processes.\n\n\n\n\nAbout TCS:\n\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $ 30 billion in the fiscal year ended March 31, 2025 [BS1] and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\n\n\n\n\nSkills and Responsibilities:\n\n \n\n •Platform engineers design and implement the infrastructure that applications run on.\n\n •This includes ensuring that the platform is scalable and can handle varying workloads without degradation of service.\n\n •They work closely with software developers and other engineering teams to understand application requirements and ensure that the platform supports these needs effectively. Continuous monitoring of system performance is crucial.\n\n •Platform engineers define metrics to track application performance and implement changes to optimize efficiency and reliability.\n\n •They are responsible for creating and managing CICD (Continuous Integration Continuous Deployment) pipelines, which facilitate rapid and reliable software deployment.\n\n •Implementing security protocols to protect sensitive data and ensuring compliance with industry standards is a critical part of their role.\n\n •Platform engineers troubleshoot issues that arise within the platform and provide technical support to development teams, ensuring smooth operations.\n\n •Maintaining comprehensive documentation of platform architecture, processes, and configurations is essential for knowledge sharing and operational continuity.\n\n •They must keep abreast of the latest technologies and industry trends to enhance platform capabilities and maintain competitiveness.\n\n\n\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodations during the recruitment and selection process, please inform Human Resources.\n\n\n\n\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
      "easy_apply": true,
      "posted_date": "2 hours ago",
      "scraped_at": "2025-12-08T18:09:43.948365-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 95,
      "cloud_support_fit": 90,
      "sharepoint_support_fit": 15,
      "application_support_fit": 75
    }
  },
  {
    "id": 7,
    "job": {
      "title": "Software Developer 1",
      "company": "Intuit",
      "location": "Toronto, ON",
      "job_id": "4342626025",
      "url": "https://www.linkedin.com/jobs/view/4342626025/?alternateChannel=search&eBP=CwEAAAGbAALlA4byhqapcsXR86qwk2SLYkd9Tcw4gDiFMLnKcMWd_tVSR7ghK4vuE0niuDr61eh2ZPI72ZEKYIfq6uY2Px6X8dQBEF94UnF35Ao4B0M6P01G0PQvI7YpiayV20bejlFhbLOPrV22Hm-kFGSpSra63prFupzl59DCuIF4iJGdqV1IsqKKtEdVbH7liFtAebs64-Tl5vHN4fVKfz4X_2ndJo5ksJO_VhzZ1WyAzCzWJ-DQmwYNFKSE0oDyqWSBU_rJkIljcuZF9HYwZSfpG4puBKKeQO4Ds7GQ4taDLFdVtTHgNdkIceo_hk6Yf3HnvF9F3Tiue4lt--ALxC9HD7qoPc4ygVyRBdiATIxn_UKBjgjDcUFN5kkfP-34xHQfeNypaC_FT1V7wV54JVw8b4I5ALsfFbdDqwyydueJLhGo5fu8EyvK7Iw9MO8MMKQ0uPVQcRaMQaBYTGQcY6H1o33DaBPYG_rmsR_47ZE1vQTUcaLgF9zA2k3-HYISwjR3&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=bUOFxCbazqOJQBiozYXa0w%3D%3D",
      "description": "About the job\n\nOverview\n\nAs a Software Engineer 1, you will be an integral part of our engineering team, contributing to the design, development, and maintenance of high-quality software solutions. This role is ideal\n\nfor an enthusiastic and talented individual looking to grow their career in a dynamic and innovative environment. You will work closely with experienced engineers, product managers, and other stakeholders to deliver impactful features and improvements.\n\nResponsibilities\n\n\n Participate in the full software development lifecycle, including requirements gathering, design, coding, testing, and deployment.\n Write clean, efficient, and well-documented code in accordance with established coding standards.\n Collaborate with team members to troubleshoot and resolve software defects and issues.\n Contribute to code reviews, providing constructive feedback and learning from peers.\n Learn and apply new technologies and development methodologies as needed.\n Assist in the creation and maintenance of technical documentation.\n Actively participate in team meetings and discussions, sharing ideas and insights.\n\n\nQualifications\n\n\n Bachelor's degree in Computer Science, Software Engineering, or a related field.\n Strong foundational understanding of computer science principles, including data structures, algorithms, and object-oriented programming.\n Proficiency in at least one programming language (e.g., Java, Python, C++, JavaScript).\n Familiarity with software development tools and version control systems (e.g., Git).\n Excellent problem-solving and analytical skills.\n Strong communication and interpersonal skills, with the ability to work effectively in a team environment.\n Eagerness to learn and adapt to new challenges and technologies.\n\n\nPreferred Qualifications\n\n\n Internship experience in software development.\n Experience with agile development methodologies.\n Familiarity with cloud platforms (e.g., AWS, Azure, GCP).\n Understanding of database concepts and SQL.\n\n\nIntuit provides a competitive compensation package with a strong pay for performance rewards approach. This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits). Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing fair pay for employees, Intuit conducts regular comparisons across categories of ethnicity and gender. The expected base pay range for this position is:",
      "easy_apply": false,
      "posted_date": "1 minute ago",
      "scraped_at": "2025-12-08T18:09:47.984659-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 98,
      "cloud_support_fit": 40,
      "sharepoint_support_fit": 10,
      "application_support_fit": 65
    }
  },
  {
    "id": 8,
    "job": {
      "title": "ServiceNow Developer",
      "company": "Apex Systems",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326380149",
      "url": "https://www.linkedin.com/jobs/view/4326380149/?alternateChannel=search&eBP=CwEAAAGbAALlA_f_LSu940_DdtvAE1-aOxmDl7UmXxLqMdquPsV0DqfJbpQXP0TvkojMuJkVj-wbM7ZNDega-Q3dD-hbNmp8VW0afFxEFvE8wkbX2Ga3nc51miV97MRIQS8wXk1SlXU7500luQHV1ZSf8YZPGPZpDbByQumDE7GrtvEcq08bXu5keUJ4uhefF_ZTn-qkFhFUgnidpdmaTp2xmm7FRuK7bCOpeLgZjx3lKKQvdL9xA6ZoKM9EfEbtmgJxlUcGSmdvAmBPaaDl8R-G38wwlyU6mpfBMZ2XHX2wXeuDaXd_i-SkImM2jwQM-4ypKtvF1GCdrBFwNwEj_QoGu9PGj6m6oxPDpbuYtG-A-5IBDliaCgjI4h4dwPpAEHWologdHcOG_Gq24F4l4kfXRsRxX-nXX0YKsnyNLX63Am9nC9piK6xO5zT5C6AyT5dxo1AvZl1dZFqNM61ZZ60jZsDQPleYNzg&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=c8W%2BxcEIKJFtxdpoS2yB7g%3D%3D",
      "description": "About the job\n\nServiceNow Developer\n\n\n\n\nApex Systems is a global IT services provider, and our staffing practice has an opening for a ServiceNow Developer to place at our client, a top Canadian Bank.\n\n \n\nClient: A top Canadian Bank \n\nTerms: 6 months, with possibility to extend\n\nLocation Hybrid- Downtown Toronto- 1 day a week\n\n\n\n\nJob Overview:\n\nYou’ll be joining the bank’s ServiceNow Development team in ESMA to foster ideation and impact our digital and agile transformation by enhancing our clients’ banking experience. As a ServiceNow Developer, you’ll be responsible for the technical design, development and integration of cross-functional, multi-platform application systems.\n\n \n\nKey Responsibilities:\n\nCollaborative Development- Contribute to the agile team goals by collaborating with other functional teams, actively participating in Scrum ceremonies and expanding the technical capabilities of the team. Lead the design and development of cost-effective and innovative solutions to meet business objectives while also maintaining existing applications.\nProgramming Ability- Perform and coordinate complex application programming activities within the Scrum team such as developing specifications, coding, testing, debugging, adjusting and documenting in order to ensure successful implementation and maintenance of programs. Design the application's technical infrastructure through specific databases, programming languages, utilities and Test Driven Development (TDD).\nLead & Influence- Lead code-review sessions and ensure overall code quality aligns with business and project requirements. Monitor production and user acceptance testing support to troubleshoot complex problems on applications and technologies. Assist in the transformation from Waterfall to Agile methodologies/practices.\n\n \n\nTechnical Expertise:\n\nYou can demonstrate experience of 4+ years in development, with a focus in developing custom applications within ServiceNow. You have exposure to the following ServiceNow modules: ITSM, ITAM, ITBM, ITOM. You have experience with Service Catalog and Service Portals, as well as building out API integrations and case exchange. You have experience using ITIL best practices in ServiceNow with a focus on ITSM solutions. You have previous experience and knowledge of working within an Agile environment. You have strong verbal and written communication skills, the ability to effectively problem solve, work effectively as part of a team and independently, and have a strong customer service mindset.\n\n\n\n\n\n\n\nPreferred Qualifications:\n\nSNOW Development skills:\n\nGood knowledge and understanding of ServiceNow design and workflows, a JavaScript development background, exposure to MID servers and an understanding of Cloud Services. You hold the following certifications: ITIL, ServiceNow Certified Implementation Specialist and Certified Developer;\n\n\n\n\nyou have these core skills and have hands on experience in these SNOW areas:\n\n- Platform upgrade activities\n\n- MID servers installation/troubleshooting\n\n- Integrations REST/SOAP/Scripted web service\n\n- PowerShell scripting/Developing Ansible playbooks\n\n- CMDB/Discovery\n\n- Service Portal, VA designer\n\n- ITAM\n\n- CSDM\n\n- Strong coding skills\n\n\n\n\n\n\n\nAdded skills:\n\nIt would be considered a strong asset if you have exposure to\n\nThe Automation Developer skills:\n\n\n\n\n- Powershell Commands and scripting\n\n- MID server capabilities using automation\n\n- Orchestration and Integration hub\n\n- Ansible automation\n\n- DevOps tools integration in ServiceNow, CI/CD pipelines\n\n- Flow designer\n\n- APIM\n\n\n\n\nIf you are not a 99% match to the above, and want to be considered for other opportunities at our enterprise clients, register for our Talent Network where you can receive job alerts about new opportunities that match your interests.\n\nClick here to Register for our Talent Network \n\n\n\n\nEEO Employer\n\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystemsinc.com or 844-463-6178.",
      "easy_apply": true,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-08T18:09:51.238430-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 65,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 25,
      "application_support_fit": 75
    }
  },
  {
    "id": 9,
    "job": {
      "title": "Java Developer",
      "company": "Tata Consultancy Services",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326199454",
      "url": "https://www.linkedin.com/jobs/view/4326199454/?alternateChannel=search&eBP=CwEAAAGbAALlAzmNWnO_Vi6CC6uPh6r40wzzitpC0BI6BYU3XdZMIgdCMxlzM4DnzmdXpVnhHuEB0QZQshIh-1rcHVBW-6na0vtfh3473b5MVreGaIOmnAX6IqKo4lEAsCUOjVFSnVHlNP6e8J5bQl4l7ws8XaLzb_w9plLPggID2MRhd_DUKx81hOKIqE2FSuCq95YJ-jHSlVUK_qGkGlEffXNEo4fNP9iAdYMKKWLH3u-wpwWV06V-bxtpCArSQ1ffitHSZGf-x7YuLgi5g1WxtUejgwO9NZaHFvTipLLxhKfHmKfSxsoO5KLb2y-mBJYwr1WFDHALVAjZ5F-BoqbTNOgvtYpGnpixnS98W-7XlLNeC-Q2qdlaC7bq8uAJm-5RQaqNxNLA-3cWAfGyzF221k6q_asTW8O5aXQAopmqQ653W_nn6FTIGRq3Qj7n8z_OfRWABJlsEna1exVj744OTBBMBzdPg9I&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=Wx0mVqFamSzIzVYK%2B7qOmw%3D%3D",
      "description": "About the job\n\nInclusion without Exception:\n\n\n\n\nTata Consultancy Services (TCS) is an equal opportunity employer, and embraces diversity in race, nationality, ethnicity, gender, age, physical ability, neurodiversity, and sexual orientation, to create a workforce that reflects the societies we operate in. Our continued commitment to Culture and Diversity is reflected in our people stories across our workforce and implemented through equitable workplace policies and processes.\n\n\n\n\nAbout TCS:\n\nTCS is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for over 55 years. Its consulting-led, cognitive-powered portfolio of business, technology, and engineering services and solutions is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development. A part of the Tata group, India's largest multinational business group, TCS operates in 55 countries and employs over 607,000 highly skilled individuals, including more than 10,000 in Canada. The company generated consolidated revenues of US $ 30 billion in the fiscal year ended March 31, 2025 [BS1] and is listed on the BSE and the NSE in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index.\n\n\n\n\nSkills and Responsibilities:\n\n \n\n •A Java Developer is responsible for designing, developing, testing, and maintaining applications using the Java programming language. \n\n •Key duties include writing efficient code, collaborating with other teams, troubleshooting bugs, and ensuring applications are scalable and performant. \n\n •They often work with frameworks like Spring, develop REST APIs, and may specialize in web, desktop, mobile, or enterprise-level systems\n\n\n\n\nTata Consultancy Services Canada Inc. is committed to meeting the accessibility needs of all individuals in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code (OHRC). Should you require accommodations during the recruitment and selection process, please inform Human Resources.\n\n\n\n\nThank you for your interest in TCS. Candidates that meet the qualifications for this position will be contacted within a 2-week period. We invite you to continue to apply for other opportunities that match your profile.",
      "easy_apply": true,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-08T18:09:54.742051-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 95,
      "cloud_support_fit": 20,
      "sharepoint_support_fit": 5,
      "application_support_fit": 15
    }
  },
  {
    "id": 10,
    "job": {
      "title": "Junior App Developer",
      "company": "Method CRM",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4342674534",
      "url": "https://www.linkedin.com/jobs/view/4342674534/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=F7Hi0stAvgW8z%2FDY1NjxAA%3D%3D",
      "description": "About the job\n\nOpportunity\n\nOur Product and Development teams are growing, and we’re looking for a Junior App Developer who is passionate about delivering exceptional user experiences and building impactful applications. This role blends the technical depth of software development with the creative flexibility of no-code platforms, offering a unique opportunity for growth and skill development.\n\nAbout Method\n\nMethod is on a mission to transform how small businesses operate by giving them real control over their customer workflows. Our flagship product, Method CRM is purpose-built for small businesses that have outgrown spreadsheets and generic tools. With deep QuickBooks integration and a powerful no-code customization engine, Method enables users to design workflows that truly fit their unique needs. As a scaling growth company, we’re now taking that mission further, leveraging AI to develop intelligent agents that assist users in rapidly building and customizing no-code apps. This innovation is at the heart of our next chapter, and we’re looking for people who are excited to build the future of work!\n\nThe Role \n\nAs a Junior App Developer, you will work closely with Product Managers, Designers, and Senior Developers to build and maintain applications using Method’s no-code platform as well as traditional development tools.\n\nKey Responsibilities\n\n\nBuild, iterate, and maintain SaaS applications using Method’s no-code development platform.\nTranslate business requirements into technical designs, data models, and actionable tasks.\nDevelop and integrate front-end user interfaces using HTML, CSS, and JavaScript.\nCollaborate in grooming sessions, user research, and solutioning discussions.\nProvide feedback on product development improvements and contribute to feature enhancement ideas.\nContribute to both no-code development and traditional code-based development workflows.\nFollow Agile methodologies such as Scrum or Kanban to ensure timely and effective delivery of features.\nDocument technical designs, processes, and updates thoroughly.\nBe a proactive team player with a commitment to the team’s success.\nParticipate in code reviews and ensure code quality standards are met.\n\n\nWhat You Bring\n\nBefore you read this next section, we want you to know that we know the “ideal candidate” doesn’t exist — everybody has a unique background and skill set. Even if you don’t check every box below, we’d love for you to apply if you’re passionate about creating custom solutions and the opportunity at Method - we are building for the future and growth potential is a priority for us!\n\nTechnical Expertise\n\n\nA solid understanding of object-oriented programming (OOP) and design principles.\nBasic experience with front-end development tools including HTML5, CSS, JavaScript, and JSON.\nExposure to SQL databases and ORM frameworks.\nFamiliarity with APIs, RESTful services, and integration techniques.\nUnderstanding of Agile methodologies and development workflows (Scrum, Kanban).\nAbility to build and iterate applications using no-code tools.\nProficiency in C# and .NET, with experience using Visual Studio IDE.\nExperience with Git for version control.\nExposure to automated testing tools.\n\n\nSoft Skills\n\n\nStrong analytical and problem-solving abilities.\nEffective communication and teamwork skills.\nA passion for creating engaging and intuitive user experiences.\nAbility to adapt quickly to changing priorities in a fast-paced environment.\nA proactive approach to learning and applying new technologies.\nStrong organizational skills and attention to detail.\n\n\nPreferred Experience\n\n\nCo-op level or higher working experience in production-level application development.\nPost-secondary education in Computer Science, Software Engineering, or equivalent training/experience.\nExposure to application development and/or scripting/lowcode/nocode tooling.\nUnderstanding of software development lifecycle (SDLC) best practices.\nExperience working with tools such as React, AngularJS, or similar frameworks.\n\n\nWhat We Offer\n\n🌐 Flexible hybrid work model – designed to support work-life balance while maintaining strong team collaboration; employees work from our downtown Toronto office 2–3 days per week\n\n🎉 Collaborative and social team culture – work in a supportive environment with regular team events and company-wide celebrations that keep things fun and connected\n\n🚀 Growth-stage company experience – working at a scaling growth company like Method gives you deep insight into how a software company operates. You'll be involved in a wide range of discussions and initiatives, gaining experience that's hard to find in more siloed environments.\n\n📚 Training – You will receive initial and ongoing training on Method’s products, policies and procedures as well as a quarterly professional development budget.\n\n📍Great downtown location – Method is located right in the heart of Toronto’s young and vibrant ‘King West’ technology hub at the corner of Adelaide and Spadina Ave.\n\n🩺 Comprehensive health benefits – inclusive of healthcare, vision, and dental coverage to support your overall well-being\n\n🥗 Weekly lunch credit – enjoy a meal on us every week as a small way to say thanks\n\nWhat To Expect In Your First 90 Days\n\n\nOnboard and acclimate with the Product and Development team.\nComplete Method’s Bootcamp.\nUnderstand Method’s values and how our teams collaborate to drive results.\nLearn and become an expert of our internal communication tools, norms, and practices.\nBecome acquainted with our No-code platform via help docs and videos.\nStart working closely with your development, design and product team.\nContribute to the product team's culture, processes, and best practices.\nWork on features and functionality that will be used by our users.\nBe fully embedded into and contribute to the outcomes with your team.\nShip features that deliver high business impact.\nWork closely with your manager to explore goals for the rest of the year.\nParticipate in your first quarterly performance review. \n\n\nCompensation: $50,000 - $70,000 per annum.\n\nAt Method, we believe in a thoughtful and human approach to hiring. Every application is reviewed by a real person, never AI, because we know your experience, potential, and personality can’t be measured by an algorithm. We take the time to get to know each qualified candidate and appreciate the effort you put into applying.\n\nThis is an active role we’re currently looking to fill, and we thank all applicants in advance. Please note that only candidates selected for an interview will be contacted. We kindly ask that you do not call or contact us through agencies.\n\nMethod is an equal opportunity employer for all — regardless of race, colour, ancestry, religion, gender identity, sexual orientation, age, marital status or able-bodiedness. As part of our commitment to be an inclusive and accessible workplace, we’re happy to provide accommodations for candidates taking part in the selection process.",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-08T18:09:57.771334-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 92,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 65,
      "application_support_fit": 55
    }
  },
  {
    "id": 11,
    "job": {
      "title": "Databricks Developer",
      "company": "Synechron",
      "location": "Mississauga, ON (Hybrid)",
      "job_id": "4348980011",
      "url": "https://www.linkedin.com/jobs/view/4348980011/?alternateChannel=search&eBP=CwEAAAGbAALlA5hsNjS4aW1Q3ZewowkEMHNKKBgany5gGeVfzKUV72ZubDqTCDOtOc6NTN08B1B-c6OOPUgvJBlLiRMK3f1Uo-ORdfGWU-LJK5tjEHTk-gyqaJrm1Zyjl2Tu05ewQVbT5XiKzovcmCrAGSAZz0HdSo6CBxQK1puK5gqK433cbmqv2eS4_vdl8xBRsttipUI7H4xJRz_n750QevMbyvrdQIFUDSR0M-jnni2bHlG4TQHEMF0tmkQDFuPmGHJun5cI_R4lYihsAbVVy5VGLU7RZlSEOGVOTmdT1EsbWMh3ofhGQLuNa3Z4rV7MGE2z4BtDE-3roYjJicwicWJVWomvvzVdmabfOH_CuNocmjEp7cIceuBV03CQnK0zIODzJ80LqS651cohnbPKIsR45McNPssSj28ZUe3tGDTcEdpP_FrtFUShwtZyfnCEHB0WE7AFwJe9ox7NqN9tiFdvRKQodIAwKA&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=faFaVCIqB9Qhpgc4P2cj6A%3D%3D",
      "description": "About the job\n\nWe are\n\nAt Synechron, we believe in the power of digital to transform businesses for the better. Our global consulting firm combines creativity and innovative technology to deliver industry-leading digital solutions. Synechron’s progressive technologies and optimization strategies span end-to-end Artificial Intelligence, Consulting, Digital, Cloud & DevOps, Data, and Software Engineering, servicing an array of noteworthy financial services and technology firms. Through research and development initiatives in our FinLabs we develop solutions for modernization, from Artificial Intelligence and Blockchain to Data Science models, Digital Underwriting, mobile-first applications and more. Over the last 20+ years, our company has been honored with multiple employer awards, recognizing our commitment to our talented teams. With top clients to boast about, Synechron has a global workforce of 14,500+, and has 58 offices in 21 countries within key global markets.\n\n\n\n\nOur Challenge:\n\nSynechron is seeking for a talented Databricks Engineer to develop, optimize, and manage scalable data pipelines and analytics solutions on the Databricks platform. The ideal candidate will have strong technical skills in Spark, cloud data lakes, and software engineering best practices to enable efficient data workflows and support advanced analytics and machine learning initiatives.\n\n\n\n\nAdditional Information*\n\nThe base salary for this position will vary based on geography and other factors. In accordance with law, the base salary for this role if filled within Mississauga, Ontario, Canada is CAD $100k – CAD $130k/year & benefits (see below).\n\n\n\n\nThe Role\n\nResponsibilities:\n\nDesign, develop, and maintain scalable data pipelines and ETL workflows utilizing Databricks notebooks, Spark, and Delta Lake.\nOptimize Spark jobs for performance and scalability in a cloud environment.\nCollaborate with data engineers, data scientists, and business teams to translate requirements into scalable data solutions.\nImplement data ingestion processes from various sources and ensure data quality and consistency.\nManage Databricks clusters, workspace environments, and job orchestration.\nDevelop automated deployment and CI/CD pipelines for Databricks notebooks and jobs.\nMonitor, troubleshoot, and resolve issues related to data pipelines and Databricks environments.\nEnsure data security, access controls, and compliance within the platform.\n\n\n\n\nRequirements:\n\nProven experience working with Databricks platform (notebooks, clusters, jobs, and workflows).\nStrong knowledge of Apache Spark (PySpark, Scala, or SQL).\nProficiency in Python and/or Scala for developing Spark applications.\nExperience with Delta Lake for managing data lakes with ACID transactions.\nFamiliarity with cloud platforms like Azure (Azure Databricks), AWS, or GCP.\nSolid understanding of data ingestion, transformation, and storage solutions.\nHands-on experience with data orchestration tools and scheduling (e.g., Airflow, Databricks Jobs, Azure Data Factory).\nKnowledge of version control systems such as Git.\nStrong troubleshooting and performance tuning skills.\nAbility to write clean, efficient, and maintainable code\n\n\n\n\nWe offer:\n\nA multinational organization with 58 offices in 21 countries and the possibility to work abroad.\n15 days (3 weeks) of paid annual leave plus an additional 10 days of personal leave (floating days and sick days).\nA comprehensive insurance plan including medical, dental, vision, life insurance, and long-term disability.\nFlexible hybrid policy.\nRRSP with employer’s contribution up to 4%.\nA higher education certification policy.\nOn-demand Udemy for Business for all Synechron employees with free access to more than 5000 curated courses.\nCoaching opportunities with experienced colleagues from our Financial Innovation Labs (FinLabs) and Center of Excellences (CoE) groups.\nCutting edge projects at the world’s leading tier-one banks, financial institutions and insurance firms.\nA truly diverse, fun-loving and global work culture.\n\n\n\n\nSYNECHRON’S DIVERSITY & INCLUSION STATEMENT\n\nDiversity & Inclusion are fundamental to our culture, and Synechron is proud to be an equal opportunity workplace and is an affirmative action employer. Our Diversity, Equity, and Inclusion (DEI) initiative ‘Same Difference’ is committed to fostering an inclusive culture – promoting equality, diversity and an environment that is respectful to all. We strongly believe that a diverse workforce helps build stronger, successful businesses as a global company. We encourage applicants from across diverse backgrounds, race, ethnicities, religion, age, marital status, gender, sexual orientations, or disabilities to apply. We empower our global workforce by offering flexible workplace arrangements, mentoring, internal mobility, learning and development programs, and more.\n\nAll employment decisions at Synechron are based on business needs, job requirements and individual qualifications, without regard to the applicant’s gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law.",
      "easy_apply": true,
      "posted_date": "55 minutes ago",
      "scraped_at": "2025-12-08T18:10:03.891911-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 75,
      "cloud_support_fit": 45,
      "sharepoint_support_fit": 5,
      "application_support_fit": 55
    }
  },
  {
    "id": 12,
    "job": {
      "title": "DevSecOps Security Engineer, Deloitte Global Technology",
      "company": "Deloitte",
      "location": "Toronto, ON",
      "job_id": "4342674932",
      "url": "https://www.linkedin.com/jobs/view/4342674932/?alternateChannel=search&eBP=CwEAAAGbAALlA_SKK71r26TESiic75CJwYD-iHoRBc57ONCfw3QnRaA5n7Uxo7R_YMqYrj23sjzgOf4FBTghLDwlS8pLiwazvQiEoOd5u6RD6SI39mBZC3JqfFrYf1Ovg1k72E3XGDahLkbnYJUjfiicu0nmC3zQwWM-LYsE6OTciJgGHafd1eaWvwexbrsbAqMNPz4zoaAzNtrY4yw3r33lcp-g-FlFdRZTmbK6E3hK84yE_XiB-0-qVWbOY29elK-IrEnRXagoBKCiyPdGu-09RwWbRN2ft5rQrRPgS_QvKEK8Kc-yb3r_CzwaqJmrSX_zazNK7ytdfxRdnO61RiVWgOAS8wdtg15GTx4nVrqDaIXM61CnMHH7O7__B2aiOW3jySpmpgLjYjHKhrldO8yCZQnwqyXOFTJIofs7IZ0f-c3tARimrvI3eSt4ifx5SD4yo4GLlHN3ysDy2xXoFwWSla5MGgUe-8WMWHDxqSYWmyThWcesVFdqiRYiE1Xr3peWKLpb&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=vCaA415K91iyHDx%2F%2F2ELvg%3D%3D",
      "description": "About the job\n\nJob Type: PermanentWork Model: RemoteReference code: 131477Primary Location: Toronto, ONAll Available Locations: Toronto, ON\n\nOur Purpose\n\nAt Deloitte, our Purpose is to make an impact that matters. We exist to inspire and help our people, organizations, communities, and countries to thrive by building a better future. Our work underpins a prosperous society where people can find meaning and opportunity. It builds consumer and business confidence, empowers organizations to find imaginative ways of deploying capital, enables fair, trusted, and functioning social and economic institutions, and allows our friends, families, and communities to enjoy the quality of life that comes with a sustainable future. And as the largest 100% Canadian-owned and operated professional services firm in our country, we are proud to work alongside our clients to make a positive impact for all Canadians.\n\nBy living our Purpose, we will make an impact that matters.\n\n\nHave many careers in one Firm.\nEnjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness.\nLearn from deep subject matter experts through mentoring and on the job coaching\n\n\n\nDeloitte Global is the engine of the Deloitte network. Our professionals reach across disciplines and borders to develop and lead global initiatives. We deliver strategic programs and services that unite our organization.\n\nWhat will your typical day look like?\n\nYou will focus on creating, implementing and applying Azure policies, DevSecOps, processes and culture. You will provide subject matter expertise on application security and design, leading our engineering teams in building secure software and development along with implementing security controls in an Agile environment\n\nResponsibilities: \n\n\nResearching and recommending Azure policies to strengthen our security posture.\nAdvocates for the application teams Cybersecurity, DevSecOps, and Agile engineering procedures, quality engineering practices and advanced requirement capturing techniques for improving end-to-end secure delivery practices.\nWorks to harden cloud infrastructure from attacks by implementing automated and integrated release cycles incorporated within the Agile Security Software Development Lifecycle’s (SSDL) tools and processes.\nResponsible for day-to-day collaboration with the Cyber team to ensure successful implementation of secure coding practices, and integration of secure application and design processes across Deloitte.\nSupports the Secure Systems Development Lifecycle (SSDLC), including functional and non-functional cybersecurity requirements.\nBuilds Automation to validate security requirements within the CI/CD pipeline.\nApplies secure application principles to the testing and validation of security requirements derived in the SSDLC processes.\nWorks with the application Infrastructure architect to complete security questionaires\nOrganizes and coordinates pen testing as needed\nActs as the Security Champion for the application team \n\n\nAbout The Team\n\nDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.\n\nEnough about us, let’s talk about you\n\nQualifications: \n\n\nMinimum of 4 years of combined experience in software engineering, and DevOps/DevSecOps leveraging Azure policies\nWorking with Secure CI/CD pipelines and ALM tools to automate security requirements validation tasks\nProgramming skills in one or more of the following programming and markup languages: Java, .Net, Terraform, Python, Visual Basic, PowerShell, Bash, C++, C#, Django, JavaScript, HTML, CSS, etc.\nHands-on experience with containerization, orchestration, and Cloud infrastructure management (e.g.,Infrastructure as Code, immutable infrastructure, Configuration as Code)\nKnowledge of Source Code Management concepts (e.g., code lines, branching, merging, integration, versioning)\nExperience producing PoCs (Proof of Concept) to support the development and DevOps teams\nAbility to translate traditional SDLC approach (plan, code, build, test, release, deploy and monitor) to the phases of agile development when writing software to automate security related tasks. \n\n\nTotal Rewards\n\nThe salary range for this position is $69,000 - $114,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.\n\nOur Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. On top of our regular paid vacation days, some examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, firm-wide closures known as \"Deloitte Days\", dedicated days of for learning (known as Development and Innovation Days), flexible work arrangements and a hybrid work structure.\n\nOur promise to our people: Deloitte is where potential comes to life.\n\nBe yourself, and more.\n\nWe are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance.\n\nYou Shape How We Make Impact.\n\nDiverse perspectives and life experiences make us better. Whoever you are and wherever you’re from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute.\n\nBe the leader you want to be \n\nSome guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader.\n\nHave as many careers as you want.\n\nWe are uniquely able to offer you new challenges and roles – and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors.\n\nThe next step is yours\n\nAt Deloitte, we are all about doing business inclusively – that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .\n\nWe encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis).\n\nBy applying to this job you will be assessed against the Deloitte Global Talent Standards. We’ve designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally.\n\nDeloitte Canada has 20 offices with representation across most of the country. We acknowledge that Deloitte offices stand on traditional, treaty, and unceded territories in what is now known as Canada. We recognize that Indigenous Peoples have been the caretakers of this land since time immemorial, nurturing its resources and preserving its natural beauty. We acknowledge this land is still home to many First Nations, Inuit, and Métis Peoples, who continue to maintain their deep connection to the land and its sacred teachings. We humbly acknowledge that we are all Treaty people, and we commit to fostering a relationship of respect, collaboration, and stewardship with Indigenous communities in our shared goal of reconciliation and environmental sustainability.",
      "easy_apply": false,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-08T18:10:06.722735-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 90,
      "cloud_support_fit": 65,
      "sharepoint_support_fit": 10,
      "application_support_fit": 60
    }
  },
  {
    "id": 13,
    "job": {
      "title": "Programmer Analyst II",
      "company": "BGIS",
      "location": "Toronto, ON (Remote)",
      "job_id": "4326300289",
      "url": "https://www.linkedin.com/jobs/view/4326300289/?alternateChannel=search&eBP=CwEAAAGbAALlA5ACiVGKHizrTQlY0ENrA7FkZfbKMbeFTjhvSkBnIBERlhiyKPUPaC1ScKmElR9GnyehQXz-KkYPQMcWzvGwwxPrCqPj98GJE0m2LtNwSb7jWqw3XudzuxslipF4TPscbz7WW71apIj27AO95A27OZPx3UCwGJLfejnUPl3F76qomAg3Bvo-YSo1LzEqHdwRjStVKFlhU3ubThVG90Z1gGEJVVoOz5WsSUiLh_cjHbTd6fI_v6-J1j1XqNPbwmdnLa8kxm9qbHJ6etqhR-GytHawDaILJJgGReT_OwTORx-F1FAPbNmRmHWyzdrBTvxrIyVhYIJB_UFGqrWw2X8ORT5eN588DHCFClgHKSu4rh2zhezWG7YhNNyJBBu-7e8m7shIKDWfM473rrbzY9FqgrwIOyai0auVbT6lTP861BfK9oe98PtIgn9mdZkQrNrSk0FUZz62PxbGz13JjPzRvcGZWcPW8Es2Hnj2&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=0Vv11ElTlStgHL%2BidwcJAA%3D%3D",
      "description": "About the job\n\nJob Description\n\nWho We Are\n\nBGIS is a leading provider of customized facility management and real estate services. With our combined team of over 6,500 globally, we relentlessly focus on enabling innovation through the services we deliver, while actively looking for new opportunities that will enable innovation for our clients’ businesses. Globally, we manage over 320 million square feet of client portfolios across 30,000+ locations in North America, Europe, Middle East, Australia and Asia. Further information is available at www.bgis.com\n\nSummary\n\nThe Programmer Analyst II through the use of technical knowledge of computers and computer languages will identify and solve intermediate programming and technical problems, change production programs in accordance with requested enhancements, and participate in new program development.\n\nKey Duties & Responsibilities\n\n\nDemonstrated ability to work under pressure and complete tasks with minimal supervision.\nGood reading, writing and verbal communication skills.\nMust properly manage client expectations.\nSelf-motivated and quick learner.\nGood knowledge and hands on experience with SQL and PL/SQL.\nGood understanding of relational databases especially Oracle.\nHands on experience with the following computer languages and technologies will be an asset: Oracle Applications Express\n(Apex), JDeveloper, MS Access, Crystal Reports, ASP, VBA, VBScript, Web application development (HTML, XML,\nJavaScript, XSL, AJAX, JSP, Web-services, Java).\nExperience in industrial and commercial property, facility management, operation and accounting knowledge will be a definite asset. \n\n\n\nKnowledge & Skills\n\n\nDemonstrated ability to work under pressure and complete tasks under supervision.\nCommunity college diploma or equivalent training with 3-5\n years of relevant experience\nGood reading, writing and verbal communication skills.\nSelf-motivated and quick learner.\nGood knowledge and demonstrated experience with SQL and PL/SQL.\nBasic understanding of relational databases especially Oracle.\nHands on experience with the following computer languages and technologies will be an asset: Oracle Applications Express Apex), JDeveloper, MS Access, Crystal Reports, ASP, VBA, VBScript, Web application development (HTML, XML,\nJavaScript, XSL, AJAX, JSP, Web-services, Java).\n\n\n\nAt BGIS we believe that diversity and inclusion is a key business driver, such that we never lose sight of its importance as it is woven into the fabric of our organization. We are committed to maintaining a barrier-free recruitment process by providing equal employment opportunities through recruiting and retention of individuals of all backgrounds. We recognize that promoting diversity is an essential component of our continuing pursuit for organizational success!\n\nBGIS is an equal opportunity employer and we welcome you to apply for a position with us! If you require accommodation during the recruitment process, please contact us at askHR . Upon request for accommodation, we will consult with the applicant in question and provide, or arrange for the provision of, a suitable accommodation in a manner that takes into account the applicant’s accessibility needs due to disability.",
      "easy_apply": false,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-08T18:10:13.888006-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 75,
      "cloud_support_fit": 10,
      "sharepoint_support_fit": 10,
      "application_support_fit": 88
    }
  },
  {
    "id": 14,
    "job": {
      "title": "Power Platform Engineer",
      "company": "BULL INFORMATION SYSTEMS LIMITED",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326301660",
      "url": "https://www.linkedin.com/jobs/view/4326301660/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=AV%2FCr3xpb8o8ZTUXZsq8%2BQ%3D%3D&trackingId=J%2FPX6Q7FkQAX22wVTSXhiQ%3D%3D",
      "description": "About the job\n\n• Platform engineers design and implement the infrastructure that applications run on. \n\n • This includes ensuring that the platform is scalable and can handle varying workloads without degradation of service. \n\n • They work closely with software developers and other engineering teams to understand application requirements and ensure that the platform supports these needs effectively. \n\n • Continuous monitoring of system performance is crucial. \n\n • Platform engineers define metrics to track application performance and implement changes to optimize efficiency and reliability. \n\n • They are responsible for creating and managing CICD (Continuous Integration Continuous Deployment) pipelines, which facilitate rapid and reliable software deployment. Implementing security protocols to protect sensitive data and ensuring compliance with industry standards is a critical part of their role. \n\n • Platform engineers troubleshoot issues that arise within the platform and provide technical support to development teams, ensuring smooth operations. \n\n • Maintaining comprehensive documentation of platform architecture, processes, and configurations is essential for knowledge sharing and operational continuity. \n\n • They must keep abreast of the latest technologies and industry trends to enhance platform capabilities and maintain competitiveness.",
      "easy_apply": true,
      "posted_date": "47 minutes ago",
      "scraped_at": "2025-12-08T18:10:19.664566-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 88,
      "cloud_support_fit": 95,
      "sharepoint_support_fit": 10,
      "application_support_fit": 85
    }
  },
  {
    "id": 15,
    "job": {
      "title": "Java Application Developer",
      "company": "CIBC",
      "location": "Toronto, ON",
      "job_id": "4342605231",
      "url": "https://www.linkedin.com/jobs/view/4342605231/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=y6IaTDYDs30fvH4nYt7BVg%3D%3D&trackingId=qfR0DYinAKHXmHnOJz%2FaIg%3D%3D",
      "description": "About the job\n\nWe’re building a relationship-oriented bank for the modern world. We need talented, passionate professionals who are dedicated to doing what’s right for our clients.\n\nAt CIBC, we embrace your strengths and your ambitions, so you are empowered at work. Our team members have what they need to make a meaningful impact and are truly valued for who they are and what they contribute.\n\nTo learn more about CIBC, please visit CIBC.com\n\nWhat You'll Be Doing\n\nYou’ll be joining CIBC’s Capital Markets Technology, Global Derivatives & FICC, Application Development group. You’ll be at the heart of CIBC’s digital transformation, successfully delivering complex, enterprise-scale mobile projects involving multiple back-end systems. As an Application Consultant, you’ll assemble, implement and maintain easy, flexible, and personalized solutions that enhance the client experience across both iOS and Android. You’ll lead the planning and strategy for the technical design, development and integration of these applications.\n\nAt CIBC we enable the work environment most optimal for you to thrive in your role. Details on your work arrangement (proportion of on-site and remote work) will be discussed at the time of your interview\n\nHow You'll Succeed\n\n\nDesign and development - Perform and coordinate complicated application programming activities. Design the application's technical infrastructure using specific databases, programming languages, utilities, and testing approaches. Lead the design and development of cost-effective and innovative solutions. \nProgramming Skills - Develop code and test computer programs for straightforward assignments. Review, analyze, and modify programming systems, including coding, testing, and debugging.\nPlanning and Coordination - Effectively interact with team members, end users, business analysts, and technical resources to gather requirements and prepare design specifications as instructed by senior team members.\n\n\nWho You Are\n\n\nYou can demonstrate experience of 4+ years working Java software development. Hands-on experience with Linux microservices and SQL/NoSQL databases. You have Message Bus Experience (IBM MQ /RabbitMQ / Kafka / Solace). Experience with REST API and GIT. It is an asset if you worked with Quarkus or any GraalVM based framework. Experience with Oracle database and Mongo DB. Experience with Kubernetes (Docker / Podman / Helm). Exposure to OpenShift (or Azure Kubernetes Service, etc.)\nYou embrace and advocate change. You'll continuously evolve your thinking and the way you work in order to deliver your best.\nYour influence makes a difference. You know that relationships and networks are essential to success. You inspire outcomes by sharing your expertise.\nYou’re digitally savvy. You seek out innovative solutions and embrace evolving technologies. You can easily adapt to new tools and trends.\nYou're motivated by collective success. You know that teamwork can transform a good idea into a great one. You know that an inclusive team that enjoys working together can bring a vision to life.\nValues matter to you. You bring your real self to work and you live our values - trust, teamwork, and accountability.\n\n\nWhat CIBC Offers\n\nAt CIBC, your goals are a priority. We start with your strengths and ambitions as an employee and strive to create opportunities to tap into your potential. We aspire to give you a career, rather than just a paycheck.\n\n\nWe work to recognize you in meaningful, personalized ways including a competitive salary, incentive pay, banking benefits, a benefits program*, defined benefit pension plan*, an employee share purchase plan, a vacation offering, wellbeing support, and MomentMakers, our social, points-based recognition program.\nOur spaces and technological toolkit will make it simple to bring together great minds to create innovative solutions that make a difference for our clients.\nWe cultivate a culture where you can express your ambition through initiatives like Purpose Day; a paid day off dedicated for you to use to invest in your growth and development.\nSubject to plan and program terms and conditions\n\n\nWhat You Need To Know\n\n\nCIBC is committed to creating an inclusive environment where all team members and clients feel like they belong. We seek applicants with a wide range of abilities and we provide an accessible candidate experience. If you need accommodation, please contact Mailbox.careers-carrieres@cibc.com\nCIBC is committed to clarity in our hiring process. All roles posted are opportunities we’re actively recruiting for, unless stated otherwise.\nYou need to be legally eligible to work at the location(s) specified above and, where applicable, must have a valid work or study permit.\nWe may ask you to complete an attribute-based assessment and other skills test (such as simulation, coding, French proficiency). \nWe use artificial intelligence tools during the recruitment process. Our goal for the application process is to get to know more about you, all that you have to offer, and give you the opportunity to learn more about us. \n\n\nJob Location\n\nToronto-81 Bay, 18th Floor\n\nEmployment Type\n\nRegular\n\nWeekly Hours\n\n37.5\n\nSkills\n\nAnalytical Thinking, Application Development, Applications Programming, Emerging Technologies, IT Strategic Planning, Mentoring Staff, Project Management Technology, Work Collaboratively",
      "easy_apply": false,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-08T18:10:35.827112-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 78,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 15,
      "application_support_fit": 45
    }
  },
  {
    "id": 16,
    "job": {
      "title": "AI Platform Engineer",
      "company": "Denvr",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326360840",
      "url": "https://www.linkedin.com/jobs/view/4326360840/?alternateChannel=search&eBP=CwEAAAGbAAQCjfO1pRnx4eEHC-TjD-A4w2QbghFT5B7MjZl23ov2oVEz8-d0UBvIH30mpAVK2v6T4naY99wQwdI7YM4VopAHTs7lQbsmZHq4C0GNfd_6LGXyrg1wImhZHUz_zJKkWh4FaTg2KaWGo88MQONwImsB7kqtkmDO3dn5_lEl1IfN-nbEfKecU8T61HyfhAdO1YJukV0uXSX7x__QpCzdZ4CgQR4pvMfml7ugxgrV-E8PV-ny22vI_ms3A0DBjl-Q5Yrb50TMzbmTFyhZ1txVAoLxKsH5vfE89FZgg1ChzkH23iFA-ira9__D_NTWM06bh-fB029c_C3fsnS-t3oa5v2dnWwniiQILlgVaOwbqCXv8sh7c0aSSuLLtuLicfxt5xdMy40nHzwjf66dVqLtHTI8yD0aDIDyMIMfhI3qLo4_hZvci0Wkms839_zwF4bxYlpb0tYz_5nIHhtpv9MogmyHWVjYDbcwHIl6qmIYScDICnlVXYQEdJ4O4OknIs2Z&refId=y6IaTDYDs30fvH4nYt7BVg%3D%3D&trackingId=2x%2B9PItP9tyXnG6JzALIzQ%3D%3D",
      "description": "About the job\n\nWho We Are\n\nDenvr is a vertically integrated AI Platform Services company with headquarters in Calgary, Canada. We provide foundational compute infrastructure and services to support the broader AI ecosystem and its end users. The platform includes cloud-native solutions for training, inference, high-performance computing, data processing, scalable storage, and a suite of software toolsets that accelerate the development, deployment, and integration of AI applications.\n\n\n\n\nThese capabilities are accessible via the public Denvr AI Cloud or through Private AI Platform Services, which offer fully dedicated, sovereign environments with enhanced security. Private deployments incorporate advanced data centers, optimized compute architectures, high-throughput storage fabrics, and tightly integrated platform operations software—engineered to meet the demands of large-scale, mission-critical AI workloads.\n\n\n\n\nWe design proprietary AI Data Centers powered by our ultra-efficient, modular data centers built for hyper-scale AI deployments.\n\n\n\n\nAt Denvr, we’re driven to create exceptional customer experiences that empower AI innovators, entrepreneurs, and enterprises to achieve real results. Our mission is to help unlock breakthroughs that transform industries, enhance creativity, and shape a better future.\n\n\n\n\nWhy Join Us\n\nJoining Denvr means being part of a world-class team in the fast-moving field of AI and high-performance computing. We value curiosity, collaboration, and continuous learning. Our people are proactive problem solvers who take pride in delivering great results, thrive in open and transparent environments, and enjoy learning by doing.\n\nIf you’re forward-thinking, motivated by innovation, and excited to help drive a rapidly growing business, Denvr is the place to make an impact—and grow your career alongside exceptional teammates.\n\n\n\n\nAbout the Role\n\nAs an AI Platform Engineer, you will play a pivotal role in ensuring the success of our AI Platform design, implementation, and operation. The AI Platform team designs and manages AI compute architectures and software supporting state of the art NVIDIA Blackwell/Hopper/Ampere clusters with InfiniBand and RoCE GPU fabrics. The team additionally tests and manages alternate silicon solutions and network and data fabrics to support Denvr AI Cloud customers. You will collaborate closely with cross-functional teams, namely Product, Data Center Operations, and Customer Support, to deliver exceptional customer products and experiences.\n\n\n\n\nWhat You'll Do\n\n\n\n\nTechnical Responsibilities:\n\nAI & HPC Infrastructure: Architect and optimize high-performance AI Platform solutions for AI training and inferencing, leveraging NVIDIA systems (H200/H200/A100/GH200) and distributed training optimizations (NCCL, RDMA/Infiniband).\nCloud & Virtualization: Administer RKE Kubernetes clusters, including custom operator development (KOPF), CNIs (Kube-OVN), and KubeVirt, alongside managing traditional virtualization (VMware ESXi/vCenter) and bare-metal provisioning (Metal3, Ironic).\nLinux & Systems Engineering: Perform advanced OS management (Ubuntu), including kernel parameter optimization and hardware-level troubleshooting on Supermicro/Dell platforms.\nAdvanced Networking: Manage high-throughput network fabrics using BGP EVPN, SONiC, and leaf/spine topologies, while maintaining network security via firewalls, VPNs, internet gateways, and granular policy management.\nStorage & Data Platforms: Deploy and maintain scalable, high-performance storage fabrics for data-intensive workloads using technologies such as WEKA, Ceph (Rook), Qumulo, and Dell PowerStore.\nSystems Integration: Design and build critical backend APIs and microservices using Python (FastAPI, asyncio, Pydantic) or Golang, including the development of Kubernetes Operators and integration with relational/NoSQL databases.\nAutomation & IaC: Drive infrastructure consistency and repeatability through Terraform, CloudFormation, and Ansible, integrated within robust CI/CD pipelines.\nOperational Excellence: Adherence to change/release management, incident/problem management, documentation standards, cross-team architectural reviews, post-sales L3 support, and customer-facing technical engagement for both public cloud and private platform deployments.\n\n\n\n\nCustomer Interaction:\n\nWork cross-functionally with vendors, engineering, and platform operations to define requirements, document processes, and continuously improve platform reliability and performance.\nSupport business development and customer success teams by providing clear technical guidance, translating complex concepts, and aligning solutions to customer requirements.\nOpportunities to meet directly with customers to design and review complex platform integrations, custom architectures, and workload-optimized AI solutions.\nCollaborate with vendors to evaluate and validate new GPU and ASIC hardware, firmware, and system architectures, providing feedback for integration and improvement.\nProvide L3 engineering support for advanced troubleshooting, root-cause analysis, and performance evaluation across compute, storage, networking, and AI systems.\n\n\n\n\nProfessional Development:\n\nStay up to date with industry trends, attend workshops, seminars, and conferences.\nPursue relevant certifications and continuous learning in cloud, AI/ML infrastructure, networking, storage, and security domains.\nEngage in internal knowledge sharing through documentation, demos, tech talks, and mentorship of peers.\n\n\n\n\nWho You Are\n\n \n\nIndependent and Self-Starter:\n\nAble to operate in a fast-moving, evolving business with strong prioritization toward customer and business value.\nComfortable using AI-assisted development tools to accelerate delivery.\nCollaborates effectively within a broader platform engineering group while owning high-quality execution of assigned work.\n\n\n\n\nEducation and Experience:\n\nPost secondary education in Computer Science, Engineering, Information Technology, or related technical discipline.\n3+yrs experience with AI/ML solutions engineering, cloud infrastructure, or a related field (preferred).\nBackground in software development, system design, or technical consulting is highly valued.\n\n\n\n\nSoft Skills:\n\nExcellent written and verbal communication, with the ability to simplify and explain complex technical concepts.\nStrong customer empathy and discovery skills to uncover real needs and guide solution direction.\nConfident presenter who can engage both technical and non-technical audiences.\nHighly organized, able to manage multiple priorities, and comfortable shifting focus as business needs evolve.\nCreative problem-solver with a structured approach to diagnosing issues and designing solutions.\nStrong sense of ownership, accountability, and alignment with company vision and direction.\n\n\n\n\nIndustry Knowledge:\n\nFamiliarity with AI industry trends, cloud and data center infrastructure, and secure, reliable operations at scale.\nUnderstanding of AI/ML workflows (training, multi-GPU/multi-node scaling, inferencing) and distributed storage fundamentals.\nGeneral awareness of competitive landscape and emerging technologies in AI infrastructure and cloud services.\n\n\n\n\nTeamwork and Collaboration:\n\nEffective collaborator across cross-functional teams including Sales, Marketing, Product, and Engineering.\nComfortable working in customer-facing technical roles where clarity, empathy, and responsiveness are critical.\n\n\n\n\nAnalytical Skills:\n\nStrong analytical mindset for evaluating complex systems and diagnosing issues across compute, storage, and networking.\nAbility to design, articulate, and innovate technical solutions aligned with customer and business requirements.\n\n\n\n\nIf you are passionate about technology, system design and innovative technical solutions, and want to be part of a remote-first forward-thinking company, we would love to hear from you. Click on the link to apply!",
      "easy_apply": false,
      "posted_date": "3 hours ago",
      "scraped_at": "2025-12-08T18:10:46.342111-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 75,
      "cloud_support_fit": 55,
      "sharepoint_support_fit": 10,
      "application_support_fit": 65
    }
  },
  {
    "id": 17,
    "job": {
      "title": "AWS Infrastructure Engineer",
      "company": "Apptoza Inc.",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4348797068",
      "url": "https://www.linkedin.com/jobs/view/4348797068/?alternateChannel=search&eBP=CwEAAAGbAAQCjrPLghZUpUZEv9mcEX8RbAVX_7KkORUEDEZ-zqa02h2dObLqSoujpnGIdb2Xc0u-ogxGzwX0DD_z5wjiA282KE7u7Da1UUArkP3hcfTTad6kVaVqyv_2UpYhio7zfSyPTcnFtOxaM81eWx_bab8cVSPcBKB3W-UWG6wRXHR2eYvbVBvrLBXqrvjww7BsixmgksmiT1PBOOQD9GM3YZ1D3wthsSN3d_uLWuWQEIVxSVU42Vpfg6GzXXTJzvLG6dn4eiHRY87PwJ_JJ-axsJjpuHYRuGFMaNxU7udECKCfoPyjAVkMbJhltmD8f3B1iZDzES0djOdturL63cGPKeqtCiNCkgqNX3nbVVVZsaoOmeNKGngGQ-ipp5ahHPeETE1cHdNGh1wnjI6zNP9mI8g-enLcK41kQ3eof6OzEM2QVctFz3JeWvs1w64VJ66HBbDMfIWVHK-kjO4DYRo4d7_VuoTUnVJP39GCW_a8YPFwOvs7I-rLsGUhApU&refId=y6IaTDYDs30fvH4nYt7BVg%3D%3D&trackingId=joY3XCmbFfuHGLmsoZu5ag%3D%3D",
      "description": "About the job\n\nJob Title: AWS Infrastructure Engineer with CDK Experience\n\nLocation: Toronto, ON (Hybrid)\n\n Duration: Long Term Contract\n\n\n\n\n\n\n\nAs an **AWS Infrastructure Engineer**, you will be responsible for designing, deploying, and managing scalable, reliable, and secure infrastructure using **AWS Cloud Development Kit (CDK)**. You will collaborate with development teams to implement infrastructure as code (IaC) practices, ensuring consistency, efficiency, and scalability in our cloud environments.\n\n \n\nKey Responsibilities\n\n- Design and implement highly available and scalable AWS infrastructure using **AWS CDK** in collaboration with development and DevOps teams.\n\n- Develop and maintain infrastructure as code (IaC) using **AWS CDK (Typescript, Python, Java)** to automate provisioning of AWS resources such as EC2, S3, Lambda, API Gateway, VPC, IAM, RDS, etc.\n\n- Implement and manage CI/CD pipelines for automated deployment and integration using AWS services like CodePipeline, CodeBuild, and third-party tools.\n\n- Create and maintain **CloudFormation stacks** and other IaC templates to automate and streamline the infrastructure management process.\n\n- Develop reusable infrastructure modules and templates for rapid deployment and improved standardization across the organization.\n\n- Provide guidance and expertise to development teams to adopt best practices in deploying and managing cloud infrastructure.\n\n- Perform infrastructure performance monitoring and troubleshooting to ensure high availability, security, and scalability.\n\n- Ensure compliance with security and governance policies while maintaining a cost-effective cloud architecture.\n\n- Stay up-to-date with new AWS features, services, and best practices, and integrate relevant technologies into our existing cloud environment.\n\n- Troubleshoot and resolve cloud infrastructure issues, providing on-call support as needed.\n\n\n\n\nRequired Skills & Qualifications\n\n- Strong experience with **AWS services** (EC2, Lambda, S3, RDS, IAM, CloudFormation, VPC, etc.).\n\n- Proven expertise in **AWS Cloud Development Kit (CDK)** with hands-on experience in designing, implementing, and maintaining infrastructure-as-code.\n\n- Experience with programming languages such as **TypeScript, Python, Java, or similar** for CDK development.\n\n- Deep understanding of **Infrastructure as Code (IaC)** and automation tools.\n\n- Experience designing and deploying highly available, secure, and scalable cloud architectures on AWS.\n\n- Familiarity with **CI/CD** pipelines and tools such as **AWS CodePipeline**, **CodeBuild**, and Jenkins.\n\n- Strong understanding of **security best practices** in the cloud (IAM, KMS, VPC security, etc.).\n\n- Experience with **monitoring** and **logging** in AWS (CloudWatch, CloudTrail, X-Ray, etc.).\n\n- Familiarity with **serverless architectures** using AWS Lambda and related services.\n\n- Experience working in an agile, DevOps-oriented environment.\n\n- Ability to communicate technical concepts to both technical and non-technical stakeholders.\n\n \n\nPreferred Skills\n\n- AWS Certification, such as **AWS Certified Solutions Architect** or **AWS Certified DevOps Engineer**.\n\n- Experience with other **Infrastructure as Code** tools like Terraform.\n\n- Understanding of **Kubernetes** and **ECS/EKS**.\n\n- Familiarity with **Docker** and containerization strategies.\n\n- Experience with **monitoring** and **logging** platforms such as **Prometheus, Grafana, Datadog**, etc.\n\n- Knowledge of **serverless computing** and **AWS SAM**.",
      "easy_apply": true,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-08T18:11:02.275957-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 82,
      "cloud_support_fit": 78,
      "sharepoint_support_fit": 12,
      "application_support_fit": 75
    }
  },
  {
    "id": 18,
    "job": {
      "title": "QE- Python/SQL",
      "company": "Iris Software Inc.",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4348833897",
      "url": "https://www.linkedin.com/jobs/view/4348833897/?alternateChannel=search&eBP=CwEAAAGbAAQCjoEqG1o5GREEQ7g2Y5QWL_XwN3HKz570exOUNmO1wNaXyO5ZpALmmX3_gM9T0uVhMt4aS26TsaX7U7dhGIHdHm6FygXm0J6LTep5InhcSTqB06mFOD5YlnS1QXb3qGeNsML3ASLO-xyv_vCrXjuvwJMcnCd9VRFDHo_jNducVRuGH4M0CjiwJbn4hQ9jbHlZqyMrl1Y14HfHXGGAUq4CpwsrF6kVMJcfMfrGilXWy-1xwrhSyrCn5M4sMqsTxQ3XzR6dg7u4i2QkYOJ_wLVc7mw7xlwBumAeBbC9-deVj2nCo1NXucbGf8QWcMSafcxqmeuR-CC7uh5fmDJSyIO9f-3acTA5qcER4A-Kozp7FzCihj7t131o2DRg3rg_Bsd-g99fTj8fr_ZYrMzyGcMipxWSljsf9ORBmE_Tk3QkDi-79mPzGuTMDa_VmCkqRElAHJejpFjvuBqiGfE93EQCwYwsyFwOoBiJUj_wunpH0uHN0hVKMbfAeL20AOXS&refId=y6IaTDYDs30fvH4nYt7BVg%3D%3D&trackingId=ndcN7sx7S1lHsqjDl0D9Hw%3D%3D",
      "description": "About the job\n\nIris's Fortune 100 direct client is looking for QE- Python/SQL. Please find below Job description and share me your updated resume at Saurav.upadhyay@irissoftware.com .\n\n\n\n\nPosition: QE- Python/SQL\n\nLocation: Toronto ON\n\nSkills: Python Automation, Robot, SQL \n\n\n\n\nResponsibilities\n\nDesign, develop, and maintain automation scripts and tools in Python to validate data flows and business rules across ETL pipelines.\nCreate and execute automated test cases for data extraction, transformation, and loading, ensuring accuracy, completeness, and end to end data integrity.\nDevelop basic to intermediate SQL queries (or learn on the job) for data profiling, reconciliation, and defect analysis across source, staging, and target systems.\nCollaborate with data engineers, developers, and QA to understand data models, mappings, and transformations, and translate them into test scenarios and automation coverage.\nMonitor scheduled ETL jobs, investigate failures, and contribute to root cause analysis and resolution for data quality issues.\nDocument test plans, automated scripts, and test results, and contribute to continuous improvement of test frameworks and best practices.\n\n\n\n\nAbout Iris Software Inc.\n\nWith 4,000+ associates and offices in India, U.S.A. and Canada, Iris Software delivers technology services and solutions that help clients complete fast, far-reaching digital transformations and achieve their business goals. A strategic partner to Fortune 500 and other top companies in financial services and many other industries, Iris provides a value-driven approach - a unique blend of highly-skilled specialists, software engineering expertise, cutting-edge technology, and flexible engagement models. High customer satisfaction has translated into long-standing relationships and preferred-partner status with many of our clients, who rely on our 30+ years of technical and domain expertise to future-proof their enterprises. Associates of Iris work on mission-critical applications supported by a workplace culture that has won numerous awards in the last few years, including Certified Great Place to Work in India; Top 25 GPW in IT & IT-BPM; Ambition Box Best Place to Work, #3 in IT/ITES; and Top Workplace NJ-USA.",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-12-08T18:11:06.160434-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 88,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 5,
      "application_support_fit": 85
    }
  },
  {
    "id": 19,
    "job": {
      "title": "Java Web Developer",
      "company": "Dexian",
      "location": "Mississauga, ON (Hybrid)",
      "job_id": "4326270967",
      "url": "https://www.linkedin.com/jobs/view/4326270967/?alternateChannel=search&eBP=BUDGET_EXHAUSTED_JOB&refId=y6IaTDYDs30fvH4nYt7BVg%3D%3D&trackingId=PkUAOPEh1sDdYiZ2BA33aA%3D%3D",
      "description": "About the job\n\nKindly share your updated resume at your earliest convenience, along with a suitable time for us to connect over a call. \n\nI would appreciate the opportunity to understand your current situation, career goals, and specific preferences regarding your next opportunity.\n\n\n\n\nWe’re Hiring: Full Stack Java Angular Developer\n\nLocation: Mississauga, ON\n\nQualifications:\n\n • Proficiency in programming in Java 8+, Angular for SPA creation.\n\n • Hands on experience of building RESTful APIs using popular frameworks like Spring\n\n • Experience in Oracle , SQL , NoSQL - MongoDB\n\n\n\n\nFeel free to apply on this position or DM me for the role assistance. Also, if this isn’t for you, kindly like or share to help spread the word.",
      "easy_apply": true,
      "posted_date": "8 hours ago",
      "scraped_at": "2025-12-08T18:11:09.830171-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 88,
      "cloud_support_fit": 5,
      "sharepoint_support_fit": 2,
      "application_support_fit": 25
    }
  },
  {
    "id": 20,
    "job": {
      "title": "Software Engineer / AI Enabler - Java or TypeScript - Toronto - 220,000 CAD",
      "company": "Xcede",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326169281",
      "url": "https://www.linkedin.com/jobs/view/4326169281/?alternateChannel=search&eBP=CwEAAAGbAAZPtydMpwKg2nxxGWMreV8qBfK1W3wfWSRK4MdAOm93mCEv8CnkXDwPAhFU75bMMiqbk75fXQM7WZSWEgUqzvrlF5ywgedqyJlkLQYeOI-p23sWszD2EEcvdFjTdyK1B0_7N5Zwsemm2zXm6jmtAqwj8YD5Arv-XWgz993rqExnBLR0-LaMiQhnR09g5QcwwTbEd80aXxnf7WqnbfbyXS32LIe1EmKhJfwON1-tcU3JAbP5i1FNlAXlqpGclOt5r2iL7HKl7oCYAxhXUjnEntrxQITGYvrfZ70wfyfcblgO0H2tuC_l-WJf0O0uYXmyKQHyXLLaMvJo453HlyiDBKazraUxAG-MqZLo6WRNo6Fx-WGWFtW1OIHWntLELghs2ps4jK40EEsaEbmu7Iueq7t79_dW7JwrGm7dp5TEXvfee2rj4N1dwHd40MRGeiCBQSDXAZnspG4jDqRv2kG_m_2O0S0rOXEdtddCMu_mGZfyTJAbch8R3L3dmiwEbCh1&refId=jBiQn0olKLUitjRBC0I28g%3D%3D&trackingId=2EGemNTtd9aKNX%2BGBwsB0Q%3D%3D",
      "description": "About the job\n\nSoftware Engineer / AI Enabler - Java or TypeScript - Toronto - 220,000 CAD\n\nHelp Build the Future of AI-Accelerated Engineering\n\nWe are a leading global e-commerce platform undergoing a major transformation. As AI reshapes how great software is built, we’re creating a new group of engineers who will multiply the impact of entire teams.\nThis role is for hands-on software engineers who love using GenAI tools, shipping real product features, and helping an organisation become truly AI-first.\nNot research.\nNot modelling.\nReal engineering — accelerated by AI.\n\nWhat You’ll Do Build great products, faster\nJoin a product engineering team and contribute directly to customer-facing systems.\nWork across modern stacks such as TypeScript/Node.js/Next.js or Java/Spring Boot, running on AWS/Azure/GCP.\nUse GenAI every day to accelerate design, development, debugging, testing, documentation and operations.\nCreate the tools that scale AI across the organisation\nBuild and evolve AI-powered internal tools (coding assistants, review helpers, documentation agents, testing bots).\nIntegrate APIs like OpenAI, Anthropic, Azure OpenAI, Vertex AI, Claude into real products and workflows.\nAct as an engineering multiplier\nCoach teams on effective GenAI usage — what works, what doesn’t, and how to use AI safely.\nShare patterns, anti-patterns, and best practices across the engineering organisation.\nHelp shape AI-first standards, playbooks and ways of working.\nExperiment, learn, improve\nRun small, data-informed experiments to validate new tools and workflows.\nMeasure the impact and turn successful approaches into repeatable standards.\nWhat You Bring Deep Software Engineering Capability\n5+ years building production systems in large, evolving codebases.\nStrong experience with TypeScript/Node.js/Next.js or Java/Spring Boot.\nSkilled in writing maintainable, well-tested and well-structured backend or full-stack features.\nStrong Applied GenAI Experience You’ve used GenAI in real engineering work — not theory, not research:\n\nDaily usage of tools like GitHub Copilot, Cursor, Codeium, Replit Agent, ChatGPT for coding.\nBuilt features or internal tools using OpenAI/Anthropic/Azure OpenAI/Vertex AI.\nExperience with LLM integration, prompt engineering, RAG, tool/function calling, or AI-powered automation.\nMindset & Influence\nCurious, growth-oriented, comfortable learning in public.\nStrong communicator who can introduce new tools, handle scepticism, and help others level up.\nPragmatic: understands GenAI strengths and limitations, and knows how to apply guardrails (reviews, tests, policies).\nWhy Join Us?\nA highly international engineering organisation with 50+ nationalities.\nModern offices with collaborative spaces, social areas and flexible working environments.\nHybrid flexibility, relocation support, learning budgets, and a culture that encourages experimentation.\nReal influence: your work will shape how hundreds of engineers build software.\nIf you want to help build AI-first engineering at scale, we’d love to speak with you.",
      "easy_apply": true,
      "posted_date": "9 hours ago",
      "scraped_at": "2025-12-08T18:13:24.343798-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 98,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 5,
      "application_support_fit": 25
    }
  },
  {
    "id": 21,
    "job": {
      "title": "SDET",
      "company": "Viva Tech Solutions",
      "location": "Mississauga, ON (Hybrid)",
      "job_id": "4342566271",
      "url": "https://www.linkedin.com/jobs/view/4342566271/?alternateChannel=search&eBP=CwEAAAGbAA5kpa8PHEmZZCW7dWhSWXLfRlq2HYnIbS_BJ_29SQIr0JUHgiEvsnC7jixadkVtcruO8fP3TDsRvn2KdwGzIWkuo01MBJKTdY_NzLsU-VxSR7873p3NG8HYpmXPzU1322BpwClUnzc1FtxYnogDDdxVafOtqjXuuaThHjqdrJ1DlfVunEZZMZTnxnhf9DdcuzPOUYdT7IBqiwXidTotwU4vkhGjcYGwZcwAZLNm5UO80e88jN--ZMNwTwluGFsHhzLJVxzrt9bsd2-xC1053SUQcu3l9nogOFX7sppzmOz6SJrfBZEcEX3mpRaY_qpo97Hdqwm-sD7ry-FSywCkapM_c7yRuHelIEMWpo0RnVyyIPV4UWwsH6WsAs8KOkZey5d-3_-n5Dg2Xu7V-mvP9IDAIv6-hCZ8S33gBQ6fOf3YcVkdwNElU0vxgEztlrFEGis-XRFa4l_Jl7Wv21G7hK68H6peCstA1fQJKzZyB0hcawanVJLq6g&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=jyNTkolO1bUYxvRHHStusw%3D%3D",
      "description": "About the job\n\nSDET with proficiency in :\n\nJava/Advanced Java\nSelenium WebDriver\nTestNG\nMaven\nGit\nREST Assured (API)\nSQL\nCI/CD (Jenkins)\nFramework Development (POM + Utils +)",
      "easy_apply": true,
      "posted_date": "27 minutes ago",
      "scraped_at": "2025-12-08T18:21:54.264572-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 85,
      "cloud_support_fit": 45,
      "sharepoint_support_fit": 10,
      "application_support_fit": 65
    }
  },
  {
    "id": 22,
    "job": {
      "title": "Software Engineer in Test SDET",
      "company": "Yochana",
      "location": "Mississauga, ON (Hybrid)",
      "job_id": "4326391634",
      "url": "https://www.linkedin.com/jobs/view/4326391634/?alternateChannel=search&eBP=CwEAAAGbAA5kpvOSYab92kRGRhxP3q5hoDYL8vLxZ6T1SrnPmEiawdSQh9FLRT5DzNmK3gzKoCeRjQ6ttvbhCZygzQ4snlIKAhJNIQYmfJwsSoL94cB58ixNpqYlTWkM7rbRGM-hcv7HVx1rxkRdufzr78m1sE96tfy1htzFHzoo75Ly9GOoxNJqVx6gpsMXcHG5WbjqIJzCH2ekTsdmOntgK_b3b1xtn6Sqt1RKseMT5e5oTUF3IqiHrUXHK3O1ZTeb2D1jzjqwa9YBIlLyGuzsoALVPY4WQy2zNB9eGW2mUTlU5XKMWItv6iF1h8tfyffZ6r2gYeM2leJXfYDAl17AakeLIDVCvhhR4gGKjToPonDdMcavonjSLp56POHqe2b7mHfiIlfXNzi3yy146Wt06re0d7JvUMFbUsPm8AnPbpR68ojQP1DN80TOWuFGFWu9FeN9fMR1f7MAF9umbPFTQOddaC3hfrL79MQk4DbkpeNb1pABkMFj_zboGXvR&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=djSLAI3dPo0hOaXQH4s6vA%3D%3D",
      "description": "About the job\n\nPosition Name – SDET\n\nType of hiring – Subcon\n\nDuration – contract\n\nLocation – Mississauga, ON (Hybrid)\n\n\n\n\n\n\n\nJob Description:\n\n\n\n\nSDET with proficiency in:\n\nJava/Advanced Java\nSelenium WebDriver\nTestNG\nMaven\nGit\nREST Assured (API)\nSQL\nCI/CD (Jenkins)\nFramework Development (POM + Utils)",
      "easy_apply": true,
      "posted_date": "4 minutes ago",
      "scraped_at": "2025-12-08T18:21:57.996402-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 85,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 10,
      "application_support_fit": 45
    }
  },
  {
    "id": 23,
    "job": {
      "title": "Quality Assurance Automation Engineer",
      "company": "Iris Software Inc.",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326390762",
      "url": "https://www.linkedin.com/jobs/view/4326390762/?alternateChannel=search&eBP=CwEAAAGbAA5kpmTWPgnWWGpUWBMwZMxSYpkbIoN9oQK3wEeDL8N8yE_8Ytdx_1528LymIwuDcZvMxW_2wInTSW-zxcfEONaw0-eetocKOZ8eoUWNM3AdEplf3eTqYRS9-b8DN62DiYcleks6AsbLnzfn2WY_HPJXe5RHnjn3KU_F82GyG32n0GgzzZGndxBpQe1nNpI9ajG5whFo9P6-R0u2Tp_rkr_QZ3fnNgfC9x4oRh0gkGeE0hRY09_CCusZGasP6iYGuO8AXHjt4J0z9aX1Kcmjhzq80emRDi_V-hyyN2wgS27iFqJ4Hip3IBHGsFjCRjobWwstIOcCmA8DhpPteasGG-gbH_Q8nIBFXePEp4x9N4KR5kHen2TJ3vY96WGURyW99YFUrp3-fSDmJozLyIgxRr-j8rcjicXrpmEnkHEgoqqQAzgx5zBbMhAlpSirsFrshyJYqDUT6QrZc35afV7ycfYUKaK_lG4C6h0aEouHj8EAznj8xktlArCgb3Z37zk_fTg&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=36dhmJiZxBjx3COeSb7aig%3D%3D",
      "description": "About the job\n\nHi ,\n\n\n\n\nI hope you're doing well.\n\n\n\n\nWe have a great opportunity with one of IRIS's clients in Ontario Toronto is looking for the Sr Automation Tester with SQL, for Banking Client. Please Share your Resume if you are interested\n\n\n\n\nHybrid , 4 days\n\n\n\n\nSkills\n\nSQL, Should know how to Write Complex SQL Queries\nCore Python\nAPI Testing\nData Testing\nAgile\n\n\n\n\n\n\n\nPlease let me if you would be interested\n\n\n\n\nRajneesh Bhardwaj\n\n\n\n\nIRIS\n\n\n\n\nAbout Iris Software Inc.\n\n\n\n\nIris Software, Inc. is a 25 years old CMMi Level 5 New Jersey based company providing information technology solutions to clients nationwide. Iris has been growing at over 100% annually. In a program sponsored by Price Waterhouse, PNC Bank and Marsh, Iris has been honored for being\n\n\n\n\n- One of New Jersey's Finest 25 companies for the year 2001 and 2002.\n\n\n\n\n- Iris is also ranked 75th among Inc 500 s list",
      "easy_apply": true,
      "posted_date": "3 hours ago",
      "scraped_at": "2025-12-08T18:22:07.029781-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 80,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 15,
      "application_support_fit": 90
    }
  },
  {
    "id": 24,
    "job": {
      "title": "Software QA Analyst",
      "company": "PLATO",
      "location": "Toronto, ON (On-site)",
      "job_id": "4342695485",
      "url": "https://www.linkedin.com/jobs/view/4342695485/?alternateChannel=search&eBP=CwEAAAGbAA5kpsH5s1D76b9VspvY78UhMUokPd6DTzng-Vjja6BTRWnPuCr3RqTbKUliOskvMlLiHZ0DfqccIvY0QTQiSP78WXF2e4zaOoQPexCmlvZrGWd6wV8urwdpz41wU2-zL3Ft1RL-9i9WzRO6wELNQcLPWv29T_4MpvJCNWRho4ltTxtqUUE2ghuummpUMWnLVTpVR_y_igccRjGaY--flcaM9tVVo6s7TlcXhykuZye5jzdd-jKn2A0HGwyyDsT4IHX2P_dS0XNeZ106hgwfDlt3gClVPVfMHHyefRENIMJAzBi1UOuyGKVa6UZl9f9FUi35O6fVYVjJj7YzNhFZ0T86bGJMZHwolRcXcY85n2jaO7CXfl8dJZB7g6KxB3mEci_T-UHnlCxcyfQehnHFGvi0WbEZHpZqmTybmdSpo0e9ilJa_CYrz8c_qbEMwWOpAuAexfo4r-RN2qFTKCP7t6P7GdjmWBNi-p4-ACZfPYJmsS2vcQlfNj4aYnI&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=JDzq92vxPvP7Yt7qNgb7Dg%3D%3D",
      "description": "About the job\n\nPLATO is Canada's only Indigenous-led, Indigenous staffed software testing services firm. We insist on working with quality people who share our passion for quality testing, and have built a team of people who also believe quality is the most important deliverable. Our team of software testing specialists believe that better software leads to a better world.\n\nWe are committed to building strong communities - PLATO trains and employs members of First Nations, Metis, and Inuit communities across the country and strives to build a network of 1000 Indigenous software testers across Canada. PLATO has offices on or near Indigenous communities across Canada, in Fredericton, Miramichi, Sault Ste Marie, Regina, Calgary, Edmonton, Vancouver, and Victoria.\n\nWe are growing in Toronto and are actively seeking junior-to-senior level software testers to support upcoming opportunities. While we may not have immediate openings, we are preparing to move quickly as new contracts are signed or customer needs arise. Preference will be given to those based in the Greater Toronto Area as several roles will require candidates to work at our client site(s) in downtown Toronto.\n\nResponsibilities\n\n\nPerform risk-based and context-driven manual software testing\nConduct testing to align with client test methodologies (Agile, Waterfall, BDD, etc)\nUse Test Management and Defect Tracking Systems (such as Azure DevOps) to document test cases, map requirements, record defects and record test case execution results\nWork/communicate directly with project stakeholders including business and external Vendors and discuss defects, priority of testing activities\nExtract testing requirements from functional / business requirements and transform them to test cases\nWrite detailed test plans, test cases and test status reports\n\n\nQualifications\n\n\nComputer Science degree, Engineering degree, or equivalent work experience\nExperience as a Software Quality Assurance Analyst\nPreference will be given to those with experience in Banking & Finance systems\nExperience working on front-end and back-end web applications\nPreference will be given to those with experience with API testing (SoapUI, Postman, Katalon, etc)\nTest automation experience (Selenium, Tosca, Playwright, Katalon, etc) is an asset\nExperience with Test Management tools such as ADO, ALM/QC, Jira, qTest\nISTQB certification or similar testing certification considered an asset\nAbility to write SQL queries\nExcellent written and spoken communication skills\nDemonstrated experience having tested complex IT solutions\nExperience having performed System Integration testing and UAT support\nExcellent analytical and problem solving skills, with the ability to propose practical solutions to complex problems\nFlexibility, self-motivation and the ability to give and receive feedback at all levels\nAdaptable and willing to work through challenges with a positive attitude\nAbility to work at our client site for 3 days/week in downtown Toronto\n\n\nAbout PLATO\n\nWho We Are\n\nPLATO is a software testing and technology services company trusted by clients around the world.\n\nIn addition to providing our clients the highest quality software testing services, PLATO is creating careers in technology for First Nations, Inuit, and Métis people from coast to coast to coast through our innovative train-and-employ model. Since 1997, we have been helping organizations all over the world reach their quality objectives by delivering scalable, proven, quality-centric managed services. Companies such as Apple, Suncor, TD Bank, Medavie, BCLC, LinkedIn, Boeing, and many others have gained considerable advantage from our Quality Assurance (QA), Testing, and eLearning expertise and experience.\n\nWe deliver specialized QA services to our clients with the goal of helping them increase profitability, boost customer satisfaction, manage development cycles and implement quality-centric solutions. We develop innovative approaches and solutions, designed to generate increased efficiencies, competitive advantage, and market share for our clients.\n\nAre you interested?\n\nAt PLATO, we encourage our employees' personal career growth. We have plans in place to make sure that each employee is connected with a people manager to help guide them through their professional development, offer e-learning classes, and give our employees the opportunity to pursue software certifications for cutting-edge technologies.\n\nPLATO respectfully acknowledges that our offices are located on treaty territories, unceded First Nations and Inuit territories, and part of Métis homelands. We honour their long history of welcoming many Nations to the beautiful Turtle Island and we actively work towards reconciliation between Métis, Inuit, and First Nation peoples and non-Indigenous people on this Land.\n\nWe contribute to proactive employment practices to promote inclusivity and diversity to those especially marginalized populations such as women, persons with disabilities, members of visible minorities, First Nations, Métis, and Inuit peoples, and all other groups protected under the Human Rights Code.\n\nWe are committed to providing accommodations for people with disabilities in accordance with provincial legislation. Please let us know if you require accommodation during any aspect of the recruitment process and we will work with you to address your needs.",
      "easy_apply": false,
      "posted_date": "17 minutes ago",
      "scraped_at": "2025-12-08T18:22:10.748167-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 60,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 25,
      "application_support_fit": 85
    }
  },
  {
    "id": 25,
    "job": {
      "title": "QE Automation Engineer – *Java, Selenium, API, Automation Framework, Agile, CI/CD & Git",
      "company": "Astra-North Infoteck Inc. ~ Conquering today’s challenges, achieving tomorrow’s vision!",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326391123",
      "url": "https://www.linkedin.com/jobs/view/4326391123/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=IAf%2FoT%2FLw%2BZQ0ujV%2BEyIJQ%3D%3D",
      "description": "About the job\n\nIndustry: BFSI\n\n\nRole: QE - Automation (API Testing) - 4 DAYS ONSITE IS MUST\n\nNotes from Manager -\nNeed to close by Dec 12\nDo not submit candidates rejected on 10739-1\nNeed automation framework creation exp\nPlease vet the candidate on 4 days onsite requirement; previously, lot of submitted candidates said no to 4 days onsite in Interviews.\nstrong Java\nstrong API testing\nokay if the candidate is light on devops\n\nRoles & Responsibilities\nDevelop and maintain automated test scripts using Selenium, Java, and API testing frameworks.\nCollaborate with development and QA teams to understand requirements and create comprehensive test plans.\nExecute automated test suites and analyze results to identify issues and ensure quality.\nContinuously improve the automation framework and extend its capabilities.\nParticipate in code reviews and provide feedback to team members.? Document test processes, results, and track issues in a clear and concise manner.\n\nQualifications\nBachelor?s degree in computer science, Information Technology, or a related field.\nProven experience in automation testing with Selenium and Java.\nStrong understanding of API testing and RESTful services.\nFamiliarity with software development lifecycle and agile methodologies.\nExcellent problem-solving skills and attention to detail.\nGood communication and teamwork skills.\n\nMust Have Technical/Functional Skills\nJava\nSelenium\nAPI Testing\nRESTful Services\nTest Automation Frameworks\nAgile Methodologies\nCI/CD Tools\nVersion Control (e.g., Git)\n\n\n\n\n\n\nDesired Skills and Experience\n\nBASEL",
      "easy_apply": true,
      "posted_date": "17 hours ago",
      "scraped_at": "2025-12-08T18:22:14.064504-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 75,
      "cloud_support_fit": 30,
      "sharepoint_support_fit": 15,
      "application_support_fit": 50
    }
  },
  {
    "id": 26,
    "job": {
      "title": "Performance Engineer - DevOps, Garbage Collection",
      "company": "Astra-North Infoteck Inc. ~ Conquering today’s challenges, achieving tomorrow’s vision!",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326351352",
      "url": "https://www.linkedin.com/jobs/view/4326351352/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=O6JH47CXeKkYMgpHdJBORw%3D%3D&trackingId=yDMP5EKFOrZhGGYt%2FH8Ryw%3D%3D",
      "description": "About the job\n\nRequired Skills:\n\n\nDigital : DevOps:Performance Engineering\n\n\n \n\nMust Have:\n\n\nGarbage Collection Analysis\n\n\n \n\nServer/Host Capacity Analysis\n\n\n \n\nUnderstanding of RESTful API design\n\n\n \n\nUnderstanding of DevOps and Agile Methodology\n\n\n \n\nUnderstanding of Three-tier web architecture pattern and Client-Server model\n\n\n \n\nStrong foundation in programming and scripting\n\n\n \n\nShould be able to adapt to and/or learn new programming languages\n\n\n \n\nRole and Responsibility:\n\n\nLead test planning, preparation and execution activities.\n\n\n \n\nAnalyze, develop, debug, execute and maintain complex automated test cases.\n\n\n \n\nBe responsible for all project/ release testing (e.g. integration, business acceptance, performance, operability, deployment verification).\n\n\n \n\nCoordinate testing planning, support with partners (e.g. business, CIO group, Infrastructure).\n\n\n \n\nLead documentation creation, review, sign-off (e.g. test strategies, plans, schedule, cost estimates, test cases, dashboards, defect logs, test phase closure reports, entry/exit criteria and gating).\n\n\n \n\nApply risk analysis methodologies, tools that align with a projects development approach.\n\n\n \n\nPrioritize testing tasks, ensure milestones, activities, tasks are completed as scheduled.\n\n\n \n\nMay create and execute test case creation and execution to ensure team meets timelines.\n\n\n \n\nEnsure testing does not impact the production environment (e.g., file transmission scheduling), meets information security/privacy policies/guidelines.\n\n\n \n\nChair daily defect status calls to ensure prompt, thorough documenting, tracking, testing. report on test planning, execution, defects to project team using standard test quality metrics.\n\n\n \n\nLead relationships with project team, offshore teams, release teams, third-parties, clients.\n\n\n \n\nBuild, maintain test environments. monitor, trouble shoot, triage, resolve issues.\n\n\n \n\nCo-ordinate code deployments, maintenance upgrades and project testing across numerous environments on various technology platforms.\n\n\n \n\nFollow established testing processes, in doing so, identify, assess, address, resolve and/or escalate, develop contingency plans as needed.\n\n\n \n\nParticipate in audit reviews of test artifacts, ensure they meet standards and audit requirements, and are stored in the project site.\n\n\n \n\nParticipate in gate reviews, testing activities and artifacts, ensure they adhere to gating criteria.\n\n\n \n\nCommunicate, address scope changes that may impact testing (timeline, costs, risks).\n\n\n \n\nPromptly identify, notify, escalate, monitor issues, recommend solutions.\n\n\n \n\nTrack financials.\n\n\n \n\nIdentify, track resources needed to cover projects.\n\n\n \n\nUse tools to develop, maintain virtualized services, components, environments.\n\n\n \n\nCoach colleagues and act as a reference for the requirements management life cycle.\n\n\n\n\nDesired Skills and Experience\n\nBASEL",
      "easy_apply": true,
      "posted_date": "17 hours ago",
      "scraped_at": "2025-12-08T18:22:28.076103-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 85,
      "cloud_support_fit": 65,
      "sharepoint_support_fit": 15,
      "application_support_fit": 70
    }
  },
  {
    "id": 27,
    "job": {
      "title": "Application Support Specialist",
      "company": "Insight Global",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326218047",
      "url": "https://www.linkedin.com/jobs/view/4326218047/?alternateChannel=search&eBP=CwEAAAGbAA_jokLXOWC4joITkHoSRZJXsGqKsp3frAVuoiIVlxx8etu5ZobIe428KXSGQ5ncFMQflQFXbRYm1Gs9Ja615i01ypwXxHxkCJy4Ndn-o0Hzt8uFGI2FnUeI975iIF2WTuEkZIxHQqVdl133oPk3nUXxVNMgH7WbNV08PJv0nD1O57GpwAWpUozyvY7MYa6-KppP9RjepT2TOo44t4l6K6H-nlLoHb90SF8P7TQj0DM693xYSnI3bbXPrsCCWKqbkHulYg4P_16s9bE6O1Mn7KrlW5Ug9-ZVh6fCLIAuyvEFnag3xYBfHSrS9CofN8VvR8LGB76u28ehHt17GxjH91ojE3LFdxhXjp4OrUn0mS-x0N4vC1uM2FwhY0Qy-N9wyikFAiIXoSEBPqk3Kd-YwAlAV2igpW5uQvU8JOvE3Bc7f1iGpVlmYr8WHz-9q-gzYrxsUctjprhf4H2i42VMzj4quNuT5CKh5TG09_yAQAwnNok4-TwvklOw4PvK0VLA&refId=v2lVJDil7yWxVnBOFOH73Q%3D%3D&trackingId=fVTN%2FQ1zx3rrtJ9IzKyrAg%3D%3D",
      "description": "About the job\n\nInsight Global is looking for an Application Support Associate for a leading wealth management firm. In this role, you will provide advanced application support by responding to inquiries and resolving complex issues escalated from IT support or business units. You’ll diagnose root causes, implement fixes, and ensure all support tickets are resolved within established SLAs. Responsibilities include researching application functionality, integration points, and connectivity failures, as well as documenting processes and operational procedures in collaboration with vendors. You will assist with user acceptance testing, manage change deployments, and participate in vendor meetings. Additionally, you’ll track and report issues, recommend process improvements, and maintain strong communication to ensure technology enables business operations. This position offers growth opportunities for individuals who are curious, proactive, and detail-oriented.\n\n \n\nMust-haves:\n\n3 years of related financial services or wealth management experience with a strong analytical background \nExperience in system functional testing, defect management and resolution, and using testing tools is an asset. \nAbility to work within deadlines in a high-volume and demanding environment while maintaining a high level of service and an imperative attention to detail \nExperience using business application tools (Jira, ServiceNow, Confluence) and portfolio management \nDemonstrate advanced face-to-face, email, videoconferencing, and telephone etiquette and relationship management skills L3 support of third-party business applications for up to 500 users (Advisors, back office teams etc..)\n\n \n\nPlusses:\n\nDataphile \nEquisoft",
      "easy_apply": true,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-08T18:23:31.372435-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 50,
      "cloud_support_fit": 65,
      "sharepoint_support_fit": 35,
      "application_support_fit": 95
    }
  },
  {
    "id": 28,
    "job": {
      "title": "oADD Website Support Specialist (2)",
      "company": "Audi RED",
      "location": "Toronto, ON (Remote)",
      "job_id": "4348769770",
      "url": "https://www.linkedin.com/jobs/view/4348769770/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=v2lVJDil7yWxVnBOFOH73Q%3D%3D&trackingId=kWQNWza6N2cOQvTYW80U2Q%3D%3D",
      "description": "About the job\n\nWelcome to Audi RED, a new and exciting opportunity to change the way partners work together. Audi RED is an organization founded on a true partnership between BIMM Management Group, a leading Toronto based digital and technology agency, and Audi, the automotive brand shaping the future of premium mobility. \n\nAudi RED aims to be the technology center of North America and eventually the globe for Audi’s digital experience ecosystem. It will be the center of excellence, innovation, design, and delivery. Built upon the foundation of a longstanding partnership, and a commitment to collective growth and success, Audi RED will be the bridge between agency and product, delivering the utmost in customer experience and service design through technologically driven solutions. \n\nWho we’re looking for \n\nWe are happy to be hiring 2 oADD Website Support Specialists! \n \nThe one Audi Digital Dealer (oADD) team is seeking a proactive and detail-oriented Website Support Specialist to provide front-line technical support for live dealership websites on the oADD platform. These websites are built on Adobe Experience Manager (AEM) and include complex integrations such as inventory feeds, and third-party tools. The ideal candidate has strong troubleshooting skills, displays extreme ownership, drives for results, communicates effectively, and has the ability to manage multiple issues efficiently in a fast-paced environment. \n \nThis role is focused on supporting and maintaining live sites, resolving dealer-reported issues, and collaborating with internal teams to ensure a high level of platform performance and customer satisfaction. \n \nResponsibilities \n \nTechnical Support & Troubleshooting\n\nServe as the primary point of contact for dealers reporting website issues through email, phone, or our internal ticketing system. \nParticipate in a phone queue, answering inbound calls from dealers and documenting support requests. \nTroubleshoot a wide range of website-related issues, including AEM configurations, inventory discrepancies, third party issues, and site performance concerns. \nUtilize knowledge of automotive inventory management systems to investigate and resolve issues with vehicle data display, missing inventory, or incorrect pricing and details. \nCollaborate with Tier 2 and development teams to escalate complex technical issues when necessary. \nMaintain accurate documentation of issues, troubleshooting steps, and resolutions within support tickets. \n\nDealer Communication \n\nCommunicate promptly and professionally with dealers regarding technical issues, updates, and next steps. \nSet clear expectations on resolution timelines and provide ongoing status updates. \nEducate dealers on website functionality, inventory handling, and platform best practices. \n\nPlatform Knowledge & Execution \n\nUse Adobe Experience Manager (AEM) to support site structure, content updates, and issue resolution. \nUnderstand how inventory data flows from third-party systems to the website, including mapping logic and feed schedules. \nMaintain working knowledge of DNS settings, call tracking, and third-party integrations that affect site performance. \n\nQuality Assurance & Continuous Improvement \n\nConduct validation and QA checks to ensure technical issues are resolved accurately and thoroughly. \nIdentify recurring support themes and contribute to process improvements, internal documentation, and knowledge base development. \nProvide feedback to improve support workflows, tools, and dealer-facing resources. \n\nRequirements \n\n2+ years of experience in technical support, digital platform operations, or a customer-facing role in a tech environment. \nFamiliarity with automotive inventory management systems (e.g., Homenet, vAuto, Inventory+) and how they integrate with web platforms. \nExperience with content management systems, ideally Adobe Experience Manager (AEM), and a working knowledge of HTML/CSS. \nComfortable handling inbound support calls and working within a phone queue. \nStrong organizational, communication, and problem-solving skills with the ability to prioritize effectively. \nExperience using ticketing systems such as SalesForce or Jira. \n\nWhat’s in it for you? \n\nWork Life Balance: Paid vacation and additional shutdowns around holidays to allow us to reset and recharge so we come back better for our customers. \nBenefits: We offer premium full health benefits so you get the coverage you need, as well as a work from home set up allowance to get you comfy. \nCulture: We’re passionate about working collaboratively, bonding through team events, and most importantly having fun. \nWe’re remote first, but love connecting and collaborating in-office. If you are an in-office creature, enjoy our beautiful dog-friendly office located in the Distillery District, stuffed with snacks. \n\nAudi RED is committed to providing an environment that is inclusive and accessible. We are an equal opportunity employer and considers all applicants for employment without discrimination. Please let us know if accommodation for the recruitment/interview process is required and we will work with you to make sure your needs are met.",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-08T18:23:45.220327-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 45,
      "cloud_support_fit": 35,
      "sharepoint_support_fit": 30,
      "application_support_fit": 85
    }
  },
  {
    "id": 29,
    "job": {
      "title": "技术支持（加拿大）",
      "company": "FJDynamics",
      "location": "Greater Toronto Area, Canada (On-site)",
      "job_id": "4326204349",
      "url": "https://www.linkedin.com/jobs/view/4326204349/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=v2lVJDil7yWxVnBOFOH73Q%3D%3D&trackingId=LWn5foaE2UXyF4bqvgBFlg%3D%3D",
      "description": "About the job\n\n岗位职责：\n\n1、海外产品部署前的需求和场地适应性对接判断，落地部署方案设计和产品售后远程指导、维护支持；\n\n2、客户测试Demo部署等的跟踪支持，产品功能演示支持；\n\n3、海外客户需求和改进建议的搜集、价值传递、问题讲解答疑；\n\n4、针对客户软硬件技术问题和故障排查分析，及时和研发沟通并反馈客户，确保产品正常运行；\n\n5、编写修改维护培训教材，并向销售、经销商、客户等进行产品技能培训传递。\n\n\n\n\n任职要求：\n\n1、通信、自动化等理工科专业背景优先，本科及以上学历；\n\n2、良好的亲和力和沟通能力，英语或小语种可作为工作语言；\n\n3、吃苦耐劳，有团队精神，工作态度积极，有较强的学习能力；\n\n4、有过智能硬件相关行业技术支持经验者优先。",
      "easy_apply": true,
      "posted_date": "20 hours ago",
      "scraped_at": "2025-12-08T18:23:53.568797-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 15,
      "cloud_support_fit": 55,
      "sharepoint_support_fit": 20,
      "application_support_fit": 78
    }
  },
  {
    "id": 30,
    "job": {
      "title": "Business Analyst",
      "company": "Insight Global",
      "location": "Mississauga, ON (Hybrid)",
      "job_id": "4326026421",
      "url": "https://www.linkedin.com/jobs/view/4326026421/?alternateChannel=search&eBP=BUDGET_EXHAUSTED_JOB&refId=v2lVJDil7yWxVnBOFOH73Q%3D%3D&trackingId=DZEjRCTSeiXVob%2F7Ap9BXw%3D%3D",
      "description": "About the job\n\nPermanent \n\nOn-site 3x/week in Mississauga \n\n\n\n\nJOB DESCRIPTION\n\nInsight Global is looking for a Business Analyst to join a leading Courier and Logistics customer in Mississauga. This is a hybrid role and requires the employee to be in office 3x/week. This is a new position within the Corporate Technology team, supporting projects primarily in the growth area across multiple applications. The Business Analyst will play a key role in bridging business needs with technical teams, ensuring requirements are clear, actionable, and aligned with organizational goals. Key Responsibilities ○ Gather, document, and validate functional requirements for multiple projects. ○ Facilitate workshops and meetings with stakeholders to elicit requirements and clarify objectives. ○ Collaborate with Product Leads, Project Managers, QA, and Developers to ensure successful delivery. ○ Support projects through all phases of the SDLC (Agile and Waterfall). ○ Assist in testing cycles, including defect management and validation. ○ Create process diagrams, documentation, and pivot tables using Microsoft tools. ○ Work on SAP change requests (CRs) and coordinate with other teams as needed. ○ Translate business needs into technical specifications for teams working in AWS, SAP S/4HANA, and other platforms.\n\nREQUIRED SKILLS AND EXPERIENCE\n\n○ Strong ability to elicit requirements and manage stakeholder expectations. ○ Knowledge of IT frameworks and SDLC methodologies. ○ Experience with Jira and ServiceNow. ○ Familiarity with SAP S/4HANA and AWS environments. ○ Ability to create diagrams and documentation using Microsoft tools. ○ Experience with functional requirements documentation. ○ Ability to work across multiple technology stacks (AWS, Java, Python exposure is helpful).",
      "easy_apply": true,
      "posted_date": "20 hours ago",
      "scraped_at": "2025-12-08T18:24:14.067142-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 35,
      "cloud_support_fit": 25,
      "sharepoint_support_fit": 20,
      "application_support_fit": 75
    }
  },
  {
    "id": 31,
    "job": {
      "title": "IT Support Specialist",
      "company": "JAM CRM",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4342636128",
      "url": "https://www.linkedin.com/jobs/view/4342636128/?alternateChannel=search&eBP=CwEAAAGbABKYNPAAGuFawuaznyd4h1eTXX5du0gEIeNEb3XNJCUHs0NBo7ViqBFX5lh5VTU49JL5UjQXFHLfyatXD7LCgtdtSVM094SQLMP5l8Xl7jH5l1dyPt6aOHstE9RgyohDJzVkBRoq_SHht_VEPN7tqiI9sFxKRsUYU9fZ_UbpOPdgtAITGjOzmcafYPhzDrkUPnLRwLHvCCCT_IA2U30hY3YM3H8EN5GjgZTMbeiNcYikR0hLQ5c-78GJ5zP9p6M_r5n6o5azwRL0-ryTXsv4bX6yQfjsMOXQX_cFx9CNL1WO7zxDAcqHaDdz1cWCIePXOtDXnqMRpleQm1AP56NJF__S43K9nOygwjQZGex__kd_Xz0oonmDqPTqHqMG4M7IAPxJSMz0lYhCo8CpSCgZomhSvQu9PI8R7mlFLmoCcPG1w9mUfiusdmIpi4YalDghG--Tkjji-FCWeP-ruLGhQ12ou6kULUqvzmBgCbKxiL5_42lOH3_Q6rAA&refId=zBu4LMWetQWG2f9OzZs5Kw%3D%3D&trackingId=sjiYNlwRS9cyrBPgwe4ucQ%3D%3D",
      "description": "About the job\n\nWe are JAM CRM, an award-winning, game-changing, forward-thinking, CRM agency tucked away in trendy Liberty Village. We’re looking for an IT Support Specialist to join our team of over 150 1:1 communication experts who are dedicated to creating incredible work, making our client’s proud, and smashing personal and professional goals along the way. With our creativity, outstanding culture, and cool technology we may just be the best kept marketing secret in Canada.\n\n\n\n\nIn this role, you'll be a key IT team member, providing helpdesk support and managing end-user devices within JAM – a thriving CRM marketing agency with diverse environments including Windows, and macOS. You'll also be in a supporting role within the IT team for system administration tasks and projects.\n\n\n\n\nKey Responsibilities\n\nManage and maintain end-user devices, including mobile device management (MDM) with JAMF and Intune, and monitor for vulnerabilities using vulnerability management tools\nProvide first-level IT support, including troubleshooting hardware and software issues, and supporting daily IT operations for all employees\nUpdate and maintain IT documentation\nAssist in managing server, network, and cloud environments (Windows Server, Linux, AWS/Azure/GCP)\n\n\n\n\nDesired Skills and Experience\n\n2+ year degree in Computer Science, Information Technology, or related field\n2-5 years of working experience in IT support\nExperience with end-user operating systems such as Windows and macOS\nExperience with mobile device management (e.g., JAMF, Intune)\nFamiliarity with system administration (Server, Networking, etc.)\nUnderstanding of:\nMicrosoft Active Directory and related services (DNS, GPO, etc.)\nCloud-based services and applications (O365, Adobe CC, etc.)\nNetworking principles, including security best practices\nDocumenting configurations, processes, and assets\n\n\n\n\nJAM CRM is an equal opportunity employer committed to creating and maintaining an inclusive and accessible workplace. If you need assistance or require any accommodations during the interview process, please let us know at careers@jamcrm.com.",
      "easy_apply": true,
      "posted_date": "3 minutes ago",
      "scraped_at": "2025-12-08T18:26:32.201304-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 25,
      "cloud_support_fit": 65,
      "sharepoint_support_fit": 40,
      "application_support_fit": 80
    }
  },
  {
    "id": 32,
    "job": {
      "title": "Power BI & Automation Analyst",
      "company": "Themesoft Inc.",
      "location": "Toronto, ON (On-site)",
      "job_id": "4342574274",
      "url": "https://www.linkedin.com/jobs/view/4342574274/?alternateChannel=search&eBP=CwEAAAGbABPrkwQt3eWC5-KdbXCnkQfVGjtkHnJmpKCG2RUjPdJNML15JqdIs0TkowMx7wEtLItpHeLsA7P6IdqQDrGN1ctdRm9sQZEI73M2P1udbnvxPOEQP_uJzc-Xl-VL6kM8cxzJpHUk6GDknvjBfYkrxxb0YmghBuvIg7lqcrE78kq1VzVLZTDZ9rnwyGt8jjp7NBhF2RLVRAh8Gy4N45XwVpnlqG-HGJYcZAtr17lQYlHQ-ypYLkZk3AAmqVSigxQ_NjIHDTO6OH_PbMvOY4p6aXgNABOOo7UvM-AppFhmDScf569oFasGEz9MeWdkr_Gfdw3EBliqUQz61Jg4NdDKeckgTM4nqUX-1oBcloXxc9C4BVQ9wNaACGBh2Kx6QwRcRbRGNBi3LRudWgrv8MH3beppyfrj45VNP_ZkoOspHQjK7Qp4IhYFCz3AkrNP8zs0W9IDW4AyBJGfevr-7z-rLOE5ZaKTTucGYaUWdq97yyF6mThyvPBcdc6P0fQxkteb9uA&refId=Ue%2F7rQUpxv4k%2FLTNgQyeJA%3D%3D&trackingId=yWQ1cv6vyVfHJRXEPq1RZA%3D%3D",
      "description": "About the job\n\nRole: Power BI & Automation Analyst\n\nLocation: Toronto, ON\n\nDuration: Contract\n\n\n\n\nExperience & Education\n\nMinimum 4+ years of combined professional experience building data solutions with Power BI (including DAX, Power Query and publishing dashboards) and creating and managing workflows in Power Automate or similar tools\nExperience integrating Power Platform Solutions with Microsoft 365 and other enterprise systems is an asset\nMinimum 3+ years of experience in IT operations, service delivery, or a related field.\nDeep understanding of ITIL processes and enterprise data governance.\n\n\n\n\nAdvanced hands-on experience with:\n\nServiceNow Modules, including Incident, Change, Problem. \nService Now Performance Analytics\nServiceNow Tables – TDAR and SPM\nTools: Confluence, JIRA, SharePoint and Microsoft suite of applications\nNice to have: Python based data visualization and Machine Learning.\nStrong communication skills and comfort engaging with stakeholders across business and technical teams.\nA self-starter mindset, with the ability to identify gaps, propose solutions, and follow through with impact.\nPassion for improving the way things work—through data, automation, and scalable solutions.\n\n \n\nRoles and Responsibility:- \n\nWork with senior team members to gather requirements, design, build and maintain end-to-end solutions by leveraging Power Platform Tools such as Power BI, and Power Automate.\nBuild & Automate Smarter Workflows.\nBuild data solutions with Power BI, including DAX, Power Query and publishing dashboards.\nCreate and manage workflows in Power Automate to optimize Business Processes\nContinuously improve and streamline data workflows to support scalability and efficiency.\nCollaborate with teams to launch enhancements that improve speed, reliability, and usability.\n\n\n\n\nThank you\n\nPraveen\n\npraveen.s@themesoft.com",
      "easy_apply": true,
      "posted_date": "5 hours ago",
      "scraped_at": "2025-12-08T18:28:14.162616-04:00"
    },
    "job_category": "sharepoint_support",
    "fit_scores": {
      "sde_fit": 25,
      "cloud_support_fit": 15,
      "sharepoint_support_fit": 70,
      "application_support_fit": 65
    }
  },
  {
    "id": 33,
    "job": {
      "title": "Business Data Analyst",
      "company": "Insight Global",
      "location": "Ontario, Canada (Remote)",
      "job_id": "4326300256",
      "url": "https://www.linkedin.com/jobs/view/4326300256/?alternateChannel=search&eBP=CwEAAAGbABPrk4fInWPjLwJGaLCip_g9QNwHls3op9VMBbQhYxQIrbRPG_3FBPpXEBxiHj_ZMkcaBBPTgSkMjh8_W4MNVTVtzNAVxN6xO5RoQzLN98i9xqoRKOyNxT0n058TZbf_-TSixxcPDOsYvZB1gHD6TJGti7jQ1OD_-ivieOoXotw4784GVAzVHaSBHVdsmt5xQeo0d1LHpazacWjpMzktK2vlRUrGoIJtzCMbZfbJZi2xH0FgFvvZ-NeWJ90GvXrDF-cwzEg63-jw0I99ADD4pxYiO_5c8Ygjb8J_yz3HyVIKUW12ulEc0tPvpVOPTFqHHYYTC45Vs-xm_X3vAwV0iko35En30Ow7vwh-FtBHug-RFmE1l2PAIUkC8VXkrRixDr9_8fo2jAoewDFBwvompxGXAGu278nXvqKBI_7xU0gkAk0EjvVV0Vpc23j6-iEoLui-Ql0gEYA7CyFF4VifFXNqaT4XahBPDiAiYmg2VF84zZG-kIM0smCCx_o&refId=Ue%2F7rQUpxv4k%2FLTNgQyeJA%3D%3D&trackingId=%2FXoFPXd9CBqZN65MgPAIYQ%3D%3D",
      "description": "About the job\n\nRequired Skills & Experience\n\n2+ years of experience as a Business Data Analyst \nHands-on experience using the Azure DevOps (ADO) tool to gather data for reporting. \nStrong hands-on experience using Excel and Power BI to develop reports to drive business decisions. \nHands-on experience managing SharePoint with experience creating pages, creating forms, setting up secure files, managing user permissions for internal and external users, as well as the day-to-day maintenance of the site. \nStrong communication skills with the ability to present business insights to key project stakeholders.\n\n \n\nJob Description\n\nInsight Global is looking for a Business Data Analyst to join one of our largest HCM clients on a 15-month contract to start. The successful candidate will work alongside the Services team on a large-scale client implementation. The consultant will be responsible for extracting data from ADO to generate reports in Power BI to define business insights and drive actionable change, as well as managing the SharePoint site. The consultant will be client-facing and, at times, will be required to present reports and business insights directly to the client.",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-12-08T18:28:34.217934-04:00"
    },
    "job_category": "sharepoint_support",
    "fit_scores": {
      "sde_fit": 60,
      "cloud_support_fit": 25,
      "sharepoint_support_fit": 85,
      "application_support_fit": 35
    }
  },
  {
    "id": 34,
    "job": {
      "title": "Data Analyst",
      "company": "Apex Systems",
      "location": "Toronto, ON (On-site)",
      "job_id": "4326271491",
      "url": "https://www.linkedin.com/jobs/view/4326271491/?alternateChannel=search&eBP=CwEAAAGbABPrk48OR9zqkcXMpuGfqHukFMi4LMSPvja0xK55AbJcazZl6P-2sjxP9mVnbUFNPgW4prSqLaiIzmGDljH79BBZOiv8zq-WEIb_9ZzOuRUI3WzJ6h1t3g7wE8vPyghlny2kJry-USmQfvDuwuei_pxE5xHhYLbmQ0l3jux4zzAKhdFgJ_Vw2YUj4DjDEiDZvDnYosS14tHYbhOoyaneUPY2V-fU9Hw9xbVgBdT6lOutgJfEbjrWpHHVQp5Y6tHhIHx3RIbejt34Ks-aRazd3VfxT2Aj_vabTCv1F7ka-9aRHR5gzg7xCseqv5dbJ65xb429xY1Iw7DF9vW-d7vvUrF0oihArLED6K7zB_7tqTuFhC1lDLWuYoMyK0RjY2CksK4K6WkIsQKnVzkcu1ZgEFZK2fDQKA0eMc6gY7iXk6QV1xNp31ZNEs5F7lPI63TVD8qt4-7eisWjgDsI4rNCtg3w4EAcahPc2AmP5KEurUEw8upNUNl-0ZglyJP-hS_L&refId=Ue%2F7rQUpxv4k%2FLTNgQyeJA%3D%3D&trackingId=o%2BjkMMVpWuP1EA%2BZHn%2FSbA%3D%3D",
      "description": "About the job\n\nPower BI Data Analyst\n\nApex Systems is a global IT services provider, and our staffing practice has an opening for a PowerBI Data Analyst with extensive PowerBI and Power Automate experience, strong SQL and ETL capabilities, and solid ServiceNow platform UI for reporting and dashboarding knowledge to place at our client, a Big Five Bank.\n\n\n\n\nClient: Big Five Bank\n\nTerms: 12-month Contract.\n\nLocation: Hybrid or Remote - Downtown Toronto (1-2x/month)\n\n\n\n\nApplication Process: It is best to apply via the medium on which you are seeing this posting. If you encounter technical difficulties submitting your resume, please send a Word version of your resume to John at jpham@apexsystems.com. Please reference Power BI Data Analyst\n\n\n\n\nIdeal Candidate Has:\n\nAbility to learn the processes so that he/she can define the right metrics that can tell a story\nAbility to select the right graphs or charts that provide meaningful visualization\nAbility to build power BI reports from multiple data sources, including the automation into a data staging (centralized repository). \nData files can come in multiple data formats.\nData is often not perfect, ability to massage data and make judgement calls to produce the needed reports/visuals.\nGeneral understanding /knowledge of helpdesk operations is a bonus\nTeam player and fit to the team is important.\n\n\n\n\nJob Description:\n\nDesigns dashboards and analyses to be performed, and appropriate visualization and analytics tools to use. Identifies trends and patterns to address identified business questions and provide insights through reporting and data visualization techniques. Works with other data and analytics professionals to optimize, refine, automate and scale analysis into repeatable analytics solutions and decision support tools.\nBuild various reporting dashboards using the most appropriate data extraction, data cleaning and data visualization techniques.\nProvides value through insights, reporting and data visualization techniques. Selects, configures and implements analytics solutions for consistency and repeatability.\nResearch and apply continuous improvement in data visualization by identifying trends and patterns to transform raw data into actionable business insights.\nWorks with different teams, management and stakeholders to enhance the usability and aesthetic appeal of data analytics solutions deployed in the organization.\nTranslates business needs to technical specifications and evaluates existing data visualization systems to improve them.\nDevelops data visualizations of \"large\" amounts of data that facilitate the intuitive presentation of data to decision makers.\nDocuments data flow, systems and processes to improve the design, implementation and management of business/group processes.\nDevelops tools and delivers training programs for use of reporting tools and self-serve analytics by non-analytical end users; may include delivery of training to audiences.\nFocus is primarily on business/group within the Bank; it may have broader, enterprise-wide focus.\nExercises judgment to identify, diagnose, and solve problems within given rules.\nWorks independently on a range of complex tasks, which may include unique situations.\nBroader work or accountabilities may be assigned as needed.\n\n\n\n\nKey Technologies:\n\nPower BI, Power Automate, M365 products\nSQL and ETL\nServiceNow platform UI for reporting and dashboarding\nAmazon Connect console\n\n\n\n\nSoft Skills:\n\nInsights development and reporting.\nVerbal & written communication skills.\nCollaboration & team skills.\nAnalytical and problem-solving skills.\nData driven decision making.\nTechnical design optimization.\nDecision Making.\nSystems Thinking.\nData visualization.\nData storytelling.\nCreative thinking.\nProblem Solving.\n\n\n\n\nInterview Process: Interviews will take place in two rounds during the same week this month.\n\n\n\n\nThis is a great opportunity to join a Big Five Bank and continue your career in the financial domain. Be a part of a great work environment with a very well-organized team and colleagues who will help you succeed.\n\n\n\n\nThis is a position that impacts the bank enterprise wide with great opportunity for career growth within the bank.\n\n\n\n\nIf you are not a 99% match to the above and want to be considered for other opportunities at our enterprise clients, register for our Talent Network where you can receive job alerts about new opportunities that match your interests. \n\n\n\n\nClick here to Register for our Talent Network  \n\n\n\n\n\n\n\nEEO Employer\n\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystemsinc.com or 844-463-6178.",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-12-08T18:28:37.413355-04:00"
    },
    "job_category": "sde",
    "fit_scores": {
      "sde_fit": 78,
      "cloud_support_fit": 15,
      "sharepoint_support_fit": 68,
      "application_support_fit": 58
    }
  },
  {
    "id": 35,
    "job": {
      "title": "Business Analyst - Risk Specialist",
      "company": "Axelon Services Corporation",
      "location": "Mississauga, ON (On-site)",
      "job_id": "4326255160",
      "url": "https://www.linkedin.com/jobs/view/4326255160/?alternateChannel=search&eBP=BUDGET_EXHAUSTED_JOB&refId=Ue%2F7rQUpxv4k%2FLTNgQyeJA%3D%3D&trackingId=a0cazEPvlIpRGnhlsu47Lw%3D%3D",
      "description": "About the job\n\nJob Title: Business Analyst - Risk Specialist\n\nLocation: Mississauga, ON\n\nWork Mode: Hybrid\n\n\n\n\nOverview: Global Financial Firm located in Mississauga, ON has an immediate contract opportunity.\n\n\n\n\nReliable internet, computer, and Android or iPhone are required for remote access.\nExpected to be in the office weekly for 3 days depending on team requirements.\nVideo/f2f interviews are required prior to all offers.\n\n\n\n\nResponsibilities:\n\nResponsible for Volcker governance controls including ensuring accuracy and completeness of Desk Mandate documents.\nAct as a SME in respect to the Volcker Rule and ensure compliance with relevant standards and procedures.\nReview newly approved products to ensure they are appropriately scoped.\nPartner with key stakeholders to monitor changes in business activity and assess Volcker implications.\nSupport business in ensuring Volcker compliance requirements are met on an ongoing basis.\nPartner with Technology teams to develop sustainable solutions supporting the Volcker Program.\nIdentify, prioritize, and proactively manage dependencies, risks, exceptions, and issues.\nCoverage of specific desks leveraging the Risk Mitigating Hedging (RMH) exemption.\nDocumentation and analysis of desks' hedging strategies alongside Market Risk Management (MRM).\nVariety of project work including assisting in the response to regulatory examinations and queries from Regulators.\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation.\n\n\n\n\nQualifications:\n\nKnowledge of global markets trading products and services, e.g., Fixed Income, Equity, Currencies & Commodities.\nUnderstanding of Front Office trading processes and trade lifecycle within a large bank/dealer.\nKnowledge of market risk and/or regulatory rules pertaining to risk is advantageous.\nExperience with regulatory rules and ideally in delivering regulatory initiatives.\nExposure to analyzing legislative and regulatory texts and associated legal analysis.\nProficiency in risk management data analysis and tools is a plus.\n\n\n\n\nSkills and Competencies:\n\nStrong analytical and problem-solving skills, with high attention to detail.\nOrganized, with the ability to manage multiple requests and prioritize accordingly.\nStrong interpersonal and organizational skills to mobilize and motivate delivery in a cooperative and collaborative working environment across trading and support functions.\nExcellent verbal and written communication skills.\nFluency in MS Office suite.\nKnowledge of internal Client systems is a plus.\n\n\n\n\nEducation:\n\nBachelor’s/University degree. Potentially a Master’s degree.",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-12-08T18:28:46.076522-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 35,
      "cloud_support_fit": 15,
      "sharepoint_support_fit": 25,
      "application_support_fit": 75
    }
  },
  {
    "id": 36,
    "job": {
      "title": "Business Data Analyst",
      "company": "SPECTRAFORCE",
      "location": "Greater Toronto Area, Canada (Hybrid)",
      "job_id": "4342583878",
      "url": "https://www.linkedin.com/jobs/view/4342583878/?alternateChannel=search&eBP=CwEAAAGbABPrkz_3mpzakHQfMfzpHyreabTZGbcNSQYURpKNp4T06xH0sPihzWsqbF23UAPQw4JjSv3pxssXHjpc4dZN9hEtEkURFb8aoG51JJ0MaQ6Bn-GvkmVRHsBFno1yU-t5BYtpsi0ZlFVwzWGwPqyJdUBlV8ARwRoibYgUfYOFHhBvOwasvLgMmjG_5HQsTx69Zywq6yCSkCa3Pz21UhK7a4BzgbM97LCDda-tnTnhAjnoM4fw4IYCUYnG0FBdbWJ7YSItzGiAShVr_RhQP-fMQ9TyUDglW_HhlYaQ0vo5cCjFKE4CHLtHA-qLFsP08WCfaDhifaJtdlrc5aUeS7iUq2r5IkXipFprzhAyZwi65Z0EbekT2ioKcZmCaQHQIdjajP9MMVHHs_0mpOT0uJREhWxkKw6EanU9PSNyDB_FHMuMf2-9dgI5JE3zBOX8dhhWiBqOb6swDsICd0GzsifC0WX6_hnvWQ&refId=Ue%2F7rQUpxv4k%2FLTNgQyeJA%3D%3D&trackingId=Gr9CMEAXD1WJuMOcjqOhgw%3D%3D",
      "description": "About the job\n\nRole: Business Data Analyst\n\nLocation: Toronto, ON – Hybrid (4 days onsite per week)\n\nDuration: 12 Months (possible extension)\n\nMust-Have Skills: Experience with SQL + Credit Risk/Wholesale data + SAS/Python\n\nCandidate having prior experience with Commercial lending data, Credit risk metrics (PD, LGD, EAD, ratings), SQL and hands-on data experience. Looking for someone with Risk/Finance/Portfolio teams and who has exposure to lending or credit systems.\n\n\n\n\nReason for hire: supporting data needs and added workload, change management\n\nProvides change management, data services and analysis in support of MDPA\n\nKey Accountabilities:\n\nProviding subject matter expertise on Wholesale Credit Risk data, data processes and systems\nAssisting in the system development and perform comprehensive testing to ensure technology deliverable fulfill business requirement\nPerform in depth data analysis and investigation.\nProviding tactical solution for urgent business requirement.\nIdentifies and documents the business partner’s functional and data requirements based on a business process description or data process to ensure that the final deliverable coincides with the context of the business operations\nReviews project documents (e.g., High Level Requirements Document [HLRD], High Level System Design Documents [HLSD], and application code) to ensure quality, completeness, and adherence to documentation standards, as well as identifies synergies between initiatives in order ensure the efficiency and effectiveness of the development process\n\nKnowledge & Skills:\n\nProficient using SQL statements to query data and perform data profiling, data verifications\nStrong experience with business system analysis in a complex data warehousing environment running on Netezza and Cloud.\nStrong experience gathering business requirement from client groups and converting these into functional specification documents\nStrong sense of commitment\nExperience with SAS/Python\nBackground in Data Science, Information Systems, Statistics\nPossesses solid business knowledge in Finance/Banking industry\nStrong analytical skills, communication skills and presentation skills\n\nEducation:\n\nPossesses a university degree in Data Science, Engineering, Information Systems and/or Business",
      "easy_apply": true,
      "posted_date": "6 hours ago",
      "scraped_at": "2025-12-08T18:28:49.758994-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 65,
      "cloud_support_fit": 45,
      "sharepoint_support_fit": 15,
      "application_support_fit": 85
    }
  },
  {
    "id": 38,
    "job": {
      "title": "IT Technical Advisor - IAM/AAM",
      "company": "Intact",
      "location": "Toronto, ON (Hybrid)",
      "job_id": "4326208757",
      "url": "https://www.linkedin.com/jobs/view/4326208757/?alternateChannel=search&eBP=CwEAAAGbABcGvOIuvPHcwGESp69XTK5quUkP8oBmdhRYPKdsZUX2KBIU8x8YnzZXzEE_xrJNzFW3sAquuQcEgZbI9moq3vz1L4DjdJJErZKxbXlYCoReg_ZG5KICgk8JrSEdZCswzABGmhCMEKXDteYRpBF3jAHaQEd6HOGs2wH1VnNAPc80Ej7Frywjbec2SjAOLUjSv7tTm9xHe_0hSjQ3S2JfW_YD90A-Fh9HXEa-mD7LtAhRa8CqSZAW6-rJUUxZW4b2zZZycIMjoLdFNQb1LrGeiA4Tu53cRga5B_hcOGgMi4rcDa8ShOtP0mPZ6LshNdgJoMhr7avwp9rUAGhfGdLjTNX3te2nGpFdPoPXcNztbuI5Pn6N85A0id_FUE0G3DbUdE3EXNlsGFtj0sqvAqfCfCvzqGw2dI5zJW94q5HUoJ-1RdUn3Od9R-tacRNjBx-yn5EErqEAIgvjyt7jqXx7ODQut602sA&refId=MZefE6LyoUtP2QxmRXe7Kw%3D%3D&trackingId=U%2B5stL2yn7uF%2FeCuqMhYXg%3D%3D",
      "description": "About the job\n\nOur employees are at the heart of everything we do. Together, we help people, businesses, and society prosper in good times and be resilient in bad times.\n\nOur employee promise represents Intact’s commitment to you in exchange for living our Values, striving to do your best work, being open to change and investing in your career. In return, we promise to provide support, opportunities and performance-led financial rewards at a workplace where you can shape the future, win as a team and grow with us.\n\nAbout The Role\n\nWe’re looking for an IT Technical - IAM/AAM Advisor that will help shape secure, seamless IAM/AAM experiences for Brokers and Customers. You’ll collaborate across Infra, architecture, and client teams to translate requirements into scalable solutions, apply best practices, and enhance performance and reliability. Ideal for someone with solid cybersecurity fundamentals, strong communication, and a growth mindset—ready to learn, solve problems, and contribute in a fast-paced environment.\n\nWhat You'll Do Here\n\n\nOversee the end-to-end management of IAM (Identity and Access Management) and AAM (Authentication and Authorization) services, ensuring they meet the evolving needs of our Broker and Customer communities.\nCollaborate with stakeholders to gather requirements and define the roadmap for IAM and AAM services.\nEnsure the implementation of best practices in IAM and AAM to maintain high security and seamless user experiences.\nMonitor and maintain the performance, security, and reliability of IAM and AAM services.\nCoordinate with Infra teams and IT architects to implement and update IAM and AAM solutions.\nProvide support and assistance to senior team members in implementing and managing security solutions.\nWork closely with clients to understand their security needs and assist in deploying IAM and AAM solutions.\nCollaborate with cross-functional teams to ensure seamless integration and functionality of security systems.\nContribute to technical documentation and training materials.\nParticipate in team meetings and support the team with diverse tasks as needed.\nAssist in conducting risk assessments and vulnerability assessments.\nFollow up on requests / incidents using service management tool and change control procedures to deploy new security rules, guarantee complete resolution of problems and accelerate incident recovery time.\nStay informed about industry trends and advancements in identity and access management technologies to proactively enhance our services.\n\n\nWhat You Bring To The Table\n\n\nUniversity degree/College diploma in related field or any combination of equivalent education and experience.\nUnderstanding of ITIL methodologies, ITIL® v3 Certification desirable.\n1-3 years experience in the end-user technical domain of expertise, supporting end-user services, products and solutions.\nRelevant certifications are a plus.\nStrong understanding of cybersecurity fundamentals.\nBasic knowledge of networking concepts and protocols.\nFamiliarity with programming or scripting languages (e.g., Python, Java, or similar).\nExcellent problem-solving skills and attention to detail.\nStrong communication and interpersonal skills.\nAbility to work both independently and collaboratively within a team.\nA keen desire to learn and develop new skills in cybersecurity and IBM security products.\nFor candidates located in Quebec, bilingualism is required considering the necessity to interact on a regular basis with English speaking colleagues across the country. \nNo Canadian work experience required however must be eligible to work in Canada \n\n\nWhat We Offer\n\nOur hybrid work model provides the balance between working from home and enjoying meaningful in-person interactions.\n\nWorking Here Means You'll Be Empowered To Be And Do Your Best Every Day. Here Is Some Of What You Can Expect As a Permanent Member Of Our Team\n\n\nA financial rewards program that recognizes your success \nAn industry leading Employee Share Purchase Plan; we match 50% of net shares purchased \nAn extensive flex pension and benefits package, with access to virtual healthcare \nFlexible work arrangements \nPossibility to purchase up to 5 extra days off per year \nAn annual wellness account that promotes an active and healthy lifestyle \nAccess to tools and resources to support physical and mental health, embracing change and connecting with colleagues \nA dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs \nInclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities\nInspiring leaders and colleagues who will lift you up and help you grow \nA Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique. \n\n\nWe are an equal opportunity employer\n\nAt Intact, our Value of respect is founded on seeing diversity as a strength. We strive to create an accessible workplace where employees feel valued, included and encouraged to share their unique perspectives.\n\nWe encourage applications from individuals who are members of equity-deserving groups, including but not limited to women, Indigenous peoples, persons with disabilities, Black people, and members of the 2SLGBTQI+ community.\n\nAs part of Intact’s commitment to reconciliation, we acknowledge that we work, meet and travel across the land currently called Canada, originally inhabited by First Nations, Metis and Inuit people. This history extends through many centuries and continues to evolve today.\n\nWe have policies to ensure equal access and participation for people with disabilities, including providing workplace adjustments (accommodations). A copy of applicable policies is available on request.\n\nIf we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs.\n\nLearn more about our recruitment process and your candidate journey here.\n\nIf you are an employee of Intact or belairdirect, please apply for this role on Internal Career Site.",
      "easy_apply": false,
      "posted_date": "4 hours ago",
      "scraped_at": "2025-12-08T18:31:40.191954-04:00"
    },
    "job_category": "cloud_support",
    "fit_scores": {
      "sde_fit": 55,
      "cloud_support_fit": 88,
      "sharepoint_support_fit": 65,
      "application_support_fit": 78
    }
  },
  {
    "id": 39,
    "job": {
      "title": "OT Cybersecurity Analyst (Junior–Mid Level)",
      "company": "MarkiTech.AI",
      "location": "Toronto, ON (On-site)",
      "job_id": "4342585307",
      "url": "https://www.linkedin.com/jobs/view/4342585307/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=nOA%2FtHNzcIhk%2BZiIgErWmw%3D%3D&trackingId=TVXaRWr6DskyWejjwThpzg%3D%3D",
      "description": "About the job\n\nWe are looking for a junior- to mid-level OT Cybersecurity Analyst to help protect our industrial control systems (ICS), SCADA environments, and connected devices. You will work closely with operations, engineering, and IT teams to monitor threats, support security controls, and improve the overall cyber resilience of our operational technology.\n\nKey Responsibilities\n\nMonitoring & Incident Response:\n\n\nMonitor OT networks, security tools, and logs for suspicious activity.\nTriage alerts and support incident investigation and containment.\nDocument security events, incidents, and lessons learned.\n\n\nOT Asset & Network Management\n\n\nAssist in maintaining an accurate inventory of OT assets (PLCs, RTUs, HMIs, SCADA servers, sensors, etc.).\nSupport network segmentation efforts (e.g., separating IT and OT, defining zones and conduits).\nHelp analyse network traffic in OT environments using basic tooling (e.g., Wireshark, network monitoring tools).\n\n\nSecurity Controls & Hardening\n\n\nAssist in implementing and maintaining security controls such as:\nUser access controls and least-privilege principles.\nSecure remote access for vendors and technicians.\nPatch and vulnerability management processes for OT devices (where feasible and safe).\nSupport configuration reviews of firewalls, switches, and gateways that interact with OT networks.\n\nRisk & Vulnerability Management\n\n\nRun or support basic vulnerability scans in coordination with OT/engineering teams (with change controls in place).\nAssist in risk assessments for OT systems, documenting threats, vulnerabilities, and potential impacts.\nHelp track remediation actions and follow-up items with system owners.\n\n\nGovernance, Compliance & Documentation\n\n\nContribute to OT cybersecurity policies, standards, and procedures.\nSupport alignment with relevant frameworks (e.g., NIST CSF, ISA/IEC 62443 – as applicable).\nMaintain up-to-date documentation of OT architecture, security controls, and recovery plans.\n\n\nTraining & Collaboration\n\n\nCollaborate with operations, maintenance, and engineering teams to ensure security controls are practical and safe.\nHelp deliver awareness sessions or quick guides for plant technicians and engineers on cybersecurity best practices.\n\n\nRequired Qualifications & Experience\n\n\nBachelor’s degree in Computer Science, Cybersecurity, Electrical/Industrial Engineering, or related field\nOR equivalent practical experience in IT/OT support or security.\n1–4 years of experience in one or more of the following:\nIT or OT support role (network/ systems/ field engineer)\nCybersecurity analyst / SOC analyst\nIndustrial automation or control systems with security exposure\n\nEssential Skills & Knowledge\n\n\nBasic understanding of operational technology environments, such as:\nICS / SCADA, PLCs, HMIs, DCS, or similar industrial systems.\nFoundation in cybersecurity concepts:\nNetwork security, access control, least privilege, patching, backups, logging.\nCommon attack types (phishing, ransomware, lateral movement, etc.).\nFamiliarity with networking fundamentals: TCP/IP, VLANs, firewalls, VPNs.\nHands-on experience with one or more of the following (even at beginner level):\nSIEM tools (e.g., Splunk, QRadar, etc.)\nNetwork analysis tools (e.g., Wireshark)\nVulnerability scanning tools\nStrong problem-solving skills and attention to detail.\nGood communication skills and ability to work with non-technical OT personnel.\n\nNice-to-Have (Preferred)\n\n\nExposure to or awareness of industrial standards (e.g., ISA/IEC 62443, NIST CSF, NERC CIP, ISO 27001).\nExperience working in manufacturing, utilities, energy, oil & gas, transportation, or critical infrastructure.\nBasic scripting skills (e.g., Python, PowerShell) for automation and log analysis.\nExperience participating in incident response activities or tabletop exercises.\n\n\nWhat We Offer\n\n\nOpportunity to grow from junior to specialist in OT/Industrial Cybersecurity.\nHands-on exposure to real plant/industrial environments and technologies.\nTraining and certification support (e.g., GICSP, ICS/OT security courses).\nCollaborative environment with engineering, operations, and cybersecurity team.\n\n\nJob Title: OT Cybersecurity Analyst (Junior–Mid Level)\n\nLocation: [City / Remote]\n\nExperience: 1–4 years (basic to moderate)\n\nDepartment: Operational Technology / Industrial Cybersecurity",
      "easy_apply": false,
      "posted_date": "22 hours ago",
      "scraped_at": "2025-12-08T18:33:53.694586-04:00"
    },
    "job_category": "application_support",
    "fit_scores": {
      "sde_fit": 25,
      "cloud_support_fit": 55,
      "sharepoint_support_fit": 15,
      "application_support_fit": 75
    }
  },
  {
    "id": 43,
    "job": {
      "title": "Lead RedPoint Platform Engineer",
      "company": "Perficient",
      "location": "Toronto, ON",
      "job_id": "4342655376",
      "url": "https://www.linkedin.com/jobs/view/4342655376/?alternateChannel=search&eBP=CwEAAAGbABoJ8pnQ00foIZpYFMkW-AykiGCwN_6Emv6u9SohkJWeCLWisl60QXcw-pbes23uByOmyX2F7_rYY03EWDdykCJYeCHqCB3T78RIGh2eSSNyeoT1AhsW3oFlTjno0EClIZve5HSZrnil1j-kSaKCJdtxB8zz26fmIi5dqbNSa53EDb05PvVvbw8EaA8OyXf_glZzFCzR_2_DznIQN9bjwqnenRv3dcC9q8nGbY5ZFwKxzyG3NJOAgYiZ163gAkobvRoGOAkvFtoIKUk0GQY5rQQZVXUjR1WKGxNdcXgEyvze1qigHUW-PjhqEEaqPqQgmyweH__p73zOSz01z6GgDk6tmkbA7-PN2pcDykuviWr4gpSq94sG2VVKbZzA-qj_9C_F-deZLK3jRt_v2P6Q5AvDgrziakmLhZ_8x1Gs7fcNPXy9387nMYL8CKwtKLT_UbkAQai39w0JhxXEQBAP1n2O4gxteFTB0xIIapkpKNyNcbB1c0Rcsi-wqUrzud-N&refId=DNQBCRcD1dE05eGLHUkoRA%3D%3D&trackingId=ygM5KZp5Og3OTP3h7s05%2Bw%3D%3D",
      "description": "About the job\n\nJob Description\n\nWe currently have a career opportunity for a Lead RedPoint Platform Engineer to join our team.\n\nJob Overview:\n\nAs a Lead RedPoint Platform Engineer you will provide specialized second and third-level technical support for the applications built on RedPoint platform, resolving complex incidents, managing advanced integrations, and collaborating with development, infrastructure, and operations teams to ensure service continuity and efficiency.\n\nPerficient is always looking for the best and brightest talent and we need you! We’re a quickly-growing, global digital consulting leader, and we’re transforming the world’s largest enterprises and biggest brands. You’ll work with the latest technologies, expand your skills, and become a part of our global community of talented, diverse, and knowledgeable colleagues.\n\nResponsibilities\n\n\nDiagnose and resolve critical incidents related to RedPoint. \nDesign, implement, and optimize omnichannel marketing campaigns, create Real Time Layouts of webpage using Redpoint Interactions. \nScheduling automations between RPI and RPDM, automate repetitive tasks using scripts or monitoring tools. \nPerform API integrations with Redpoint. \nAnalyze logs, traces, and system performance. \nEscalate and follow up with the RedPoint vendor when necessary. \nDocument solutions, procedures, and lessons learned. \nSupport implementations, upgrades, and RedPoint migrations. \nCollaborate with development teams for integration testing and change validation. \nParticipate in on-call or rotating 24/7 support shifts (as required)\n\n\nQualifications\n\n\nMinimum 3 years of experience in a Level 2 or Level 3 technical support role. \nAdvanced knowledge of the RedPoint platform (Data Management, Campaign, Interaction). \nProficiency in SQL databases (Oracle, SQL Server, PostgreSQL) and data segmentation logic. \nDemonstrated ability to leverage AI tools to enhance productivity, streamline workflows, and support data-informed task execution. \nFamiliarity with AI-enhanced platforms is a plus. \nA solid understanding of AI capabilities and limitations including ethical considerations is expected. \nExperience with monitoring tools, including Splunk and/or Dynatrace\nUnderstanding of networking, REST/SOAP APIs, and integration protocols. \nKnowledge on various AWS technologies, including EC2, and S3\nScripting skills in PowerShell, Bash, or Python\nAnalytical thinking and problem-solving mindset. \nClient facing or consulting experience highly preferred. \nSkilled problem solvers with the desire and proven ability to create innovative solutions. \nFlexible and adaptable attitude, disciplined to manage multiple responsibilities and adjust to varied environments. \nFuture technology leaders- dynamic individuals energized by fast paced personal and professional growth. \nPhenomenal communicators who can explain and present concepts to technical and non-technical audiences alike, including high level decision makers. \nSolid foundation in Computer Science, with strong competencies in data structures, algorithms and software design. \n\n\nAbout Our App Modernization National Business Unit\n\nOur App Modernization team helps businesses transform legacy systems and build future-ready applications. We deliver end-to-end solutions—combining cloud migration, custom application development, multi-cloud strategies, and modern UI and API integration. With expertise in DevSecOps, modern frameworks, and enterprise platforms, our team of engineers, architects, and project leaders partner with leading brands to drive innovation, accelerate delivery, and create lasting business impact. We also integrate AI-driven capabilities—such as intelligent automation, predictive analytics, and generative development tools—to enhance scalability, performance, and user experience.\n\nAbout Perficient\n\nPerficient is a global AI-first consultancy. Our team of strategists, designers, technologists, and engineers partners with the world’s most innovative enterprises and admired brands to deliver real business results through the transformative power of AI. As part of our AI-First strategy, we empower every employee to build AI fluency and actively engage with AI tools to drive innovation and efficiency. We break boundaries, obsess over outcomes, and shape the future for our clients. Join a company where bold ideas and brilliant minds converge to redefine what’s possible - while building a career filled with growth, balance, and purpose.\n\nAdditional Information\n\nPerficient, Inc. proudly provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a protected veteran in accordance with applicable federal, state and local laws. Perficient, Inc. complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. Perficient, Inc. expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, national origin, age, genetic information, disability, or covered veterans. Improper interference with the ability of Perficient, Inc. employees to perform their expected job duties is absolutely not tolerated.\n\nDisability Accommodations: Perficient is committed to providing a barrier-free employment process with reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or accommodation due to a disability, please contact us.\n\nApplications will be accepted until the position is filled or the posting is removed.\n\nThe salary range for this position takes into consideration a variety of factors, including but not limited to skill sets, level of experience, applicable office location, training, licensure and certifications, and other business and organizational needs. The new hire salary range displays the minimum and maximum salary targets for this position across all US locations, and the range has not been adjusted for any specific state differentials. It is not typical for a candidate to be hired at or near the top of the range for their role, and compensation decisions are dependent on the unique facts and circumstances regarding each candidate. A reasonable estimate of the current salary range for this position is $93,600.00 to $170,640.00. Please note that the salary range posted reflects the base salary only and does not include benefits or any potential variable compensation programs. Information regarding the benefits available for this position are in our benefits overview.\n\nDisclaimer: The above statements are not intended to be a complete statement of job content, rather to act as a guide to the essential functions performed by the employee assigned to this classification. Management retains the discretion to add or change the duties of the position at any time. \n\nAbout Us\n\nPerficient is the global AI-first consultancy. Our team of strategists, designers, technologists, and engineers partners with the world’s most innovative enterprises and admired brands to deliver real business results through the transformative power of AI. As part of our AI-First strategy, we empower every employee to build AI fluency and actively engage with AI tools to drive innovation and efficiency. We break boundaries, obsess over outcomes, and shape the future for our clients. Join a company where bold ideas and brilliant minds converge to redefine what’s possible - while building a career filled with growth, balance, and purpose.\n\n\n\nSelect work authorization questions to ask when applicants apply\n\n1. Are you legally authorized to work in the United States?\n\n2. Will you now, or in the future, require sponsorship for employment visa status (e.g. H-1B visa status)?",
      "easy_apply": true,
      "posted_date": "1 hour ago",
      "scraped_at": "2025-12-08T18:35:21.169724-04:00"
    },
    "job_category": "cloud_support",
    "fit_scores": {
      "sde_fit": 65,
      "cloud_support_fit": 85,
      "sharepoint_support_fit": 10,
      "application_support_fit": 90
    }
  }
]