[
  {
    "title": "Full Stack Developer",
    "company": "Hardboot | Venture Capital + Talent",
    "location": "Toronto, ON (On-site)",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310706964&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=GdxoPrlIGZU6NHUUGsB3zg%3D%3D&refId=WQH8j5%2BFRX5qs8IsfDipbQ%3D%3D&eBP=NOT_ELIGIBLE_FOR_CHARGING",
    "description": "About the job\n\nAt Hardboot, we help scaling companies build the teams they need to grow—and right now, we're hiring in-house for a fast-growing player in the fintech space.\n\n\n\n\nWe are seeking a Full Stack Developer to join our dynamic and fast-growing team. You will be involved in the design, development, and maintenance of an innovative eWallet application suite, contributing to the entire software development lifecycle (SDLC). This role offers the opportunity to see your work directly impact end users while collaborating with a highly skilled and motivated team.\n\n\n\n\nResponsibilities:\n\n● Engage with multiple facets of the business, contributing to project planning and execution.\n\n● Develop and maintain web and mobile applications with accuracy and efficiency.\n\n● Test and debug new and existing applications to ensure optimal performance.\n\n● Work independently while collaborating with cross-functional teams in an Agile environment.\n\n● Manage time-sensitive deliverables and meet project deadlines.\n\n● Provide technical support and enhance the user experience based on feedback.\n\n● Maintain strong organizational and communication skills.\n\n● Demonstrate a service-oriented mindset, ensuring user satisfaction and confidence.\n\n● Report to IT Team Leads for various initiatives and to the CTO for overall team alignment.\n\n● Maintain a positive, go-getter attitude while tackling challenges.\n\n\n\n\nQualifications & Skills\n\n● Strong experience in Fintech application development using: \n\nFront-end: HTML, CSS3, JavaScript, jQuery, React Native, React.js, TypeScript\nBack-end: PHP (4PAY proprietary framework), SQL\n\n● Extensive knowledge of iOS and Android app development, including deployment to app stores.\n\n● Cross-platform development expertise with a strong focus on UI/UX design.\n\n● Experience in developing and maintaining high-quality React Native applications with clean code.\n\n● Strong understanding of REST APIs, document request models, and offline storage.\n\n● Proficiency in React tools (React.js, Redux) and state management.\n\n● Strong command of JavaScript and TypeScript, understanding their nuances.\n\n● Ability to diagnose and fix performance bottlenecks for native-like app performance.\n\n● Effective collaboration with project stakeholders, back-end developers, front-end developers, and QA\n\ntesters.\n\n● Ability to gather project requirements and implement solutions effectively.\n\n● Experience in international customer service, with a passion for user satisfaction.\n\n\n\n\nWhy Join Us?\n\n● Work on cutting-edge fintech solutions in a fast-paced environment.\n\n● Join a growing team with endless opportunities to lead and advance your career.\n\n● See your work make a real-world impact on end users.\n\n● Be part of a collaborative and innovative company culture.\n\n\n\n\nTech-savvy? Creative? Ready to lead? If you're a developer who thrives on innovation, this is the place for you. Apply today and help revolutionize digital payments!",
    "posted_date": "24 minutes ago",
    "scraped_at": "2025-10-10T11:13:23.904290"
  },
  {
    "title": "Software Developer",
    "company": "IBM",
    "location": "Markham, ON (Hybrid)",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310263636&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=IGOVsSzlZT8p1AYxlTCsqw%3D%3D&refId=WQH8j5%2BFRX5qs8IsfDipbQ%3D%3D&eBP=CwEAAAGZzq7gGZBSZ6W71qepbkWYXeQ7F0-NbK7cVjo7-ee0oA4qnklw2f7HKpQxFCPFFGjM3U0FBKlulQrBSFAmxg8Auq_bSl6bHH6OW_smrRlYYPpJz2fp04amGU4Lzileez_Ttz4IvlynBytcI7lJAlpHhscLkcwhGEWeH3Vuv6VoHfOqYlIL7cr9UMAFjQKoeQj96vLet4gwQS8OW2kBoIO1bpw8YTeJXyqD6Q0oFWC90d_Yf6QLsCEckAZMvVSQyzccw1fS78bKdRs_HZNhHTNPBDLk9YUrYi_rdOTeaG4aG0lWYyavpTKn7YMgVkKhmNSnAclyAJ4agC9M2JTsOEqDtmIxUTXQ36ve7o5SXGCcOLKPccazyZPRd_DuFIHw9xolLhdTicoSfbzsBJ4C7p6ShbIVOxmYY0lwCWAYHis2OjlmXFbjJprhhxb2Zo07mVf_-F8AodOvNlFW1EPIOsKpKyp5Wcsi55CyTYU4UEFLWB9o3fSGXhAMNOcpk-kMGFlbEkTv0g",
    "description": "About the job\n\nIntroduction\n\nA career in IBM Software means you'll be part of a team that transforms our customer's challenges into solutions.\n\nSeeking new possibilities and always staying curious, we are a team dedicated to creating the world's leading AI-powered, cloud-native software solutions for our customers. Our renowned legacy creates endless global opportunities for our IBMers, so the door is always open for those who want to grow their career.\n\nIBM's product and technology landscape includes Research, Software, and Infrastructure. Entering this domain positions you at the heart of IBM, where growth and innovation thrive.\n\nYou will be joining the Java Insights for Hybrid Cloud team working on Cryostat- a container-native Java application based on JDK Flight Recorder (JFR) that is used to monitor Java Virtual Machine (JVM) performance for containerized workloads deployed on the Red Hat OpenShift container platform.\n\nYour Role And Responsibilities\n\n\nFull stack Development: Design, develop and maintain core components of Cryostat.\nCross-functional Collaboration: Work closely with Product, Quality Engineering and Documentation teams to ensure rigorous software standards are met throughout the development lifecycle. \nProactive Communication: Communicate with stakeholders across teams to identify and mitigate risks to meet deliverable timelines.\nCommunity Involvement: Engage in discussions with the Open source community. Evangelize team's work through blogs, all hands meetings, and conference presentations.\n\n\nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\n\nWorking knowledge/experience in software development, demonstrating expertise in programming languages such as Java, Go and Typescript.\nOperate in a Linux / Unix environment, including being comfortable using the command line interface.\nWorked with standard development tools, such as git and understand what this tool is used for and why it is necessary.\n\n\nPreferred Technical And Professional Experience\n\n\nFamiliarity with cloud and container technologies including Docker, Podman, Kubernetes and Red Hat OpenShift.",
    "posted_date": "13 hours ago",
    "scraped_at": "2025-10-10T11:13:32.017573"
  }
]
