[
  {
    "title": "Frontend Developer",
    "company": "Medcan",
    "location": "Toronto, ON (Hybrid)",
    "job_id": "4313403072",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4313403072&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=Ih9MqVCJUb1Skbc5p5X9gA%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYj66EiqcjN3qIqjpEiVgSi1mhkusZMyMeRvrNA6YGuwfHQ2KhXxnxgSa01nuDdvN4T3jvF7yWAF2GKMgnyua6d6yOj1t6USOUWpLEmOaPBiZ9U6PqM6HovuICw92h2_906DXLatojP2pO6KFk3L2ysrNvsSHoGu2Ku0n5T3nJUus7Mue1R52EMAosLQwdTbIhftqFyGg2TrdPEd3HaJiTRBRstuh8Fvpp0Z4CU76ECikvAftPZIA6IgrL8TTR4RLoV0TlIicy07i7BNlT4sX0DEO-dLN6XGQLoSQR2tRRBCtzQbFsQwuDP14RtfoVSEf0QhY3hpx4aazk-xHHHURjTFXdpwl8LkDGZ08hthkSJn80VHkk_6DYPiqRKAUcoxELJkg7DdZCZnvPjTXTu1uZLbbQ1Fbw3yxOJs9Q_UvzfQ6uAhgclXcK5-zEpQb4_xFCvqrn8XokbXLe2oNNLx1vxg0zSDlhZ6QhQCTQ7VH4jNZKhdEWz4X2Nkc6A",
    "description": "About the job\n\nAre you passionate about helping people live their healthiest lives? Do you thrive in a dynamic, supportive environment where your contributions truly matter? If so, Medcan is the place for you!\n\nAbout Us:\n\nFounded in 1987, Medcan is a leader in transformational proactive and primary care dedicated to helping patients and team members live well, for life. We offer a comprehensive range of services including preventative health assessments, wellness programs, and specialized medical care.\n\nOur core values of excellence, drive, respect and integrity guide everything we do. We’re committed to creating a workplace where everyone can thrive, and we’re proud to support over 1,500 businesses across Canada with our health and wellness solutions.\n\nAbout Us:\n\nFounded in 1987, Medcan is a leader in transformational proactive and primary care dedicated to helping patients and team members live well, for life. We offer a comprehensive range of services including preventative health assessments, wellness programs, and specialized medical care. Our core values of excellence, drive, respect and integrity guide everything we do. We’re committed to creating a workplace where everyone can thrive, and we’re proud to support over 1,500 businesses across Canada with our health and wellness solutions.\n\nWhat You’ll Do:\n\n\nDevelop and maintain front-end components.\nLeverage UI frameworks and design systems from Figma to build consistent, responsive and accessible user interfaces.\nParticipate in code reviews, testing and debugging to ensure high-quality deliverables.\nCollaborate with designers and backend developers to implement seamless user experiences.\n\n\nWhat You’ll Need:\n\n\nBachelor's degree in Computer Science or a related field\n3-5 years of experience in front-end development using React\nExperience working with UI frameworks\nFamiliarity with RESTful API’s and modern front-end tooling\nProficiency in Agile methodologies\nExcellent problem-solving, decision-making and communication skills\n\n\nThis is a full-time hybrid position (2 days in office) working 40 hours per week based on business needs between regular office hours Monday – Saturday (8 AM - 5 PM). Our downtown Toronto clinic is conveniently located at 150 York St., which is nearby St. Andrew station or a 10-minute walk from Union Station!\n\nWhy You’ll Love Working Here:\n\n\nHybrid Office Policy: Flexible work-from-home and office options.\nFree Coffee and Snacks: Keep your energy up with our delicious onsite offerings.\nEmployee Perks: Access to wellness programs like fitness training and other discounted Medcan services and products.\nBenefits: Comprehensive health plans, retirement saving matches, educational reimbursement, and so much more!\nEngaging Work Environment: Join a team that values collaboration, creativity, and continuous improvement.\nRecognition: We celebrate our employees’ contributions through manager recognition and AwardCo prizes.\nCareer Growth Opportunities: We believe in nurturing talent and providing opportunities for professional development and career advancement.\n\n\nReady to Apply?\n\nIf you’re ready to make a difference and be part of a company that truly cares about its people, we’d love to hear from you! Apply today and let’s inspire wellness together.\n\nDiversity, Equity and Accessibility:\n\nMedcan is dedicated to employment equity, diversity and inclusion. We strive to ensure all staff have a fair opportunity to participate and success at work. If contacted for an employment opportunity, please advise your Talent Acquisition Specialist if you require accommodation.",
    "easy_apply": false,
    "posted_date": "12 minutes ago",
    "scraped_at": "2025-10-10T16:53:16.999755-04:00"
  },
  {
    "title": "Jr Data Developer",
    "company": "Citylitics Inc.",
    "location": "Toronto, ON (On-site)",
    "job_id": "4313278517",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4313278517&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=wxKfNKqz%2BMtvZop%2FysHNjQ%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=NOT_ELIGIBLE_FOR_CHARGING",
    "description": "About the job\n\nCitylitics delivers predictive intelligence on local utility & public infrastructure markets.\n\nWhat is Infrastructure? It is the roadways you rely on to safely get to Grandma's house, it's the potable water that comes out of your kitchen tap that you wash your family's food with and it's the energy that heats our homes and powers our digital lifestyles.\n\nEvery year, trillions of dollars are spent on all areas of infrastructure to maintain our quality life and move our economy forward. However, our infrastructure is no longer equipped to meet the needs of the future. We hear about infrastructure failures, whether bridge collapses, power blackouts, or water main breaks, every day in the news. Climate change and extreme weather events are disrupting the basic infrastructure we took for granted for years.\n\nCitylitics is solving the hardest data problems in infrastructure while building the sales intelligence platform that enables a faster, more transparent, and more efficient infrastructure marketplace. We turn millions of unstructured documents into high value intelligence feeds and datasets that are available on an intuitive user experience. Our goal is to enable solution providers to connect with cities with relevant infrastructure needs in a faster and more digital way than historic market channels. As more companies adopt our platform, cities & utilities will be able to access solutions that deliver on the promise of moving towards a more resilient, sustainable, and equitable infrastructure future.\n\nWho Are We Looking For?\n\nWe're looking for a skilled and enthusiastic Jr. Data Developer to join our growing team! We're a close-knit group building and maintaining mission-critical data products, and we need someone who can hit the ground running.\n\nThis role requires a solid understanding of and experience with Dash. You'll be responsible for designing, building, and maintaining user-friendly dashboards, leveraging various technologies we already use, including GCP services like BigQuery, Cloud Run, and Cloud Functions. Experience with these specific GCP services is a must.\n\nWe're not looking for just someone who knows these tools, but someone who has built with them - ideally, complex and robust applications in a production environment. We're interested in seeing examples of your work, so please be prepared to discuss past projects and challenges you've overcome.\n\nBeyond the technical skills, we value collaboration, a proactive approach to problem-solving, and a willingness to learn and adapt to evolving technologies. If you're passionate about data, thrive in a collaborative environment, and are excited by the prospect of working on impactful projects, we encourage you to apply.\n\nWhat Will You Accomplish?\n\n\nDesign, build, and maintain: Develop and deploy highly performant, reliable, and user-friendly dashboards using Dash and Cloud Run. This includes everything from initial design and development through testing, deployment, and ongoing maintenance\nData Modeling & Optimization: Collaborate with data analysts and stakeholders to define data requirements, and design efficient and effective data models within BigQuery. You'll be optimizing queries and dashboard performance for maximum efficiency\nMonitoring & Troubleshooting: Implement robust monitoring, testing, and alerting for cloud-based applications. Proactively identify and resolve issues, ensuring data quality and dashboard uptime\nCollaboration & Communication: Work closely with other engineers, data scientists, and product teams to understand business requirements and translate them into technical solutions. Clearly communicate technical details and project progress\nContinuous Improvement: Contribute to the ongoing improvement of our data infrastructure and processes, including suggesting and implementing new technologies and best practices. We're always looking for ways to optimize our workflows and improve efficiency. \nOther Duties as assigned\n\n\nRequirements\n\n\nProficiency in Python and SQL\nProven experience (2+ years) building and maintaining data applications using Dash. \nStrong understanding of data warehousing principles and experience working with BigQuery\nUnderstanding of data modeling concepts and best practices\nFamiliarity with Google Cloud Platform (GCP) services, specifically BigQuery, Cloud Run, and Cloud Functions. Experience with other GCP services is a plus\nExperience with version control systems (Git)\nExcellent problem-solving skills and a proactive approach to identifying and resolving issues\nGood communication and collaboration skills - you'll be working closely with other engineers and stakeholders\nBonus points for experience with CI/CD pipelines, Docker, Apache Airflow, and/or Apache Beam\n\n\nBenefits\n\n\nThis is a rare opportunity to influence positive change within one of the biggest societal challenges of our generation: sustainable public infrastructure\nYou get to support a disruptive solution with a compelling value proposition into an industry that is eager to hear from you and in a market with no direct competition\nWe live at the cross section of infrastructure, scaleup and data science/AI. There is no other team like us in Toronto\nThere is no corporate bureaucracy here. You will accomplish more here in a few months than what you would in a few years at a large, entrenched technology company\nWe believe that Data and AI will play an outsized role in our future, so we equip every team member with access to Generative AI tools and our full Data Universe to enhance their productivity and encourage innovation through experimentation\nWe are proud to offer every CityZen an internal mentorship program, in-role professional growth, skill-based development & learning, and internal promotion opportunities\nWe work hard, we play together, we win as a team! We are on a mission to solve infrastructure while savoring the moment and celebrating the little details along the way",
    "easy_apply": true,
    "posted_date": "1 hour ago",
    "scraped_at": "2025-10-10T16:53:20.403224-04:00"
  },
  {
    "title": "Software Engineer (entry)",
    "company": "Jerry",
    "location": "Greater Toronto Area, Canada (Remote)",
    "job_id": "4310731944",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310731944&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=BDzGmF5CfOWZEk%2FP0SXaLQ%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYvn_mm1E4-P-Uf8nOXT5eoKg31BulToXRZTuEOzJifPPzzcgot59gdis3QfDTUBxadjtyYyLz5l4bDiRsZwZ1nPWdwhcqfQbF_tycUpsQmFaz3Q8Tj6myiZdFagxiEN68IZ0cVHY994s3c08Mje3kxMTPd_VJ1YEWZKaUJP8vTlmmX7lRVNe9C4_CaVxtZzWyIGT6f6omn1KU3vWVojJF0sNSAwNX1-RlfOtvbXRRq05oevBtNEzu0N6bbVvkbMyTBNhlf4KZNpd6LZ-DpNMaCLQ_6LSCiz6rxJoor6J9oUUBkt3-qG5xgQ24ENs6-6ELF68SVyGxMsvr4IZ14ovUteL6ILSHq5EM-PeAdsIaA0PycsLWZ8or-YwKLHrlpfFTzNkvFkcm1biaD8kBRAqsT_jqy3jgUYcM9FniydahVC0xGMD_Lhmua8haFeyKsZRukpzZifu75w6l0KJ4dnrYGglpUwPf-mZfZnPruqVsSIsoMDGUgV2N7DWuAYb",
    "description": "About the job\n\n👋 Hi there! If you're looking to make a real-world impact fast while leveling up your skills in a high-growth startup, we might be the right place for you!\n\n🚗 Why join Jerry?\n\nWe’re Jerry, and we’re building the first AI-powered AllCar™ app to completely rethink what it means to own a car. Car insurance, maintenance, repairs, financing—we’re simplifying it all into one seamless mobile experience. Our users already save over $1,000/year with us, and we’ve grown revenue 60x in the last 5 years.\n\nNow we’re scaling from 5M to 50M users, and we need sharp, curious engineers to help us get there.\n\n🌟 Here’s What You’ll Get\n\n✅ Impact from Day One — you’ll be writing production code within your first few weeks.\n\n✅ Backed and booming — we’ve raised $240M+ and are cash-flow positive.\n\n✅ Modern tech stack — React, Node, Python, AWS, TypeScript, and more.\n\n✅ Mentorship + learning — work with top engineers from companies like Nvidia, TikTok, and Cepton.\n\n✅ Merit-based growth — no seniority theater here. You grow fast if you deliver and learn fast.\n\n🫵 What you’ll be working on\n\nYou’ll join one of our engineering pods (core app, retention, automation) depending on your interests and skills. Every team ships regularly, works closely with product, and contributes to a mission that matters.\n\nWe don’t expect you to know everything on day one, but we do expect:\n\n\nA love for learning\nComfort with ambiguity\nHustle and curiosity\nPride in building high-quality, user-first software\n\n\n💻 Our Stack\n\n\nFrontend: React, React Native\nBackend: NodeJS + TypeScript\nInfra: AWS, Go, Python, Docker, CI/CD\nData: Redis, Postgres, DynamoDB, Clickhouse\nAI/ML: Python pipelines, LLM integrations, internal models\n\n\nYou don’t need to know it all—but if some of that excites you, let’s talk.\n\n🚀 What We’re Looking For\n\n\nBachelor’s degree in Computer Science, Engineering, or a related field \nInternship, co-op, or side project experience is a plus—but not required\nEagerness to learn, build, and grow\n\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nThe successful candidate’s starting pay will fall within the pay range listed on this job posting, determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Ranges are market-dependent and may be modified in the future. In addition to base salary, the compensation may include opportunities for equity grants. \n\nWe offer a comprehensive benefits package to regular employees, including health, dental, and vision coverage, paid time off, paid parental leave, 401(K) plan with employer matching, and wellness benefits, among others. Equity opportunities may also be part of your total rewards package. Part-time, contract, or freelance roles may not be eligible for certain benefits.\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "easy_apply": false,
    "posted_date": "1 hour ago",
    "scraped_at": "2025-10-10T16:53:23.406605-04:00"
  },
  {
    "title": "Software Engineer (entry)",
    "company": "Jerry",
    "location": "Toronto, ON (Remote)",
    "job_id": "4310741682",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310741682&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=n0nHoImk2rvkH6Hu3jvAwA%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYubI60hFvvP6ilWhRrLoTfxc55EL5IY90yeKfEF-1RJDx4oYQBKi6jc79KLONT-R3ZxpnzVcgx3D7EJyKHl_GCFIML0IMTM9kszCz-XA9G0bzlQb4-OqNhJJTEV_9bb5RwHUUIjIGEsI2H13fDo4J7D6vtIQCFG0VhxWCtRirahpK1QUW2Uqm4pvG-x6fJDO51vgwnRpngPOa37p7wRhV6uI8aD9WD2CxzEJCiPd59nc7kb4hBCevJcz21Ct1VshV7MyJJRS6sbJwEHs6yG1cw-p7Z5Y5qsRCvItTkbXq8PygySAYZ158zRCIaIaOmQK0z4eY6f-NSp6o7HFjwoT2Tb80KDfiaAjGAYC29bICnKLPYBRI8q68PwTZiMZgfzcw8g0jEKYdd2WzcEjMvoC9dM6wuGkhNfMYSteyGkju360D36cKya4ZLz-BU2ilBux4Que3OjMxROPRx43n0YYZGTfR44R8ODtxBvxs185rZPFuI47iogkbpA8CbbG",
    "description": "About the job\n\n👋 Hi there! If you're looking to make a real-world impact fast while leveling up your skills in a high-growth startup, we might be the right place for you!\n\n🚗 Why join Jerry?\n\nWe’re Jerry, and we’re building the first AI-powered AllCar™ app to completely rethink what it means to own a car. Car insurance, maintenance, repairs, financing—we’re simplifying it all into one seamless mobile experience. Our users already save over $1,000/year with us, and we’ve grown revenue 60x in the last 5 years.\n\nNow we’re scaling from 5M to 50M users, and we need sharp, curious engineers to help us get there.\n\n🌟 Here’s What You’ll Get\n\n✅ Impact from Day One — you’ll be writing production code within your first few weeks.\n\n✅ Backed and booming — we’ve raised $240M+ and are cash-flow positive.\n\n✅ Modern tech stack — React, Node, Python, AWS, TypeScript, and more.\n\n✅ Mentorship + learning — work with top engineers from companies like Nvidia, TikTok, and Cepton.\n\n✅ Merit-based growth — no seniority theater here. You grow fast if you deliver and learn fast.\n\n🫵 What you’ll be working on\n\nYou’ll join one of our engineering pods (core app, retention, automation) depending on your interests and skills. Every team ships regularly, works closely with product, and contributes to a mission that matters.\n\nWe don’t expect you to know everything on day one, but we do expect:\n\n\nA love for learning\nComfort with ambiguity\nHustle and curiosity\nPride in building high-quality, user-first software\n\n\n💻 Our Stack\n\n\nFrontend: React, React Native\nBackend: NodeJS + TypeScript\nInfra: AWS, Go, Python, Docker, CI/CD\nData: Redis, Postgres, DynamoDB, Clickhouse\nAI/ML: Python pipelines, LLM integrations, internal models\n\n\nYou don’t need to know it all—but if some of that excites you, let’s talk.\n\n🚀 What We’re Looking For\n\n\nBachelor’s degree in Computer Science, Engineering, or a related field \nInternship, co-op, or side project experience is a plus—but not required\nEagerness to learn, build, and grow\n\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nThe successful candidate’s starting pay will fall within the pay range listed on this job posting, determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Ranges are market-dependent and may be modified in the future. In addition to base salary, the compensation may include opportunities for equity grants. \n\nWe offer a comprehensive benefits package to regular employees, including health, dental, and vision coverage, paid time off, paid parental leave, 401(K) plan with employer matching, and wellness benefits, among others. Equity opportunities may also be part of your total rewards package. Part-time, contract, or freelance roles may not be eligible for certain benefits.\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "easy_apply": false,
    "posted_date": "1 hour ago",
    "scraped_at": "2025-10-10T16:53:26.839844-04:00"
  },
  {
    "title": "Software Engineer I (entry)",
    "company": "Jerry",
    "location": "Greater Toronto Area, Canada (Remote)",
    "job_id": "4310732932",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310732932&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=sE76YWLZF%2FENxUcyybFyxA%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYl-LNp_-Gv9tcuED-tPpR8Y4gZM6VLzjo_qHw-PeM-EXDA8K5whXy4wpuQqGGkmfKc_-73tI4PRmtaBIzLJB-EGDeNozKllTtDtggbGXG91ldSUFan9pa7ZTBSNHehoKSr54zDJs4IqWH9wj8nqX61BhUjFfL59APYtZ9stmXxTzA4_UoTjXuDUkn4nCD4bfKNfTUBAjikJNPNahRczyotLYmgPbjh475KRJMFTTMO3KMf1JcCxwGzyHDAjfSnSsGOYjFTY1q5gMgPxwNhWdMU6sAnl71cB8bUtrBiCNP3paIB5AoI6ivFdL-YGN20VDXKPVPZUhXcL1gUren3HcNMHq2ji_VNl-czfV4olJPrPPrf9H_YDv2HZ_gpfwybWI_UyswweXVZ0uC5LGHo8RTK080LjdXLpKm0SWw8d-WycclbJEcb7LOJcqMxnxtsk14wC-RpvXE8qFG4GRoWobooTwwgJSsckNaFmyDNmCD7ybHseDJnHX1nBeOzdJ",
    "description": "About the job\n\n👋 Hi there! If you're looking to make a real-world impact fast while leveling up your skills in a high-growth startup, we might be the right place for you!\n\n🚗 Why join Jerry?\n\nWe’re Jerry, and we’re building the first AI-powered AllCar™ app to completely rethink what it means to own a car. Car insurance, maintenance, repairs, financing—we’re simplifying it all into one seamless mobile experience. Our users already save over $1,000/year with us, and we’ve grown revenue 60x in the last 5 years.\n\nNow we’re scaling from 5M to 50M users, and we need sharp, curious engineers located in the Toronto area to help us get there.\n\n🌟 Here’s What You’ll Get\n\n✅ Impact from Day One — you’ll be writing production code within your first few weeks.\n\n✅ Backed and booming — we’ve raised $240M+ and are cash-flow positive.\n\n✅ Modern tech stack — React, Node, Python, AWS, TypeScript, and more.\n\n✅ Mentorship + learning — work with top engineers from companies like Nvidia, TikTok, and Cepton.\n\n✅ Merit-based growth — no seniority theater here. You grow fast if you deliver and learn fast.\n\n🫵 What you’ll be working on\n\nYou’ll join one of our engineering pods (core app, retention, automation) depending on your interests and skills. Every team ships regularly, works closely with product, and contributes to a mission that matters.\n\nWe don’t expect you to know everything on day one, but we do expect:\n\n\nA love for learning\nComfort with ambiguity\nHustle and curiosity\nPride in building high-quality, user-first software\n\n\n💻 Our Stack\n\n\nFrontend: React, React Native\nBackend: NodeJS + TypeScript\nInfra: AWS, Go, Python, Docker, CI/CD\nData: Redis, Postgres, DynamoDB, Clickhouse\nAI/ML: Python pipelines, LLM integrations, internal models\n\n\nYou don’t need to know it all—but if some of that excites you, let’s talk.\n\n🚀 What We’re Looking For\n\n\nBachelor’s degree in Computer or Software Engineering, or a related field\nInternship, co-op, or side project experience is a plus—but not required\nEagerness to learn, build, and grow\n\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nThe successful candidate’s starting pay will fall within the pay range listed on this job posting, determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Ranges are market-dependent and may be modified in the future. In addition to base salary, the compensation may include opportunities for equity grants. \n\nWe offer a comprehensive benefits package to regular employees, including health, dental, and vision coverage, paid time off, paid parental leave, 401(K) plan with employer matching, and wellness benefits, among others. Equity opportunities may also be part of your total rewards package. Part-time, contract, or freelance roles may not be eligible for certain benefits.\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "easy_apply": false,
    "posted_date": "1 hour ago",
    "scraped_at": "2025-10-10T16:53:29.938991-04:00"
  },
  {
    "title": "Software Engineer I (entry)",
    "company": "Jerry",
    "location": "Toronto, ON (Remote)",
    "job_id": "4310748519",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310748519&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=04fWbUFA6HW1R%2BSxjIjWhw%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYgn7MSRIe-FvSCsJlnKIrw5gq1kXo0ltcpuV-xNT51542_sAKX1asGC4iH3Lf94Zo5ht8d9Dh5kbXQHlD7Ge1odcXT-GJDqHVgnNlkC4LBBczrTPzVR8YWZDoLWZ5XD4BsN7_Oa24yUTLvQbOmXNxBS3-HWmpTVAL508m62LqgsVlUYa59ydY-Qj4fXpSUDsZjCWfwXvPizi4Nm7mvZVyYYGPfNK_IEliP9pjk69HxWl_brCFPVMAgCxZMdRlu4X-S9BpVRz6ThpLUvdotHaswzsOlSvy5ETgH3tNxJHg3iSzD93Xx-KErKYDvmEjfgifiRuvlzG5RBlHWeCWHovZvbN2-BrYzFpWjjoibNYuxy829zsBHaDGk7RAPgkB0zDtErgXoHTRirfDM7FcXba0ySiZbRZZCMX9ihGeXXaocrUDEGPlR03g28kG1NuPBi56_obm8UyouHVB7LkT7X6ZM3havwfqP__TuUZ5jS2CaPlYO8oeD-hDZOthA",
    "description": "About the job\n\n👋 Hi there! If you're looking to make a real-world impact fast while leveling up your skills in a high-growth startup, we might be the right place for you!\n\n🚗 Why join Jerry?\n\nWe’re Jerry, and we’re building the first AI-powered AllCar™ app to completely rethink what it means to own a car. Car insurance, maintenance, repairs, financing—we’re simplifying it all into one seamless mobile experience. Our users already save over $1,000/year with us, and we’ve grown revenue 60x in the last 5 years.\n\nNow we’re scaling from 5M to 50M users, and we need sharp, curious engineers located in the Toronto area to help us get there.\n\n🌟 Here’s What You’ll Get\n\n✅ Impact from Day One — you’ll be writing production code within your first few weeks.\n\n✅ Backed and booming — we’ve raised $240M+ and are cash-flow positive.\n\n✅ Modern tech stack — React, Node, Python, AWS, TypeScript, and more.\n\n✅ Mentorship + learning — work with top engineers from companies like Nvidia, TikTok, and Cepton.\n\n✅ Merit-based growth — no seniority theater here. You grow fast if you deliver and learn fast.\n\n🫵 What you’ll be working on\n\nYou’ll join one of our engineering pods (core app, retention, automation) depending on your interests and skills. Every team ships regularly, works closely with product, and contributes to a mission that matters.\n\nWe don’t expect you to know everything on day one, but we do expect:\n\n\nA love for learning\nComfort with ambiguity\nHustle and curiosity\nPride in building high-quality, user-first software\n\n\n💻 Our Stack\n\n\nFrontend: React, React Native\nBackend: NodeJS + TypeScript\nInfra: AWS, Go, Python, Docker, CI/CD\nData: Redis, Postgres, DynamoDB, Clickhouse\nAI/ML: Python pipelines, LLM integrations, internal models\n\n\nYou don’t need to know it all—but if some of that excites you, let’s talk.\n\n🚀 What We’re Looking For\n\n\nBachelor’s degree in Computer or Software Engineering, or a related field\nInternship, co-op, or side project experience is a plus—but not required\nEagerness to learn, build, and grow\n\n\nWhile we appreciate your interest and application, only applicants under consideration will be contacted.\n\nJerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. \n\nJerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai\n\nThe successful candidate’s starting pay will fall within the pay range listed on this job posting, determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Ranges are market-dependent and may be modified in the future. In addition to base salary, the compensation may include opportunities for equity grants. \n\nWe offer a comprehensive benefits package to regular employees, including health, dental, and vision coverage, paid time off, paid parental leave, 401(K) plan with employer matching, and wellness benefits, among others. Equity opportunities may also be part of your total rewards package. Part-time, contract, or freelance roles may not be eligible for certain benefits.\n\nAbout Jerry.ai\n\nJerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets.\n\nBacked by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all.\n\nWe are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started.\n\nJerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing.\n\nJoin our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "easy_apply": false,
    "posted_date": "1 hour ago",
    "scraped_at": "2025-10-10T16:53:36.076396-04:00"
  },
  {
    "title": "AI-Native Software Engineer",
    "company": "CookUnity",
    "location": "North York, ON (Hybrid)",
    "job_id": "4312817880",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312817880&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=tNo1ICLWeY98HlvpbjOd3Q%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=NOT_ELIGIBLE_FOR_CHARGING",
    "description": "About the job\n\nAbout CookUnity\n\nFood has lost its soul to modern convenience. And with it, it has lost the power to nourish, inspire, and connect us. So in 2018, CookUnity was founded as the first-of-its-kind platform that connects the world with the source of truly great food: chefs. Today, CookUnity delivers 50 million meals a year from the industry’s best chefs to homes all over the country. Fresh. Ready-to-eat. And crafted with the passion that nourishes body and soul.\n\nUnwilling to stop there, CookUnity is expanding beyond delivery to become an ever-innovating marketplace focused on our singular mission: empower Chefs to nourish the world.\n\nIf that mission has you hungry in more ways than one, you’ve found the right job posting.\n\nAbout The Team\n\nOur platform team is reimagining how people discover and enjoy amazing food. We're not just rebuilding our platform, we're rebuilding how we build. We move fast, prototype often, and believe the best code comes from shipping early and iterating fast. We're a small team that values technical curiosity, rapid experimentation, and engineers who have strong opinions (loosely held) about how AI changes everything.\n\nThe Role\n\nWe're looking for an AI - Native Engineer who grew up with LLMs as their coding companion. You're the person your classmates asked \"how did you build that so fast?\" You've been using Claude, GPT, and Cursor since they launched. You have opinions about prompt engineering, RAG patterns, and which model is best for what. Most importantly, you ship constantly.\n\nThis role is perfect for a recent grad or early-career engineer who builds faster with AI than most seniors build without it. You'll be our secret weapon, helping PMs prototype their wildest ideas and teaching the entire team how to 10x their velocity with AI tools.\n\nResponsibilities\n\n\nShip production code daily using AI-assisted development - Cursor, Windsurf, Claude Code, etc.)—you know which tool for which task\nPartner with PMs to rapidly prototype their ideas, turning \"what if we could...\" into working demos in hours, not weeks.\nBuild internal tools and automations that make everyone faster—from chef onboarding bots to menu analysis pipelines.\nCreate reusable patterns and templates for LLM integration that other engineers can leverageRun experiments with new AI models and tools, becoming the team's go-to expert on what's possible.\nWrite clean, maintainable code (with AI's help). You know when to let Copilot write and when to take the wheelTeach PMs and designers how to prototype with v0, Bolt, and Claude—democratizing the ability to build.\nContribute to technical decisions by building proof-of-concepts that answer \"can we?\" before we debate \"should we?\".\nDocument AI development patterns and create playbooks for the broader team\n\n\nQualifications\n\n\n3 years of professional experience (but you've been building things since before you could legally work)\nPortfolio of projects built with AI assistance. We want to see your GitHub, not your GPA.\nFluent in modern AI development tools (you have opinions on Cursor vs Windsurf vs Continue).\nProven ability to integrate LLMs into real applications - OpenAI, Anthropic, open source models)\nStrong foundation in at least one programming language - Python, Kotlin, TypeScript, or similar).\nExperience with React, Next.js, or similar frameworks—you can build full-stack with AI's help.\nNatural teacher—you can explain to a PM how to use Claude to prototype, or help a senior engineer understand prompt engineering.\nShip-first mentality: you'd rather deploy something imperfect today than something perfect next monthActive in AI communities: Twitter, Discord, Reddit)—you know what dropped yesterday and have probably already tried it.\nComfortable with ambiguity—you figure things out by building, not by waiting for requirements.\n\n\nPreferred Requirements\n\n\nPersonal projects using AI that went viral, got users, or solved real problems.\nContributions to open source AI projects or published experimentsExperience fine-tuning models, MCP or building RAG systems.\nBuilt and deployed your own AI products (even if they failed—we want builders).\nWrote about AI development (blog posts, tutorials, Twitter threads).\nWon hackathons or shipped side projects with real users.\nLocated in Toronto or willing to work hybrid from our Toronto office.\n\n\nWhat Makes You Perfect For This Role\n\n\nYou've been using ChatGPT/Claude/Gemini since day one and have strong opinions about prompting and eval strategies.\nYou can build a working prototype faster than most people can write a PRD.\nYou're genuinely excited about AI, not just as a buzzword, but as a fundamental shift in how we build.\nYou're teaching yourself new AI tools every weekYou see PMs struggling to articulate ideas and think \"I could build that for you in 20 minutes\"\n\n\nLearn More About CookUnity\n\nWe believe great leadership starts with alignment on vision, values, and ways of working. To give you deeper insight into who we are and what we’re looking for, we invite you to explore: CookUnity's Leadership Principles – The values and behaviors that guide how we operate, collaborate, and scale.\n\nWe hope this provides valuable insight into our culture and product vision. If this excites you, we’d love to connect!\n\nBenefits\n\nUS BENEFITS\n\n🩺 Health Insurance coverage\n\n🌅 401k Plan\n\n⛱ PTO policy and paid sick days\n\n🗓️ 5- year Sabbatical: After 5 years with CookUnity, you get a 4-week paid sabbatical\n\n🐣 Paid Family leave\n\n🕯 Compassionate Leave: 3-5 days each time the need arises\n\n🥘 A generous amount of CookUnity credits to enjoy our amazing meals, added to your account, monthly\n\n🧘🏽‍♀️ Wellness perks: access to fitness subsidies to build a healthy lifestyle\n\n👩🏾‍🏫 Personalized Spanish coach\n\n🚀 Awesome opportunity to join a company that is looking to change how we eat and how chefs work!\n\nCanada Benefits\n\n🩺 Health Insurance coverage (Canada Life)\n\n⛱ Flexible Paid Time Off\n\n🗓️ 5- year Sabbatical: After 5 years with CookUnity, you get a 4-week paid sabbatical\n\n🐣 Paid Family leave.\n\n🕯 Compassionate Leave: 3-5 days each time the need arises\n\n🥘 A generous amount of CookUnity credits to enjoy our amazing meals, added to your account, monthly.\n\n🧘🏽‍♀️ Wellness perks: fitness subsidies to build a healthy lifestyle\n\n👩🏾‍🏫 Personalized Spanish coach\n\n🚀 Awesome opportunity to join a company that is looking to change how we eat and how chefs work!\n\nIf you’re interested in this role, please submit your application and if we think you might be a fit, we'll get in touch with you. Thank you for your time!\n\nCookUnity is an Equal Opportunity Employer. We are dedicated to creating a community of inclusion and an environment free from discrimination or harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, citizenship status, protected veteran status, genetic information, or physical or mental disability.",
    "easy_apply": false,
    "posted_date": "5 hours ago",
    "scraped_at": "2025-10-10T16:53:40.321022-04:00"
  },
  {
    "title": "CCAI Developer",
    "company": "Ad Analytica",
    "location": "Toronto, ON (Hybrid)",
    "job_id": "4312864250",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312864250&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=Jk%2FnQmI2B0qlKdMQYs%2Bj4Q%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYkOm1hTU_rRi0YGOt_UEIRHZkH1w0DM4BIyAcgRgw5jsjDKSeNZbgbBBHj6zOyj1-G65NsiBsaKU1Lq-JSchpkOpmTP2bldwM1r16oWRwtJNVY5YX-VJxPx75WjN3Kb7tOHM1_b9D0ocKK3NbBWiluuCdDqRoUax4c9pdnEZcxpi35bRE2d3V7UxnQv2CFtqbqLzgy7IqNYjKbbl1Bc5fBc5OwTQzFO_aZ59IGp8-neq5KUQYeee98brOQY29TWdI-p-czm1TS-rcIQzVMbuQXFWst8adWDKn98E89DrxexCQ9KlMxRiuQ5VUV50Uyl7VHqnH7F-Ny0qCkWWMsBA11wCq0xOuJMbXN6F3vzpxHIe4vCZkdABi7eS5eXlzWUS_v5v1M5HT1iqQbDp2qV70iFLN2pk74yWFv-_gqhkzjOaqB2c0-7Dcd3hLPHbg_ZAuZCSr4MYX6SL56qA9lQaahLmD78sGRTYv3fuDlE",
    "description": "About the job\n\nPosition: CCAI Developer \n\nLocation: Remote in Canada. Must be eligible to work in Canada. \n\nEmployment type: Permanent or Contractual\n\nNo of positions: 2\n\n\n\n\nKey Responsibilities:\n\nDesign and maintain advanced Dialogflow ES/CX agents, including the development of multi-turn conversational flows, intents, entities, and fulfillment logic for voice and chat experiences.\nCraft effective and natural conversational scripts, optimized for accurate Natural Language Understanding (NLU) and resilient error-handling strategies.\nDeploy and manage Google Cloud Contact Center AI (CCAI) solutions for both chatbots and voice assistants, ensuring seamless customer engagement across channels.\nIntegrate Dialogflow ES/CX and CCAI with enterprise backend systems via APIs to enable end-to-end automation and data synchronization.\nConduct user research and analyze interaction data (e.g., chat transcripts, performance logs) to uncover pain points and drive iterative improvements in the conversational experience.\n\n\n\n\nQualifications:\n\n3–5 years of hands-on experience with Dialogflow CX, IBM Watson, or Amazon Lex, including deployment, optimization, and maintenance of production-grade virtual agents.\nStrong understanding of Natural Language Understanding (NLU), Natural Language Generation (NLG), and Large Language Models (LLMs).\nProficiency in programming languages — particularly Python — for Dialogflow CX fulfillments and integrations.\nBackground in conversational design, UX writing, or content strategy with a focus on human–AI interaction.\nFamiliarity with conversation analytics (e.g., confusion matrix, containment rate, deflection rate) and the ability to apply insights to improve performance.\nProficient in visualizing conversational flows using tools such as Figma or Miro.\nExperience with performance tuning to enhance agent effectiveness.\nExceptional written and verbal communication skills, with the ability to craft natural, empathetic, and brand-aligned dialogue.\n\n\n\n\nPreferred Attributes:\n\nBilingual (English/French).\nDemonstrated portfolio of Conversational AI projects.\nAbility to manage multiple projects concurrently with strong attention to detail and commitment to excellence.\nAnalytical mindset with strong problem-solving abilities to identify and resolve conversation-related issues.\nTeam-oriented with excellent collaboration skills across both technical and non-technical teams.\nStrong mentorship skills and a willingness to support and elevate other team members.\n\n\n\n\nEducation:\n\nBachelor’s degree in Computer Science, Artificial Intelligence, Machine Learning, Linguistics, Cognitive Science, or a related field.",
    "easy_apply": true,
    "posted_date": "2 hours ago",
    "scraped_at": "2025-10-10T16:53:44.023332-04:00"
  },
  {
    "title": "Software Developer",
    "company": "IBM",
    "location": "Markham, ON (Hybrid)",
    "job_id": "4310263636",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310263636&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=Bdf3ypdWLtUsLUBovriEJw%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYlfsNu6iYoeo5AaGgzTJQMnIZBznwIY9Rku7-2O1LIjJCSmTnxoJKQH1NPfAUkKm0zXmGZBeljs9EuZU_GpYbxAovYJa0WOZbcOaNdKBFgxyMsd2K0AVXaN8a5IBSGWpozcDpM3dqhoWWP0IeXjw09_FeZ_AZ4ITA2Zbl-98Q6sdZgjMxeHdhsOl_TT9jCFi4r28ietRExifs623RE8FgxF8syT6M4btSbXgnCikQISOvxp8X301mePEFnw8Qr8ARdyCKOoHLu2IQFfxH90P7lpxb8xeFlPF6foxeEbnTMY8FdglC6VXk238_0tu4WES6WJv_ejScqGw3YINK_B8ctj8ouhMIXBKpWUA1EVvTYmBhtqOPmyCmpHc-H9tDHy-uLHdUqmMCxnSROR8e_OQoBd3NM-rd1E0aqTbj4nPiMkak9jTvcs4Fx8ZM5ODTRGRAyMCv27L2beorIrNqBjL4-i8oUR9XjP2swHeukyzj8eWVhycHhL6oh3LQEj0P9A",
    "description": "About the job\n\nIntroduction\n\nA career in IBM Software means you’ll be part of a team that transforms our customer’s challenges into solutions.\n\nSeeking new possibilities and always staying curious, we are a team dedicated to creating the world’s leading AI-powered, cloud-native software solutions for our customers. Our renowned legacy creates endless global opportunities for our IBMers, so the door is always open for those who want to grow their career.\n\nIBM’s product and technology landscape includes Research, Software, and Infrastructure. Entering this domain positions you at the heart of IBM, where growth and innovation thrive.\n\nYou will be joining the Java Insights for Hybrid Cloud team working on Cryostat- a container-native Java application based on JDK Flight Recorder (JFR) that is used to monitor Java Virtual Machine (JVM) performance for containerized workloads deployed on the Red Hat OpenShift container platform.\n\nYour Role And Responsibilities\n\n\nFull stack Development: Design, develop and maintain core components of Cryostat.\nCross-functional Collaboration: Work closely with Product, Quality Engineering and Documentation teams to ensure rigorous software standards are met throughout the development lifecycle. \nProactive Communication: Communicate with stakeholders across teams to identify and mitigate risks to meet deliverable timelines.\nCommunity Involvement: Engage in discussions with the Open source community. Evangelize team’s work through blogs, all hands meetings, and conference presentations.\n\n\nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\n\nWorking knowledge/experience in software development, demonstrating expertise in programming languages such as Java, Go and Typescript.\nOperate in a Linux / Unix environment, including being comfortable using the command line interface.\nWorked with standard development tools, such as git and understand what this tool is used for and why it is necessary.\n\n\nPreferred Technical And Professional Experience\n\n\nFamiliarity with cloud and container technologies including Docker, Podman, Kubernetes and Red Hat OpenShift.",
    "easy_apply": false,
    "posted_date": "18 hours ago",
    "scraped_at": "2025-10-10T16:53:47.125969-04:00"
  },
  {
    "title": "Software Developer (Java)",
    "company": "OpenText",
    "location": "Richmond Hill, ON (Hybrid)",
    "job_id": "4310747201",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310747201&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=0xfn2AVvHfWLEvphPtfpTg%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYu3x5RIvMyeaRuyMmhDbSYpR1PxdEi302iDc3r_kCsJjesxoBY3C9N76AOH99Ib3rgfZnwIq4Y89SuD6IEw6mFJOKdIXsYBJz7TRLDDU_u4lI19HVDdzyLIKcdGa5ua-PB1VvHu1K9cktzc61N_etGQNKlRkQju3rJr5-f6yYsV76_9ry76fvq6osd9das41qlX72wvTlIVWBhL-zcXfLGzAHLvn_vw0DC0H4M_T7t_OIIhQ57XbknyiQyq4Esgl8LEvHFX9WyL_OxIXLRUvPU_9kvUdPxigh4tfMlwyzSGusZ336FrdOFvKJo1p3WOYNRuRZyXRiix1Y_aqfgscBOFKaoOIPX0KIV-6WgqPPnEmPzx0HwB_Xe23cN0jz0E7w9T3agUovrvrLbsTeu4ZKEWuVxOva6NQ1rSq66tJH8iZSBxfFVS6If_ZYE5byK7yTZzvg4fuerCk28Y8QVvCbuI",
    "description": "About the job\n\nOpentext - The Information Company\n\nOpenText is a global leader in information management, where innovation, creativity, and collaboration are the key components of our corporate culture. As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation.\n\nAI-First. Future-Driven. Human-Centered.\n\nAt OpenText, AI is at the heart of everything we do—powering innovation, transforming work, and empowering digital knowledge workers. We're hiring talent that AI can't replace to help us shape the future of information management. Join us.\n\nOpenText™ Cloud Platform (OCP) is our next-generation Information Management as a Service platform that enables development and deployment of multi-tenant SaaS applications. We are looking for a motivated Software Developer with an interest in full stack and AI development to join our platform engineering team.\n\nThis position is based in the OpenText office in Richmond Hill, Canada.\n\nYour Impact\n\nWe are looking for an individual with a foundational understanding of software engineering and a strong desire to build skills in full stack and AI development. You are eager to learn and contribute within a supportive team of experienced engineers.\n\nWorking under the guidance of senior team members, you will contribute to the development and integration of AI capabilities and robust backend services. This is an excellent opportunity to grow your skills and contribute to a highly scalable, reliable, and intelligent platform.\n\nWhat The Role Offers\n\n\nLearning about business, product, and technical challenges with a curious and analytical mindset.\nAssisting in the implementation of full stack and AI-driven software components within our cloud platform.\nActively participating in problem-solving and contributing to solutions as part of a team.\nWorking as part of a multi-disciplinary Agile team to deliver on team goals and the product roadmap.\nCollaborating with team members across different geographies.\n\n\nWhat You Need To Succeed\n\n\nAt least 2 years of professional experience in software development.\nBachelor's degree in computer science, software engineering, or a related field, or equivalent practical experience.\nFoundational knowledge and practical experience with Javascript, REACT or Angular, Java (Spring Boot) and Python for application development.\nUnderstanding of microservices architecture and API development principles.\nExposure to frontend and backend development with Javascript, REACT, Spring Boot and testing frameworks like JUnit.\nInterest in/or academic exposure to AI concepts, with a desire to work with technologies like LangChain and Retrieval-Augmented Generation (RAG).\nFamiliarity with cloud platforms (AWS, GCP) and core services.\nBasic understanding of containerization (Docker) and CI/CD concepts.\nA focus on writing clean, testable code and a growing understanding of scalability and security principles.\nFamiliarity with Agile development methodologies and a team-oriented mindset.\nGood communication skills and the ability to articulate technical concepts clearly.\n\n\nOne Last Thing\n\nOpenText is more than a corporation—it’s a global community built on trust, character, and purpose. Here, we act ethically, care deeply about people, and always put our customers first. We help teams succeed through collaboration, tackle challenges with resilience, and innovate with intention.\n\nJoin us on our mission to drive positive change through privacy, technology, and teamwork. At OpenText, we don’t just have a culture—we live our values. Choose us because you want to be part of a company that empowers you to make a meaningful impact.\n\nOpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws.\n\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com. Our proactive approach fosters collaboration, innovation, and personal growth, enriching OpenText's vibrant workplace.",
    "easy_apply": false,
    "posted_date": "2 hours ago",
    "scraped_at": "2025-10-10T16:53:52.297253-04:00"
  },
  {
    "title": "UI/UX Developer",
    "company": "Charger Logistics Inc.",
    "location": "Brampton, ON (On-site)",
    "job_id": "4312794091",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312794091&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=CjDALpB%2BMARyVZoaB0we1g%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYsOcw_lqINI9HTicyr6d5gRcaHbKq1X3IF67Aj7WRO3HB9w5DcBrnWIigXMZLb0xRlHxidSEP3mAZ3vitXA4vcStgdNe91lrWkQEv6Y0Pmy5kIU1uz7DTHJcGR45t_1wLACyabUdNKYGLsAwxqpjwTKdK-zIW5XteU97xammVx0UiswAFBpPwYBcj4DRYaxqWaHqr5ZFaD-Y9X4wXj5RI9SsOaKdyY9LHwVNqYw3C4fuDuRXJvpVIHbi1cZOApwe056TBYAg-afgo2sTQOiFY6q8Ry35ObwUG31Bcgjg7Ick97K3opLr4qwkt1Mnx1X4242SHSv-YkxlQyGNlYuol24J7kLaJ-PJ5PCl5gX-_ImjMvuXw45vJyxB_Zm8L4A4OUvqaGh_uwB6-df7kVKrhdTca1jQy9SS1VYP5bo2_8NmZYLti5ZLOjisTC79bwew2lnMvrPADf6UE-1U-VuVvS0R2pSlLNUoIivrfmxKnI280XsgdIXB8wRjEv23iQk",
    "description": "About the job\n\nCharger logistics Inc. is a world- class asset-based carrier with locations across North America. With over 20 years of experience providing the best logistics solutions, Charger logistics has transformed into a world-class transport provider and continue to grow.\n\nCharger logistics invests time and support into its employees to provide them with the room to learn and grow their expertise and work their way up. We are entrepreneurial-minded organization that welcomes and support individual idea and strategies. We are looking for an organized and motivated individual to join our dynamic team as a UI/UX Developer for our Brampton, ON office.\n\nResponsibilities: \n\n\nDesign & AI Integration\n\nCreate engaging UI/UX designs using AI-assisted tools (Framer AI, Figma AI plugins).\nBuild interactive prototypes leveraging AI for rapid iteration.\nImplement prompt engineering best practices for AI-powered features.\nDesign conversational interfaces and AI-driven user experiences.\n\nDevelopment\n\nBuild responsive web applications using React and Tailwind CSS.\nDevelop cross-platform mobile apps with React Native.\nImplement state management with Redux.\nIntegrate Firebase Auth for secure authentication.\nDesign and implement Firestore database schemas and real-time data flows.\nUse AI-powered development tools (GitHub Copilot, Cursor) for efficient coding.\n\n\n\nRequirements\n\n\nCore Technical Stack\n3+ years of Ui/Ux Designing experience. \nStrong Redux and state management experience.\nTailwind CSS for responsive design.\nTypeScript/JavaScript (ES6+).\nAI & Innovation\nHands-on experience with prompt engineering.\nProficiency in AI-assisted design tools (Framer AI).\nExperience building AI-powered features (chatbots, content generation, smart forms).\nFamiliarity with AI development tools for code generation.\nNice to Have:\nFirebase ecosystem (Auth, Firestore).\nExperience integrating LLMs (OpenAI, Claude API).\nKnowledge of vector databases for AI applications.\nUnderstanding of AI/ML concepts for frontend implementation.\n\n\n\nBenefits\n\n\nHealth Benefits\nCareer Growth\nHigh Competitive Salary",
    "easy_apply": true,
    "posted_date": "23 hours ago",
    "scraped_at": "2025-10-10T16:53:55.418531-04:00"
  },
  {
    "title": "R&D Engineer II",
    "company": "Synopsys Inc",
    "location": "Waterloo, ON (On-site)",
    "job_id": "4313283581",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4313283581&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=vawZtEICnRry%2B%2F1Hjwx0Ug%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYgG3jYJRJRGaEMoJzFUXhsvDNV65SaAmVML5eKhBHbWYtEwX-_zoD3aGcWZyt0GmEXGFXedREFCbgrP0dr_XuZS9DvgcciVwTZkGQmSNFOeY9KKIIhQ9zJzB5TU5NVxnwyBxIDcFXmNgL58RcdcFtrGjTOEyPyhqsQpexBg99F7l3YJNHRiuD55YcE09Km3J7ZZG4_yd7zWuoN1Hi2XsyipF7i_bFqurtH8Df8Znz5pvXwwUbMnS3swJn5BESOpn_UqkQxW51YR3o4J12wU72EfrJXzCDemiIHnOa0EbMghFtBcGqQnP0FFzrw_hsDU0nG2-v4JGrwaKClSny6N1zEcgnd3-2gdL4a_24MXZ5DWKTOH9MjZDGS1CR5QDq8pVpAam_l4MRNmKrnpGV7p0kAOh8wsd2RB6kTlNWor2VqyAeLIIkHGkAHW4KNoyUBJ3Z20zGunV1KlnfcjKLBXxMCRo_8ArMvhu4C891oWHbD2gfK6emAnZGVTm106a",
    "description": "About the job\n\nSummary / Role Purpose\n\nANSYS is seeking a software engineer to enhance the graphics and post processing features in its industry-leading electromagnetic simulation products. The successful candidate will perform design, development and maintenance of 3D and 2D visualization and post processing components for various desktop applications in a highly collaborative, multidisciplinary team environment.\n\nKey Duties And Responsibilities\n\n\nPerform software development activities in areas including GUI, 3D and 2D visualization, post processing, software design and user experience.\nEmploy best software practices.\nInvestigate problems discovered by QA or product support and develop solutions. Perform bug verification and release testing.\nUnderstand the requirements for a product, including target environment, performance criteria, and competitive issues.\n\n\nMinimum Education Requirements And Experience\n\n\nBS in Computer Science, Engineering, or related field with 2 years’ experience or Masters Degree\nWorking experience with in technical software development proven by academic, research, or industry projects. Good understanding and skills using C++ or related language.\nStrong computer science fundamentals\n\n\nPreferred Qualifications And Skills\n\n\nExperience working for interactive 3D application. Knowledge of 3D graphics pipeline and OpenGL is desired.\nExperience developing and debugging code on Windows and/or Linux.\nKnowledge of WPF or equivalent GUI technology is highly desirable.\nFamiliarity with the entire development process, including specification, documentation, quality assurance, and use of software engineering tools.\nStrong technical knowledge in software development methodologies with experience in project planning and implementation. Ability to complete high quality work on schedule.\nFamiliarity with",
    "easy_apply": false,
    "posted_date": "56 minutes ago",
    "scraped_at": "2025-10-10T16:54:01.395134-04:00"
  },
  {
    "title": "Software Engineer II",
    "company": "Microsoft",
    "location": "Toronto, ON (Remote)",
    "job_id": "4313294595",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4313294595&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=5pnw5lpIT%2FHkZ%2BC%2FOxgPlg%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=NOT_ELIGIBLE_FOR_CHARGING",
    "description": "About the job\n\nMicrosoft Azure has the most secure public cloud network. As part of the Azure Software Defined Networking (SDN) team our focus is to build advanced next generation super service which protects infrastructure and ensures customer services function securely at large scale.\n\nAs a Software Engineer II on this team, you’ll collaborate with other talented developers to build ultra-low latency, distributed, and fault-tolerant network security software solutions at scale. We are seeking a Software Engineer II to join us. This role offers a great opportunity to accelerate your career growth and deepen your expertise in building and delivering distributed systems at scale.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system/product feature/service for degradation, downtime, or interruptions and gains approval to restore system/product/service for simple problems.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\n\n\nQualifications\n\nRequired Qualifications:\n\n\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience working with Distributed Systems\n\nOther Requirements\n\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n\nPreferred Qualifications\n\n\nBachelor's Degree in Computer Science\nOR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n\nSoftware Engineering IC3 - The typical base pay range for this role across Canada is CAD $85,000 - CAD $166,800 per year.\n\nFind Additional Pay Information Here\n\nhttps://careers.microsoft.com/v2/global/en/canada-pay-information.html\n\nMicrosoft will accept applications for the role until October 17th, 2025.\n\n#azurecorejobs\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "easy_apply": false,
    "posted_date": "14 minutes ago",
    "scraped_at": "2025-10-10T16:54:07.145355-04:00"
  },
  {
    "title": "Software Engineer Packet Platform - New Grad",
    "company": "Ciena",
    "location": "Ottawa, ON",
    "job_id": "4312836321",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312836321&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=T99JC%2B6JugDQlNzVmgjvrQ%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPYh-xntg5jeX6ib9Xg4DL1sO-r7JiaIBWI_1uQ2woJPITI4OCbmHarM3C0wVPLemy5K9g48SCeAXW8y8misLKEAxKXiJbWLMOM3CCTpjRUJOfUAdvWXiiB-FtGlC18chcSM-62nzjO2LurN1mR7705tb0XYQrD6COCVXSwO-Yd3wR-jAmO8V0y8w9gonLCIfshcNjkSTYHcETMufEXsih67hzd-t-xXxiKBJTl2F_ZNii7ckVn4HCpzKUkcAVvemFw-TQqvDyG89AzsMIqsQe32QsvDbxke7Yk7Qib5Zosbfp0PsoavVB1sJ5fqAUOZL1JOi_xMoO2IYIHthBpVcjIDbdA2xBvjfkv_MgmTXSqgYGUgXz5xOeaZvp6qUfMN-Tz5wKWEu9tIurnG4huYQfrBN5BBFTn-sfgHbjNQ3ARWCUpO1cg9rvhSKrYu9gmPfXvdYcTjHpkeHo-3_h9gPS",
    "description": "About the job\n\nAs the global leader in high-speed connectivity, Ciena is committed to a people-first approach. Our teams enjoy a culture focused on prioritizing a flexible work environment that empowers individual growth, well-being, and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact.\n\nHow You Will Contribute\n\n\nDevelop applications that enhance the capabilities of the WaveRouter system/platform.\nDesign and implement embedded, real-time software solutions for telecommunications systems.\nWrite and test software code to ensure robust functionality.\nSupport testing activities during the release cycle for delivered features.\nCollaborate with design teams to develop on-switch applications and OAM software features supporting Optical/Ethernet-based initiatives.\n\n\nThe Must Haves\n\n\nCurrently pursuing a degree in Computer Science, Computer Engineering, or a related technical field.\nStrong problem-solving and analytical skills.\nAbility to contribute effectively to a team environment.\nProficiency in embedded C programming.\n\n\nNice To Haves\n\n\nExperience with programming languages such as C, C++, Python, Go, or BASH.\nFamiliarity with datacom and telecom concepts including Ethernet, TCP/IP, MPLS, DWDM.\nKnowledge of real-time software/firmware development and Linux-based development environments.\nExposure to CLI, SNMP, NETCONF, REST, gRPC protocols.\nHands-on experience with design and development tools such as Git, Eclipse, JIRA, Confluence, GDB, Yocto.\nFamiliarity with YANG modeling language and toolchains.\nInterest in automation and testing practices.\n\n\nPay Range\n\nThe annual pay range for this position is $ 69,400 - 110,800 CAD\n\nPay ranges at Ciena are designed to accommodate variations in knowledge, skills, experience, market conditions, and locations, reflecting our diverse products, industries, and lines of business. Please note that the pay range information provided in this posting pertains specifically to the primary location, which is the top location listed in case multiple locations are available.\n\nNon-Sales employees may be eligible for a discretionary incentive bonus, while Sales employees may be eligible for a sales commission. In addition to competitive compensation, Ciena offers a comprehensive benefits package, including medical, dental, and vision plans, participation in 401(K) (USA) & DCPP (Canada) with company matching, Employee Stock Purchase Program (ESPP), Employee Assistance Program (EAP), company-paid holidays, paid sick leave, and vacation time. We also comply with all applicable laws regarding Paid Family Leave and other leaves of absence.\n\nNot ready to apply? Join our Talent Community to get relevant job alerts straight to your inbox.\n\nAt Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n\nCiena is an Equal Opportunity Employer, including disability and protected veteran status.\n\nIf contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require.",
    "easy_apply": false,
    "posted_date": "4 hours ago",
    "scraped_at": "2025-10-10T16:54:10.965177-04:00"
  },
  {
    "title": "Technology Analyst - DevOps",
    "company": "Infosys",
    "location": "Mississauga, ON (On-site)",
    "job_id": "4310247989",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4310247989&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=hBcx%2B87sWcZeOoUtoRbmYw%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPY4RzuUDIxJoS99Wsq0Pyxt6A9cyqGmRHywr4atdBAKXx9L-4qfXKvUcXC2LWaS2T4MeewnlqVdb1ZwnqkzGQ1tTxvJV75-q_2DJHgeH1xsmiQXg8bTIJ2ALBl4E0iuXqmzolSyNRvtBTCSQlhirG77HyzMbelO5XvynQmm50JgB_P5islniTZ3gqXzhTQsI-XcC_mr4zzriiyi2D1bnwmpJC8d7SbwmvKk9SWj7JeDjGLC8Sf9opVGGX7aY-2jx6apvXBBkyTelBU9LbOvvsN-iwDl8u-9XzgvDn32gWCW9LDRGfpMheSZZcjoNeB9M8rKzHInhSjlZ-gRmnwJB_Vy4KCcOIE34-1m7O1iGPMBHr6mGbOMtINXaDIHQk65ffzaHDO2zlpi96DpNps0fkNLry_uBFcc-2ElVJKmOHeVxXPRxQaUfM1b3K2f0QROQ8-LnW90DutfmcKtZcrZmUUjlqKcQMg2ymafAUpIU54cAaL8EHvhxGiMhIvHMZ",
    "description": "About the job\n\nJob Description\n\nInfosys is seeking a DevOps Engineer. This position’s primary responsibility will be to translate software requirements into working and maintainable solutions within the existing application frameworks. The chosen candidate will apply technical proficiency across different stages of the Software Development Life Cycle, gather accurate requirements and work closely with stakeholders to prioritize tasks and the scope of development. The role will require strong attention to detail with the ability to identify errors and make adjustments in a testing environment while contributing towards developing and adhering to best practices for developing applications that are scalable, relevant, and critical to the project.\n\nRequired Qualifications\n\n\n Candidate must be located within commuting distance of Mississauga, ON or willing to relocate to the area. This position may require travel to project locations. \n Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education. \n At least 4 years of Information Technology experience. \n Candidates authorized to work for any employer in Canada without employer-based visa sponsorship are welcome to apply. Infosys is unable to provide immigration sponsorship for this role at this time. \n\n\nPreferred Qualifications\n\n\n Expertise with GitLab, Linux, SUSE, CI/CD. Familiar with Terraform and Ansible. \n Experience with some of the following: Kubernetes, Helm, Python, BASH scripting. Experience with hyperscaler services, Experience with Cloud Computing and Databases. Design, build and secure container images (Docker) with security best practices, minimizing attack surface and ensuring compliance with baseline configurations. \n Good Documentation and communication skill with cross team release and operations management. \n Desire and ability to work independently on complex issues, as well as collaborate efficiently with experts across different time zones. \n Create custom Splunk dashboards and alerts to monitor key security events, misconfigurations, and compliance violations. \n Analyze logs to identify anomalies, indicators of compromise, or potential security incidents. \n Debugging/Troubleshooting skills. Experience with building, implementing, and/or supporting multitenant solutions. \n Strong communication and Analytical skills. \n Ability to work in team in diverse/ multiple stakeholder environment. Experience and desire to work in a Global delivery environment. \n\n\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face. Extensive travel may be required as per client and project needs.\n\nAbout Us\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nEEO\n\nInfosys provides equal employment opportunities to applicants and employees without regard to race; color; sex; gender identity; sexual orientation; religious practices and observances; national origin; pregnancy, childbirth, or related medical conditions; status as a protected veteran or spouse/family member of a protected veteran; or disability. Infosys provides equal employment opportunities to applicants and employees without regard to race; color; sex; gender identity; sexual orientation; religious practices and observances; national origin; pregnancy, childbirth, or related medical conditions; status as a protected veteran or spouse/family member of a protected veteran; or disability.",
    "easy_apply": false,
    "posted_date": "22 hours ago",
    "scraped_at": "2025-10-10T16:54:18.214902-04:00"
  },
  {
    "title": "Snowflake Developer",
    "company": "Capgemini",
    "location": "Toronto, ON (On-site)",
    "job_id": "4312775704",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312775704&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=sNyO8ItYgomfmdTLSkGAYw%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPY-jJz2Z4rN8G5PUIkxubtEAWVyE9bk7BFi4tzaKygXaEaekA-Yp_LGwc2CgdV8Ssbze1XgM3nB25gfD8gEA2ZSlW_H35n0OxFtJpSU-rG-RO4ke4QTRHlAT3VcHPrDR92OYOBM5n0AgYXkTBTZIPTyxxczgp6xrrsKYcOgTiFa4NaqxF6XC082MljSvjzVmZh8ghZ30Mkphp-IHJNjTlKoMdsdzYAIV2xZ4H0AO5t42J0pvQcxd-ianufIc3Cl71yx10aHXrHM9r5NEr8XAwyxl5fb-_eztgixucEOpz7C7Z4z4az-19MExqpLYoNwz4-tLseMLO13ROxyM_lQWyLAe2iWcxcUiraiLVzXcuChh8jzyqLOToOFvR5rIKAU2HBoxXQwJpLCnOsP_dK3owbnZ12Zq7DKTo29EDR1ZhylMwaAQOh_qhIAawsi5v1l8ZEDlT0hxgJIg1qkIjPT9O",
    "description": "About the job\n\nChoosing Capgemini means choosing a company where you will be empowered to shape your career in the way you’d like, where you’ll be supported and inspired by a collaborative community of colleagues around the world, and where you’ll be able to reimagine what’s possible. Join us and help the world’s leading organizations unlock the value of technology and build a more sustainable, more inclusive world.\n\nJob Description\n\nWe are seeking a skilled Snowflake Developer to design, develop, and optimize data pipelines and data models in Snowflake. The ideal candidate will have experience in data warehousing, SQL, ETL processes, and integrating Snowflake with various data sources.\n\nKey Responsibilities:\n\n\n Develop and maintain scalable Snowflake data pipelines.\n Optimize queries and performance within Snowflake.\n Collaborate with data engineers and analysts to deliver data solutions.\n Implement data security and governance best practices.\n\n\nRequirements:\n\n\n Hands-on experience with Snowflake and SQL.\n Experience with ETL tools\n Familiarity with cloud platforms (AWS, Azure, etc).\n Strong problem-solving and communication skills.\n\n\nCapgemini is an Equal Opportunity Employer:\n\nCapgemini is an Equal Opportunity Employer committed to diversity, equity, and inclusion in the workplace. We promote fairness, accessibility, inclusion, and respect through our Partnership Accreditation in Indigenous Relations (PAIR) Committee, which supports meaningful engagement with Indigenous communities across Canada. We value the rich cultural heritage and contributions of Indigenous Peoples and actively work to create a welcoming and respectful environment.\n\nAll qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status, or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem.",
    "easy_apply": false,
    "posted_date": "23 hours ago",
    "scraped_at": "2025-10-10T16:54:21.972740-04:00"
  },
  {
    "title": "Intermediate Software Developer",
    "company": "FNF Canada",
    "location": "Mississauga, ON (On-site)",
    "job_id": "4313288537",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4313288537&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=1OljOlavjexTZ0gFmyrRSg%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=NOT_ELIGIBLE_FOR_CHARGING",
    "description": "About the job\n\nDate Posted: October 10, 2025\n\nLocation: Mississauga, ON\n\nFNF Canada is a leading service provider to financial institutions in the area of mortgage processing, tax and appraisal services, and title insurance. We pride ourselves on our relentless focus on enhancing the value of our services to our clients through continuous improvement and innovation.\n\nReporting to the Director, Software Development, the ideal candidate will be a client focused, highly professional self-starter with demonstrated experience in a similar function. They will also have a positive attitude with a high level of quality workmanship and attention to detail. The incumbent will be required to quickly develop an in-depth knowledge of the FNF Canada’s proprietary National Processing System and become familiar with corollary systems and technologies\n\nPrimary Responsibilities\n\n\n Develop and maintain Internet and Windows applications in both the Maintenance and Change Management streams. (Small and medium-scale development tasks.)\n Participate with various teams for larger Projects.\n Assist the IT Support team with production escalations and inquiries.\n Contributing towards analysis and design, including review/discussion of assigned requirements\n Assist QA and UAT teams with verification of completed development tasks.\n Develop and deliver enterprise level applications\n Creating appropriate documentation\n Achieve an understanding of the business objectives as it relates to system development\n Provide accurate time estimates and ensure deadlines are met\n\n\nQualifications\n\n\n Minimum 3 years of experience working with .NET technologies (ASP.NET, C#, .Net Core, MVC, Entity Framework)\n Minimum 3 years of experience with Microsoft SQL Server. Familiar with T-SQL and relational design.\n Experience with object-oriented and service oriented design & application architecture\n Incremental, iterative development\n Understanding and application of SOLID principles and other best practices in software development.\n Experience designing and developing RESTful APIs and B2B integrations\n Comprehensive development experience delivering enterprise web applications\n Experience with SCRUM/AGILE would be an asset.\n jQuery, Other JavaScript UI Frameworks (Angular, React) experience preferred\n Hands-on experience using Git for version control.\n Capacity to work within tight deadlines, often while balancing multiple, conflicting priorities\n Must be able to work with little supervision\n\n\nWhy Work At FNF Canada\n\n\n Comprehensive salary and benefits package\n Working in a fun, entrepreneurial and dynamic workplace culture\n Flexible work arrangements\n Opportunities for professional learning, development, and growth\n\n\nFNF Canada offers a competitive compensation and benefits package along with career growth opportunities with a Fortune 500 Company.\n\nInterested candidates should forward their resume via e-mail to hr@fnf.ca. We thank all candidates for their interest but only those selected for an interview will be contacted.\n\nDisclaimer\n\nFNF Canada is an equal opportunity employer. Accessibility accommodations for candidates with disabilities participating in our selection process are available upon request. We can be reached by:\n\n\nEmail: hr@fnf.ca\nMail: 55 Superior Blvd, Unit 100, Mississauga, Ontario L5T 2X9\nFax: 1-877-916-8035",
    "easy_apply": false,
    "posted_date": "53 minutes ago",
    "scraped_at": "2025-10-10T16:54:25.516476-04:00"
  },
  {
    "title": "ML Compiler Engineer , AWS Neuron, Annapurna Labs",
    "company": "Amazon Web Services (AWS)",
    "location": "Toronto, ON",
    "job_id": "4312931536",
    "url": "https://www.linkedin.com/jobs/search-results/?currentJobId=4312931536&keywords=developer%20not%20senior&f_TPR=r86400&f_TPR=r86400&origin=JOBS_HOME_SEARCH_BUTTON&trackingId=ObwMoQER6czzK2PskK72KA%3D%3D&refId=TUJGQaQvqEIyjXZ6szxPiA%3D%3D&eBP=CwEAAAGZz-YPY1YRH92NasF3JItkNj6UJozGzAL6Oz71HidrFh4UoK9XYwRNDTp3ATyXxuWUVwGpesNwkSfetonDaWzEK5ofQwJ4kpCKbOOhuUrVlak-fE8pkx--x3PiYYUkA0qgXUYkhYGfQXzD7Tn4iRnwHuSLdnA5s3sFGdLwMJDdDmeYt57d0wAq5kbZMKfAXroTJerxWyccU7AuAIZvtWutSgZJI4UoOBtcErVOvyktyWFI-nQCJwu_GvQxxV76luW_GQlFJk3FlreLh5E8v-q22TYkrY6_M6-AyRCgfE_hpF521oC07dVhdsrEVwpuWmi40xi_MT5QQm0yJrBUhP33Ay7SxX0CAgUjR-OAecNFPoaYjDzBJtK0Qme2IayxGTGgXHwxM6llm0avtxx3VdFSIJVt_GHAsfrY_HJztO5pKGwGi9xhP45XgLAgeGNr7LK9dlIEmqsKvhtcnhYzHiGDakrRh6eFzqJAwhwHcKyzDchVZW9r3BV5dbdq3eVwpw",
    "description": "About the job\n\nDescription\n\nThe Annapurna Labs team at Amazon Web Services (AWS) builds AWS Neuron, the software development kit used to accelerate deep learning and GenAI workloads on Amazon’s custom machine learning accelerators, Inferentia and Trainium.\n\nThe Product: The AWS Machine Learning accelerators (Inferentia/Trainium) offer unparalleled ML inference and training performances. They are enabled through state-of-the-art software stack - the AWS Neuron Software Development Kit (SDK). This SDK comprises an ML compiler, runtime, and application framework, which seamlessly integrate into popular ML frameworks like PyTorch. AWS Neuron, running on Inferentia and Trainium, is trusted and used by leading customers such as Snap, Autodesk, and Amazon Alexa.\n\nThe Team: Annapurna Labs was a startup company acquired by AWS in 2015, and is now fully integrated. If AWS is an infrastructure company, then think Annapurna Labs as the infrastructure provider of AWS. Our org covers multiple disciplines including silicon engineering, hardware design and verification, software, and operations. AWS Nitro, ENA, EFA, Graviton and F1 EC2 Instances, AWS Neuron, Inferentia and Trainium ML Accelerators, and in storage with scalable NVMe, are some of the products we have delivered over the last few years.\n\nWithin this ecosystem, the Neuron Compiler team is developing a deep learning compiler stack that takes state of the art LLM, Vision, and multi-modal models created in frameworks such as TensorFlow, PyTorch, and JAX, and makes them run performantly on our accelerators. The team is comprised of some of the brightest minds in the engineering, research, and product communities, focused on the ambitious goal of creating a toolchain that will provide a quantum leap in performance.\n\nThe Neuron team is hiring systems and compiler engineers in order to solve our customers toughest problems. Specifically, the performance team in Toronto is focused on analysis and optimization of system-level performance of machine learning models on AWS ML accelerators. The team conducts in-depth profiling and works across multiple layers of the technology stack - from frameworks and compilers to runtime and collectives - to meet and exceed customer requirements while maintaining a competitive edge in the market. As part of the Neuron Compiler organization, the team not only identifies and implements performance optimizations but also works to crystallize these improvements into the compiler, automating optimizations for broader customer benefit.\n\nThis is an opportunity to work on products at the intersection of machine-learning, high-performance computing, and distributed architectures. You will architect and implement business-critical features, publish research, and mentor a brilliant team of experienced engineers. We operate in spaces that are very large, yet our teams remain small and agile. There is no blueprint. We're inventing. We're experimenting. It is a very unique learning culture. The team works closely with customers on their model enablement, providing direct support and optimization expertise to ensure their machine learning workloads achieve optimal performance on AWS ML accelerators.\n\nExplore the product and our history!\n\nhttps://awsdocs-neuron.readthedocs-hosted.com/en/latest/neuron-guide/neuron-cc/index.html\n\nhttps://aws.amazon.com/machine-learning/neuron/\n\nhttps://github.com/aws/aws-neuron-sdk\n\nhttps://www.amazon.science/how-silicon-innovation-became-the-secret-sauce-behind-awss-success\n\nKey job responsibilities\n\nRole\n\nOur performance engineers collaborate across compiler, runtime, and framework teams to optimize machine learning workloads for our global customer base. Working at the intersection of machine learning, high-performance computing, and distributed systems, you'll bring a passion for performance analysis, distributed systems, and machine learning. In this role, you will:\n\n\n Analyze and optimize system-level performance of machine learning models across the entire technology stack, from frameworks to runtime\n Conduct detailed performance analysis and profiling of ML workloads, identifying and resolving bottlenecks in large-scale ML systems\n Work directly with customers to enable and optimize their ML models on AWS accelerators, understanding their specific requirements and use cases\n Design and implement compiler optimizations, transforming manual performance improvements into automated compiler passes\n Collaborate across teams to develop innovative optimization techniques that enhance AWS Neuron SDK's performance capabilities\n Work in a startup-like development environment, where you’re always working on the most important stuff.\n\n\nAbout The Team\n\n#1. Diverse Experiences\n\nAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\n#2. Why AWS\n\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\n#3. Inclusive Team Culture\n\nHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\n\n#4. Work/Life Balance\n\nOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\n\n#5. Mentorship & Career Growth\n\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\n\nBasic Qualifications\n\n\n 3+ years of non-internship professional software development experience\n 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n Experience programming with at least one software programming language\n\n\nPreferred Qualifications\n\n\n 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n Bachelor's degree in computer science or equivalent\n Experience in compiler design for CPU/GPU/Vector engines/ML-accelerators.\n Experience with System Level performance analysis and optimization\n Experience with LLVM and/or MLIR\n Experience with the following technologies: PyTorch, OpenXLA, StableHLO, JAX, TVM, deep learning models, and algorithms.\n\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Development Centre Canada ULC\n\nJob ID: A3105276",
    "easy_apply": false,
    "posted_date": "18 hours ago",
    "scraped_at": "2025-10-10T16:54:31.569511-04:00"
  }
]